[{"id":"rw8558535","title":"From a 9 to a 5","starRating":"5/10","datePosted":"21 September 2022","text":"My initial rating based on episode 1 was a 9; but now that I've seen them all my opinion has changed significantly.If I had to rate the show itself, at least my by IMDb show standards, it would be somewhere between a 7 and 8. The only good reason to watch this is to see Richard Jenkins' performance as Dahmer's father, because it's some incredible acting.The show itself is so... confused. It doesn't seem to know what it wants to do. On one hand it's trying to appeal to true crime fans that want to watch and hear about the most lurid and disgusting stuff imaginable. It wants to be a show about the philosophical implications of a person like Dahmer even existing. It wants to talk about the psychological conditions that bring about people like him. And it wants to do some social commentary about the police, racial issues.As you can imagine, it does none of this, because it doesn't have a focus. So what you've got is the first half that just feels like a personal story of Dahmer's, and the second which is like some boring, cliched drama about the families and the fallout of what's happened.As other reviews were asking, what is the purpose of this story? Was it to cover Dahmer? That's been done before, and it's not like it appeals to such a huge audience. Was it to explore philosophical questions of good and evil or maybe talk about policing issues in some places? Probably way better cases you could work with if that's your intent.The reason I'm giving it a 5 rather than a 7 is because the moral messages this show conveys aren't just twisted, they're also hypocritical. It celebrates Dahmer's death at the hand of some lunatic as if that's some great deed. It tries to say that it's a bad thing that some stupid comic featuring Dahmer wasn't banned, even as this show VERY GRATUITOUSLY depicts the killing of his real victims. Like, what?... It's pretending to be this respectful quasi-documentary that's imparting valuable lessons when it's anything but. It's damning what a hubristic view these creators have of themselves.Should you watch this? Not really. Any scenes worth your time will probably be on Youtube, and the whole package is not worth the 10h investment. There's nothing to learn here and nothing to gain."},{"id":"rw8558589","title":"Extremely Dark Story/Well-Done Mini Series","starRating":"8/10","datePosted":"21 September 2022","text":"This is a mini series chronicling the horrible crimes of Jeffrey Dahmer. Evan Peters is very good playing the title role. No campy stuff here, just plays Dahmer completely convincingly and serious.Makes effective use of flashbacks to Dahmer's childhood and teen years to explain how he turned out the way he did.Richard Jenkins plays Dahmer's father. He's great as a man broken by years of unhappiness culminating in realization of what his son has become. Penelope Ann Miller is wonderful in her short role as Dahmer's unstable, UFO-chasing mother.Niecy Nash has a small role as Dahmer's next-door neighbor. Her scenes are some of the most terrifying and unsettling, not for what you see, but for the sounds she endured. Love her in this role.The acting is pretty good across the board. The actors playing his victims were perfect at conveying terror. Shaun J. Brown plays Tracy Edwards, a victim, in the first episode. The scene had me on the edge of my seat. Without going into detail, the scene takes place mainly in Dahmer's apartment.Everything has a very dirty look to it, low lit, hazy. You could almost imagine the \"smell\" of the scenes. As horrible as that sounds, it does make for effectively creepy watching.Again, the subject matter is very dark and hard to endure. The series takes viewers from Dahmer's childhood up through his trial and imprisonment. I felt like Evan Peters completely inhabited his role. Also left me low with immense sadness for the families of the real-life victims, the survivors of his crimes, and the neighbors and others whose lives are left scarred by the actions of Dahmer the Monster."},{"id":"rw8558619","title":"Wow!","starRating":"10/10","datePosted":"21 September 2022","text":"This is disturbing, unsettling and really strange. It's brilliant!They should do all serial killer series like this. Not leaving any detail out at all. Make the audience actually get a look into the minds and reasons of why and how the killer kills.Evan Peters is fantastic, he played it so well. I saw him as Jeffrey and not as Evan. Every actor was amazing. I'm so impressed with this series.I never knew how white privilege the whole situation was with Dahmer. It's cringing and disgusting to see what actually happened during his active years.Very well done! The team that created this, please do more of other psychopaths like this series."},{"id":"rw8558654","title":"All of Nothing","starRating":"4/10","datePosted":"21 September 2022","text":"Ryan Murphy is a prolific writer and maker of TV/Film. The problem is, there is no quality control. Just look at American Horror Story, some amazing starts to seasons and then it just coasts for 8 episodes until a finale. I would like Ryan to learn that less is more, maybe have a 3 one hour mini-season with a lot more quality rather than the bloated 10 episodes with not a lot going on.Dahmer is coasting during the first episode, a lot of fat could have been cut from this entire season. Some of the real events seem to have been merged into others and the emphasis on the kitsch nature of the fashion is front and centre.As usual, Style over Substance."},{"id":"rw8558692","title":"Evan Peters is brilliant!","starRating":"8/10","datePosted":"21 September 2022","text":"I had high expectations of this. After seeing Evan Peters in AHS, I just knew he would be great in this role. He did not disappoint.I haven't seen many docos on Dahmer so don't really know that much about his personality or demeanor, but the character that Peters portrays is complex, creepy, and just plain twisted and evil.One of the most disturbing details of Dahmer's crimes that this series highlights is how the police ignored and dismissed witness reports, and their lack of action allowed Dahmer to stay free and kill more men.This series is excellent. I suggest you start watching it early in the afternoon as you will want to binge watch the whole series."},{"id":"rw8558694","title":"I'm an Evan Peters fan but I have to be honest","starRating":"9/10","datePosted":"21 September 2022","text":"I love Evan Peters I think he really does great with getting into his roles he has dhamer down for most part except for the speaking yes I believe dhamer wasn't a man of very many words but the accent he has off which if hard to pin point that accent it just kind of bothers me? I think my friend Dahmer did better in the accent area I know stupid thing to critique but that's what I didn't like from the jump. So far they're doing great with the facts which many people will overlook and for Evan Peters he's transformed into a dhamer look alike. The plot is very slow something's I do believe could of been taken out but then I believe it wouldn't be the full story. Overall accent aside I do like it a lot Evan Peters did a great job!"},{"id":"rw8558731","title":"Disturbing but good","starRating":"7/10","datePosted":"21 September 2022","text":"This is definitely the best portrayal of Jeffery Dahmer I've seen. Evan Peter's was great in this. Eat your heart out Jeremey Renner. No pun intended. It's about time someone made a mini-series about Dahmer's life. Mostly because this psychopaths story is way too intricate to squeeze into a two hour film. The 2002 Jeremy Renner film was terrible and the 2017 film My Friend Dahmer didn't do the story much justice. This show gets into much more detail. I had no idea his mother was on tons of psychological medication while she was pregnant. Or that she was a suicidal UFO nut. I never knew he spent time in Germany as a US Army combat medic. A lot of the events that took place were news to me. I'm glad I decided to check this show out. It's definitely worth a watch. 8 stars."},{"id":"rw8558785","title":"Evan the Dahmer","starRating":"10/10","datePosted":"21 September 2022","text":"I'm on episode 2 evan peters he's a real serial killer. Don't tell me otherwise. He's acting, the atmosphere of show , you feel scared and unsettling evey moment everything's is top notch, can't wait to finish this before the weekend. And also documentary coming next month it's really a big day for Dahmer lol.Ryan Murphy's and his team always never disappoint me , he's always knows what people needs and of course what we are hungry for lol, it's really good to eat and watching this you should everyone try it . Kfkfkfkfkfkfkfkfkfkkfkkfkfkckckkckckckkckckckkckckkckckckckkckckckkckcdifififfffff."},{"id":"rw8558929","title":"*No Spoilers* Full of time filler scenes(and filler episodes)","starRating":"3/10","datePosted":"21 September 2022","text":"The story is far too slow, not enough darkness and too many irrelevant stuffing scenes, i watched the whole thing and scrolled my phone for two whole episodes and missed NOTHING ...given that it is a short series they should have repackaged the story in a different eventful way where you get hooked not wanting to miss a single scene, the victims of Dhamer were too many and could have been utilized far too better than how they were for the storyFurther, the music choices were not on par for the mood requirement of such seriesAll in all, so much thought and money was put up for this show and it is very clear. However, poorly put together and I wouldn't recommend it at all."},{"id":"rw8559019","title":"Evan Peters is one of the best of this generation.","starRating":"10/10","datePosted":"21 September 2022","text":"There's something dramatic, intense about how that man can transform into his character.The producer (Ryan Murphy) has been working with Evan for more than a decade on American Horror Story so we've seen him in a few different roles and I'm always stunned at his talent.Murphy's been known to produce gems or the worst; worth a binge this one.Only 2 episodes in so my rating might change but this is a solid show with solid acting and even though some might find the start to be \"slow\", if you love creepy thrillers you're in for a wild ride and will love the pace.Loving the sometimes \"eerie filming\", there's a sinister vibe in every aspects of the show!"},{"id":"rw8559069","title":"Slow","starRating":"4/10","datePosted":"21 September 2022","text":"Very slow series, Netflix should have just put the money into more seasons of Mindhunters. They had us on the very edge of our seats.It only has stars for Peter Evans and the very brief scenes of Niecy Nash.I also would appreciate it if someone could, for once, just make a film that is in order. Do we really have to start at the end and then jump around?Apparently my review is too short so I'm just going to use the text suggestion is to be a good time to talk to you and your family and friends say that I have a great day and I will have to be a good time to talk toOk sorry for that. Enjoy."},{"id":"rw8559086","title":"A literall drag!","starRating":"2/10","datePosted":"21 September 2022","text":"Eveything Ryan Murphy does, is just horrible anymore, I liked the 1st 5 seasons of AHS, then it turned to crap, I haven't Liked any of his work besides, the assassination of Giovanni Versace, so I wasn't expecting greatness from this, I hoped it would be watchable though & its not, It's like he knows if he casts certain actors he'll make money off it, cause people will watch and that's exactly what he's done, look at American horror stories, what a hot, horrible mess, if u like that u might like this. I adore Evan Peters, I didn't in this. This was boring & extremely slow, no suspense, not much violence, so far ( I'm on episode 5) & that's surprising, it's not scary or eerie, I'm just pissed & done with it. It's like noone knows how to write decent shows anymore at all. You honestly could jump from episode 1 to 4 and not miss a thing! I'm pissed that I spent money and ordered Netflix to see this, ridiculous. I want my money back. I'm done with tv. Read a book. Get out of house. This crap ain't good for anyone mentally, especially with all the subliminal messages and smut he repetitively shows in his stuff..u know what I mean!"},{"id":"rw8559090","title":"It is like Mindhunter - you will learn how someone became a serial killer","starRating":"9/10","datePosted":"21 September 2022","text":"When I clicked to watch the \"Dahmer\"-release on Netflix, I thought it would be the so-many'th documentary on him. But what a surprise it was to see that it is actually a mini-series of the crimes that Dahmer committed. And what a mini-series it is!The acting is superb. The script is top-notch! The cinematography one of the best that I have seen in a true crime series of a serial killer!I am a big fan of Mindhunter, the show about the origins of the FBI's Behavioral Science Unit. And I must admit that Dahmer fits right into this type of shows! The show captured me from the first episode and it was a single binge from then on.I know that there are many other movies from for instance \"People's Magazine\" that portray the crimes commited by notorious killers. But what Netflix has shown with Dahmer, is a complete new level of enactment! The movies from People's Magazine are just amateur hour compared to the Dahmer-series.Netflix really surprised me big time with this great show! It deserves a solid 9 stars! And I don't easily give away a 9 star rating!"},{"id":"rw8559157","title":"Amazing!","starRating":"10/10","datePosted":"21 September 2022","text":"This is the best serial killer serialisation I've ever watched. It gave great insight into the back story and the crimes. Not least the despicable behaviour of the police at that time.I cannot even imagine the horrors of his police having to work on this case; it must have been absolutely horrific.And his parents, how guilty they must still feel if they're still alive. It must be like living in hell on earth.It was sad to see survivors having to live with this grotesque memory for the rest of their own lives.I'd like to hope that this director and writers look at other serial killers and look to create again."},{"id":"rw8559306","title":"Wow","starRating":"10/10","datePosted":"21 September 2022","text":"Suffocating. Nerve destroying. Heart wrenching. Disturbing.I had high hopes for this being a true crime addict and seeing a decent cast. But this went beyond my expectations. If you're expecting a gore fest you'll be sadly disappointed. If you're expecting a sinister emotional rollercoaster you'll be sated.Episode 6 is probably one of the saddest and sweetest pieces of television I've ever witnessed in 52 years of being alive. If you know the history of Dahmer you'll know what's coming which makes it even more heart breaking.I couldn't find a single weak performance and I'm expecting awards up the arse for this series. Well done Netflix."},{"id":"rw8559316","title":"Episode 6-10 is where this show hits. This is how it should be.","starRating":"9/10","datePosted":"21 September 2022","text":"We know Dahmer and his story or if not, a quick google is easy enough...but what about the victims? Where are their stories? How do we remember them if the highlight is always the killer? This is where Episode 6-10 comes in. As it focuses more on the victims, Glenda, his family and, not him. Would've given this show a 10 if they actually did this for all the episodes. Giving actual highlight to all his victims... their lives, their dreams...before all of it was taken away. Really digging into the blatant bias and racism of the police because those are looked over and this is a chance to expose it. I guess at the very least they actually showcased part of it.Now the first 5 episodes weren't bad at all. They didn't make Dahmer some romantic person. Evans really did great. He's creepy and scary and just overall made me want to remove him from the screen. I also applaud that they didn't overly glorify the killings. We got some scenes of death and gruesomeness but there was no blatant torture porn and rape where they focus on the victim's pain and anguish during their last moments just to make really disrespectful audience grab.For other things, it's a slowburn type of telling. It's a cruise basically. There's no pouncing action in here. I like the ost choice as well. It's griping and fits the scenes especially during tense moments. It also doesn't overwhelm you. One thing I'm not that into is how they spliced the timeline on some episodes as it jumps all over it's a bit hard to keep track. Overall a very good show. Would recommend.Warning: There's a good amount of blood and death shown."},{"id":"rw8559326","title":"Solid story, but slow drama","starRating":"8/10","datePosted":"21 September 2022","text":"Very good story, thrilling, amazing acting, but very slow and quite sometimes, anyway it's one of the best Netflix series, but i think it could be better if it was only five or six episodes.If you want to watch psychopathic series, that's the one you will like, it will blow your mind because it's very dark, Very good story, thrilling, amazing acting, but very slow and quite sometimes, anyway it's one of the best Netflix series, but i think it could be better if it was only five or six episodes. Very good story, thrilling, amazing acting, but very slow and quite sometimes, anyway it's one of the best Netflix series, but i think it could be better if it was only five or six episodes."},{"id":"rw8559344","title":"Evan Does it Again!!!!","starRating":"10/10","datePosted":"21 September 2022","text":"Wow!!!The delivery was just chilling. Casting director really did do that.Storyline and directorship is remarkably intimate for something that carries a heavy 'otherness' to it.The silence, the confusion (Did Dahmer have prejudices or was it circumstance based on his environment? Did he choose to live there? I mean, he wasn't earning top dollar, but still (?)). Gotta do that thing with the research post watching this, I know we're a movement 😅 🇰🇪Set in the backdrop of highly stigmatised gay people, people living with HIV (in this era, those two are one and the same), and (still very present) racism (opening scene, be sure to watch with subtitles else you might miss it as the audio is secondary to the audio from the opening actor's scene), in nuanced detail (the racism part), this mini series delivers what you think it will, and more.Brilliantly dramatised story."},{"id":"rw8559407","title":"When you dissect sentients without remorse...","starRating":"9/10","datePosted":"21 September 2022","text":"What do you expect? Yes, I believe that ruthlessly killing sentients played a role in the evolvement of Dahmer's psychopathy. It has been noted through various studies that animals are often the first and most unfortunate victims of serial killers.Evan Peters' portrayal of Dahmer was spotless. From the accent to the way he walked, spoke and more, Peters' brought Dahmer to life in a gruesome, cold, sociopathic way. While Dahmer's parents were fractured and highly flawed individuals, trying to blame his actions on them is somewhat illogical.Supporting cast were amazing in their reactions to Peters.Highly recommended!"},{"id":"rw8559420","title":"Disturbingly brilliant","starRating":"10/10","datePosted":"21 September 2022","text":"I have been waiting to watch this for some time now and I am not disappointed! Evan Peters portrayal of Jeffery Dahmer is a masterpiece.Right from the beginning I was hooked & throughout, it was very accurate to the real facts behind the horrific story of Dahmer.All the actors starring in this were fantastic, great selection.Usually with serial killer programmes/series they're not good, they feel very fake but this was not.Ryan Murphy needs to do more series on serial killers as he very talented and can portray their lives in a way that keeps the viewer hooked. I can not wait to see what else he brings out.Definitely worth a watch."},{"id":"rw8559429","title":"Excellent","starRating":"9/10","datePosted":"21 September 2022","text":"I was not sure I wanted to go back to the time of Jeffrey Dahmer however I turned EP 1 on this morning and I could not stop watching it. This series is so very much more than the gruesome reality of Dahmer. It delves into much, much more, equally disturbing facts / truths regarding the parents, victims and the police. In my view, the ugliness of the police is equal to the evil of Dahmer.A standing ovation to all involved in this production as every aspect is sheer excellence.Be prepared to binge this whole series in one sitting! It is truly that great.Thanks to Netflix for producing some of the very best streaming out there!!!"},{"id":"rw8559482","title":"Very well done drama spoiled by filming in almost complete darkness.","starRating":"5/10","datePosted":"21 September 2022","text":"This is an excellently acted series, with a reliable script. However, the choice of the creators Ian Brennan/Ryan Murphy to bathe the entire series in a dark yellow palette is questionable. Even looking at the stills on IMDB, you get the picture of how dark and difficult to see this show is. I realize that the subject matter is dark and menacing but saturating the whole thing in urine-colored hues detracts from the formidable talents of the actors and crew.Evan Peters is fine as Dahmer but the ever reliable Richard Jenkins really makes this series work. Recommended but only if you adjust the hues and brightness of your television."},{"id":"rw8559539","title":"Just ridiculous","starRating":"1/10","datePosted":"21 September 2022","text":"It's not worth your time.There are other films much better done, find the list on wiki.Everyone knows the horrifying story so I won't go into that.But this movie is just so horribly made. Shakycam makes a full on appearance.The co stars and the starring actor can't act at all, period. For some reason the directors thought having the actors gaze off into the distance carries more weight - it doesn't. The story moves slower than molasses in winter, and just degrades the victims rather than telling the story of what went on.Just go watch one of the older films that does a much better job from all angles."},{"id":"rw8559584","title":"Awful in the best way!","starRating":"9/10","datePosted":"21 September 2022","text":"This is amazing. From episode one you are hooked. I was not expecting the way it was filmed in terms of timeline / cinematography but the choices were really good.Evan peters outstanding. He really makes you hate him even more than you already did.This show gives a real insight into the psychology and backstory of one of the worst serial killers ever. It also reminds me a bit of mind hunters from Netflix in terms of how the story unravels.As a fan of crime documentaries I thought I knew what there was to know about this story but there is so much more that gets spoken about and highlighted. A must watch."},{"id":"rw8559619","title":"Gripping and tense","starRating":"9/10","datePosted":"21 September 2022","text":"I'm not one to comment on other's opinions but I've read a few reviews saying this is another poor output from Ryan Murphy and it's simply not true. I am in favour or Murphys previous work however I've found the more recent stuff to be low quality or hit and miss at best but this is redemption in my eyes. Dahmer has a completely different feel from the all previous shows. The tension builds nicely from the start and it heavily depends on the story telling by not going for cheap thrills and keeping the gore to a minimum. Implied violence, great dialogue and non-linear timeline make it gripping. The cast turn in solid performance's and Evan Peters is as consistent as ever. Definitely worth your time."},{"id":"rw8559696","title":"Another Miss for me","starRating":"6/10","datePosted":"21 September 2022","text":"I generally liked AHS so I figured I would give this a shot. I was disappointed by Ratchet but since this has Evan Peters and Niecy Nash I thought it may be ok. Once again, this entire series could have been a film and dragged out to the point that I kept tuning out. A lot of that could be because we all know the Jeffrey Dahmer story as it has been beaten to death but it was nice to have it told more from the victim's perspective vs Dahmer. Evan's acting is solid (accent could have been toned down) and it is very stylized but that's it. Watch it if you want to kill some time but as other reviews said, if you are more interested watching to see how the mind of a serial killer works, watch Mindhunter."},{"id":"rw8559799","title":"The most Disturbing of all Dahmer Stories","starRating":"9/10","datePosted":"21 September 2022","text":"This was a hard watch....for many reasons. Having been a young adult when all this happened, it....what do the kids say?...it hits different.Well, it's the Dahmer story. So by default, it's hard and gross and scary.The acting is top notch. Every performance...it's like you're right there in the room watching this God awful series of events unfold in real time. How the actors got through this is beyond me.The timeline shifts can be a bit hard to follow. It's not the kind of thing you can just pause and come back to. You have to rewind or start the episode over.Overall, arguably...this is the best Dahmer depiction. I would recommend watching \"My Best Friend Dahmer\" prior to watching this, as it accidentally and appropriately serves as a prequel.Recommend for cast iron stomachs. Don't watch this if you're prone to puking."},{"id":"rw8559904","title":"THE GRUESOME AND HORRIFIC TRUE CRIMES OF DAHMER AND THE SYSTEMIC FAILURES","starRating":"8/10","datePosted":"22 September 2022","text":"Great show. A slow burn. Really disturbing, twisted and sad all at the same time. Honestly there were parts I had to turn away.(the blood drinking scene. I know it's fake but stilll) lol. Gave an unsettling kind of vibe and gut wrenching realization of what atrocities this monster committed. It's heartbreaking to know this guy could have been stopped multiple times and the cops failed smh.. Definitely getting the show mindhunter vibes~ The show reaches for an uncomfortable reality at every level, from its wearied set design to Peters' monotone manner of speaking. The show really prioritizes the voices and narratives of Dahmer's victims over the man himself. It's a creative choice that makes the resulting series endlessly tense while giving this story the weight it deserves."},{"id":"rw8559914","title":"Overall a good watch, however...","starRating":"8/10","datePosted":"22 September 2022","text":"Evan Peters makes an amazing performance, first and foremost. He depicts Dahmer very well, down to the smallest details. HOWEVER....what kills this show, is when it starts to move away from the subject matter (Dahmer) and begins to focus more on black empowerment, and like so many shows/movies today, the \"woke\" agenda. It gives you the feeling as you get later in the show that this was funded by Jesse Jackson, Al Sharpton, and Black Lives Matter. Utter garbage after Episode 6. You can save yourself time and just watch until then. The rest of the show had no focus on him and became intolerable."},{"id":"rw8559964","title":"Exceptional film making","starRating":"10/10","datePosted":"22 September 2022","text":"From the script, cinematography, acting to the casting and costumes this is film making at its best. Binged watched this in one night until 3 am. Captivating and horrifying at the same time. The acting is superb from all involved. The fact it's all true is the worst part about it. Do not believe those 1star and similar reviews and those making quick judgement after watching 1 episode. The story it's self it's so complex you can't possibly make a opinion after watching one episode which is just a tiny piece of puzzle from such a large scale frame of occurrences. I live for documentaries and especially for tibiae which tell past events. This is one of those you'll never forget."},{"id":"rw8559990","title":"gut wrenching, stomach turning, masterfully created","starRating":"10/10","datePosted":"22 September 2022","text":"I will start by saying this, I watch a lot of true crime. Whether it be 48 hours, or documentaries, biopics, you name it and i've probably watched it. That being said, I have yet to see something as jaw dropping and moving as this series right here. I am pretty numb to the brutality of all of these events because i've read about them or seen them portrayed so many times in different variations of media, so it is very rare for something to actually evoke a sort of emotion out of me.Evan peters' portrayal of Jeffrey Dahmer is the best I have ever seen. I'm a fan of his work in previous projects (ahs, american animals, x men etc) so going into this I already knew I was in for a treat. But MAN. I genuinely became nauseous at the sight of the vicious acts displayed in this show, Ryan Murphy held back no punches, and I believe the show is better for it. The reality of what this sicko did is just beyond comprehension, and I truly believe that Evan and Ryan and the entire team involved have truly captured that. I am 4 episodes in as of now and am sitting in absolute shock.This is the first show I have actually had to take a break from, sit back and just let it soak in the true horror of what i'm witnessing. I'm no actor myself so I won't say I know what it takes to play a murderous psychopath like Dahmer, but I can't imagine it's easy. Kudos to the entire production team, Ryan Murphy, and Evan Peters. I will ALWAYS be a fan!"},{"id":"rw8560052","title":"Stellar cast","starRating":"10/10","datePosted":"22 September 2022","text":"It's about time with som quality from Ryan Murphy, who, the last couple of years, have been a disappointment. Here is the same quality as seen in the first couple of season of AHS.I LOVE the performances in this show. As always Evan Peters is brilliant. This time supercreepy and convincing as Dahmer. He has a great career ahead of him and he already has proven his range and superiority. My heart bleeds for the sublime Richard Jenkins. He is, as always, incredible, here portraying Dahmer's father. The scene in the interrogationroom is heartwrenching.So far only two episodes in. Can't wait to watch the next eight. Love this show!!!"},{"id":"rw8560066","title":"Couldn't breathe during episode 1","starRating":"10/10","datePosted":"22 September 2022","text":"I actually screamed when my cat jumped up on the couch as I was watching this. The episode is taut and terrifying from the first moment. The code cinematography is perfect. The score adds an eerie element that ups the intensity. I was so scared, worrying about which part of Dahmer's story I'd be watching. Tense is a perfect descriptor of the mood for the majority of this episode.Evan Peters is brilliant once again. Can't wait to see the rest although I'm worried about what else they will show. I've read a lot of Dahmer, nothing compares to this. Wow! I hope it doesn't fizzle out as AHS is wont to do."},{"id":"rw8560113","title":"Great until Jesse plays the race card putting trial at Risk","starRating":"8/10","datePosted":"22 September 2022","text":"Dahmer was a pure demented evil psychopath. His actions met all elements of mens rea and actus rea . There was a mountain of inculpatory evidence .The smell of a human body is very distinctive and strong . I can identify it from the street . The smell alone is enough to raid his unit via search warrantAs a 25 year plus cop / detective - any person on the street in underwear , bleeding would automatically result in hospital admission . Blood sample taken , finger nail scrapings, DNA / Prints taken to prove the kid was in Daumier's house. A formal statements from 911 callers / witnesses and victim . Search/crime scene warrant on Dahmers unit . The search done With the police doctor . Forensic imaging / Hazmat etc . All 911 calls examined and any police negligence acted upon .All victims who went to the police must have been believed , drug tests done to determine jefferis M/O . Serious statements obtained . Nail crapping obtained ,The smell alone is enough to kick the door in without warrant .Dahmar was a lot of horrendous things, but racists -NO. He lived in a black area and he took his victims from that area . As soon as. Jackson sticks his head in the show - here we go , it's woke time here we go. His input could poison a jury - pre trial and Jeffrey gets off or miss-trial . The trial should have been suppressed to avoid sny appeals.caused Jackson's crusade . Jeffrey could have appealed every tine Jackson or witnesses went the media routeMedia interactions pre trial can cause a mis trialThe police failed the victims , But the judiciary can act diligently and impartially to ensure Jeffrey hot his just punishment .Those 2 cops that showed zero duty of care on the boy - they would be FIRED and charged for criminal negligence - no reasonably duty of care . All other officers who were called - also questioned / suspended .The local uniform police were clearly lacking training / numbers and overall care . Any decent cop can smell\nNear. 90% of black men are murdered by other black men . People like Jackson play the race card , but in reverseWe had a similar case in Australia 🇦🇺- \"bodies in the barrel case."},{"id":"rw8560138","title":"American Dahmer Story","starRating":"3/10","datePosted":"22 September 2022","text":"Realizing this is called Jeffrey Dahmer: Monster, Evan Peters, who is producer Ryan Murphy's own personal go-to pawn, ala Malcolm McDowell from Clockwork Orange, seems to be literally playing a monster, and a brain-dead zombie at that...To think all those gay men were picked up on, and allowed themselves to be taken to the apartment of, a guy who could hardly function, could hardly even walk down the street without seeming like he's about to burst... A guy so monotone, robotic and sleazy anyone with a brain would run the opposite direction...That's how Peters decided to play an actual non-fiction person, who was, indeed, a human monster, but the monster comes from what he did when he got what he wanted and was able to DO what he wanted...But the problem here is there's no character-arc for Dahmner... He starts out a droning freak and winds up the same way... As for his accent, it seems unnatural and put-on... performed...Meanwhile the pace doesn't flow; it's a real slog to get through.... There are so many interesting aspects of Dahmer's life to be studied, to experience, and yet the entire thing feels like it's deliberately slow-motion-arthouse-weird for the sake of style instead of substance...Through school, through the army, through gay bar hookups, through everything in Dahmer's entire life including interrogation, he's a one-dimensional cardboard-cutout of how a novice acting student would IMAGINE a crazy person to be...And many good reviews are noting how off-putting and creepy this is, but... if everything's off-putting, what's there to compare it with? In fact, most of the other characters, from his victims to bosses to the police and especially Richard Jenkins as his dad, are equally as stone-faced and drowsy...Overall, MONSTER is more like another chapter of American Horror Story instead of an actual serial killer biopic... and those can be amazing, but Ryan Murphy and his boy are too stuck in their usual pretentious rut to let an actual story (of an actual person) shine through."},{"id":"rw8560181","title":"You did good, Netflix.","starRating":"9/10","datePosted":"22 September 2022","text":"Wow. Evan Peters is an amazing actor. I've been keeping up with him since AHS. He's so diverse and talented.This story is so...sad. I've read about Dahmer and the way people dealt with mental health back then is frustrating and completely infuriating. Most people that knew him knew something wasn't right. I know his dad tried...a little. But I wish more was done to keep him behind bars or in a mental institution.Seeing his victims from their point of view was the hardest part of this entire series. Excruciatingly heartbreaking.I wish shows/movies would show more of this. Yes, we're all intrigued with how someone could be so incredibly messed up. I personally want to see the psychology behind it. There's always a reason.But we need more focus on the victims, who they were and how it tore up their families up... Forever.Maybe it'll help others to see the signs and help to stop the person from doing awful things.All in all, this series was amazing.Props to Netflix for doing it right."},{"id":"rw8560190","title":"Brilliant!","starRating":"10/10","datePosted":"22 September 2022","text":"Honestly, this film is difficult to watch knowing what Dahmer does to his victims. However, the sheer brilliance of skill by the film crew and acting by Evans makes it hard to look away.We as the viewer get to witness what must be the inner dialogue; the psychological 'fight or flight' that goes on inside the minds of the victims before their escape or death by Dahmer (Evans).It is refreshing to watch a true crime series that focuses on the victims and their families; not the perpetrator so much.It's just incredibly sad how the police failed so many of the victims and let this evil person act out his fantasies time and time again."},{"id":"rw8560210","title":"Compelling and repellant in equal measure, Dahmer is the most definitive look at not just the titular killer, but the origins and fallout of his heinous actions.","starRating":"10/10","datePosted":"22 September 2022","text":"Starting in July 25, 1991, notorious serial murderer Jeffrey Dahmer (Evan Peters) is arrested when Dahmer's potential victim Tracy Edwards (Shaun J. Brown) miraculously escapes and brings the police back to his apartment. Dahmer is arrested after uncovering the various horrors and mementos from Dahmer's murders, we soon go back through Dahmer's past to see what lead him to this point before eventually shifting focus to the stories of the victims, the fallout felt by the community and victims' families, as well as the bureaucratic and law enforcement failures that allowed Dahmer to continue indulging his twisted appetites.Dahmer-Monster: The Jeffrey Dahmer Story is the latest project from noted producer Ryan Murphy whose prolific work on the likes of American Horror and Crime Story lead to him getting an overall deal with streamer Netflix. Beginning development in 2020, the miniseries is the fourth dramatic take on the infamous serial killer following three independent productions, 1992's The Secret Life, 2002's Dahmer, and 2017's My Friend Dahmer receiving very degrees of responses with My Friend Dahmer arguably the best of the three. When the miniseries was first announced I was skeptical because I didn't think there was any more to be told about Dahmer than we'd already learned from years of rubbernecking let alone three film attempts, but much to my surprise I found this miniseries to not only exceed my expectations, but shattered them as Dahmer-Monster: The Jeffrey Dahmer Story is one of the year's best TV shows and if you end up seeing only one Dahmer related piece of media in your life, make it this one.While the show may be titled after serial killer Jeffrey Dahmer, he's only half of what this movie is about. While the first 3 or four episodes dive extensively into Dahmer's childhood from age six where he first began to manifest his macabre interest in dead animals and dissecting them through his teens and 20s where we see the effects of Dahmer's unstable homelife, repressed homosexuality, and darkening appetites, the movie places more focus on the lead-up to Dahmer's actions as well as the fallout that came after the horrifying revelations came to light (and not just with Dahmer himself). Intermixed with the scenes of Dahmer socially engineering his victims, struggling with keeping his compulsions in check, or failure to maintain professional and personal relationships, we're shown a series of failures either through incompetence, apathy, distraction or neglect that disregard the obvious warning signs surrounding Dahmer as he deals with barely concealed issues that are missed by parents, educators, law enforcement, or administrative officials with those who actually try to shine a light on Dahmer's actions ignored at best or punished or threatened with punishment at worst. This is a show that despite being set in the early 90s is no less prescient today with issues such as systemic racism and homophobia still very much allowing inaction or harm to victims, and an award ceremony scene where two police officers are rewarded for simply avoiding responsibility for handing a child over to Dahmer will make your blood boil with how little has changed in regards to the \"blue wall of silence\" and the corruption of police unions in keeping unfit officers out of the profession.The acting is solid across the board. Evan Peters is really good is the titular Dahmer as he captures the tragedy of his situation in the early years, but Peters and the creative team don't try to use this as an excuse or easy answer (an epilogue says as much there's no simple answer) and Dahmer's metamorphosis from struggling confused adolescent to cold calculating opportunistic predator who justifies his actions with a false victimhood complex makes it clear that Dahmer's actions have no \"out\" from his responsibility for them. The movie is an ensemble and features a number of characters either recurring or one off who are integral to the plot. Easily my favorite comes in the form of deaf actor Rodney Burford who plays Dahmer's victim Tony Hughes and the entire episode is anchored to the POV of this character with characters using ASL to communicate, muffling the audio to create verisimilitude, and you feel like you get to know Hughes in a way we've never been allowed to see before. Make no mistake, this is a starmaking performance from Burford so expect to see much more of him in the future, I guarantee it. The show also features terrific performances from arguably the two \"cores\" of this movie, Niecy Nash as Dahmer's neighbor and until now unsung hero of this story Glenda Cleveland, and veteran character actor Richard Jenkins as Dahmer's torn and conflicted father Lionel.With Nash's Glenda, we get the feeling of powerlessness and helplessness from the people on the ground affected by Dahmer's actions as noted in the movie that Dahmer lived in a cheap rundown part of Milwaukee and targeted mostly people of color as his victims. While Glenda reports the awful smells coming from Dahmer's apartment to the landlord as well as sounds of screening of fighting to the police, not only is she often ignored, but is shouted down by the police such as the infamous incident wherein officers John balcerzak and Joseph Gabrish took Dahmer's word that 14 year-old Konerak Sinthasomphone was actually his drunk 19 year old boyfriend instead of his victim who'd been given an amateur lobotomy by Dahmer instead of an escaped victim despite Glenda's pleas. The movie isn't excessively gory as the gore is limited to only plot important scenes, but just because it's not as bloody as Saw or Hostel doesn't make it easier to watch and in some cases it's actually harder. Richard Jenkins is really strong as Dahmer's father Lionel and the different points of the story that portray him as wanting to help his son but not knowing how are heartbreaking because you see in Lionel the confusion and discomfort that make him unable to give Dahmer the help he needs because he very much denies there even is a problem and tries to write it off as something that can be cured with tough love or firm guidance. There isn't any singular point of blame you can link to Dahmer (as the show isn't about \"understanding Dahmer\"), but the show does give us some potential issues such as a mentally unstable mother, a distant father, and internalized feelings of abandonment, but even then these aren't frame as excuses. The show stays good even after the actual crimes of Jeffrey Dahmer are over and done with by the halfway point, as the show shifts focus away from Dahmer and looks at the media fallout, the insane fandom surrounding Dahmer, the exploitation of tabloids and indie comics that trivialize Dahmer and his victims, and to watch these victims and their families be at the mercy of harassing phone calls and invasive pictures by rubbernecking tourists is painful to watch.If I haven't made it clear, Dahmer-Monster: The Jeffrey Dahmer Story is one of the best TV projects I've seen this year and I can't recommend it enough. My one point of criticism is I felt certain tangents related to Ed Gein and John Wayne Gacy seemed a little out of place and I wasn't sure why they were presented the way they were with such polished detailed flashbacks, but other than that one misstep I really think everyone should see this show."},{"id":"rw8560304","title":"Yet another Netflix failure","starRating":"2/10","datePosted":"22 September 2022","text":"Okay, the first episode was promising. The second episode was meh but I hung in there. By the third episode my suspicions were confirmed. Ryan Murphy decided to gloss over facts and turn it in to a Lifetime Network miniseries of the week. Lots of fluff and filler over the the actual story. There is so much in this series that can't possibly be true. Murphy decides to tell us more about Dahmers parents, early years, teen years and high school years. Things that he possibly couldn't know. It's all fiction and filler. Meanwhile you're taken away from what you came for, to learn about Dahmer the Serial Killer and his psyche. There is no real exploration in to that or the horror his victims endured. It's really just a fictional puff piece sprinkled with factual events. And Evan Peters was not the right actor for this. He's just too likeable. You may actually feel sympathy for Jeffrey Dahmer and at times see him as a victim himself. What an insult to the real victims and their families and the horrors they endured from this monster. Quantity over quality at ten episodes. That's the Netflix way. This could have been done effectively in four episodes and stick to the facts with much better actors and director. Big swing and a miss by Netflix, again."},{"id":"rw8560313","title":"Still trying to find the words .. just wow.","starRating":"10/10","datePosted":"22 September 2022","text":"I'm only on Ep.5, and this has far exceeded my expectations. Evan Peters truly becomes Jeffery Dahmer, to his lack of intellect, to rages and outbursts, to the anticipation of the build-up of the sexual arousal Jeffery accumulates while going through his experiences / experiments on victims. You truly feel like you're getting to know Jeffery Dahmer, as Evan Peters perfectly guides you on a walk through his deranged mind. It's evident Dahmer has always been an outcast, and fact of the matter is he's always known that he was. He had temptations that would never silence, and would get worse and grow louder overtime. I am not sympathizing Dahmer, but there is a reason he was sloppy with his victims it's because he never truly feared being caught, he simply adhered to his temptations, with no ulterior motive to keep on doing it.Wicked and disturbing to see just how even more corrupt our system was during this time period, while we assumed he was clever and escaped the police; the fact of the matter was during that time frame the police chose to look the other way when it came to homosexuals and the black community.Now and days we tend to glorify there masterminds in being a serial killer, but this series depicts perfectly how one becomes a serial killer diving into the mind of how it can begin.While there is not much gore, it is by far one of the most disturbing things I've seen blood or not, because of how surreal this all is and knowing this series is HEAVILY fact-based."},{"id":"rw8560345","title":"Where's Evan's Award for Best Performance of the Year?","starRating":"10/10","datePosted":"22 September 2022","text":"There are no doubts that Evan Peters has killed this role by delivering one of the most engrossing performances of his career, and that's saying something considering the aptitude of his many esteemed performances to date. Dahmer's entire childhood outfitted for audiences to get a further in depth understanding of his delving into degeneracy and the reasons behind his atrocious actions. The fault of a system that didn't care about helping those who showed signs of psychosis and allowed a young man to fall through the cracks along with a corrupt and negligent police department that chose to turn blind eyes and deaf ears due to the nature of homosexuality and people of color being Dahmer's main victims because of obvious systemic racism...all of it set to Evan's performance was outstanding. I can only hope people learn from the many lessons this horrible tragedy, but the engrossing way that Mr. Peter's acted in this very challenging role is an absolute stunner."},{"id":"rw8560532","title":"Creepy as hell","starRating":"9/10","datePosted":"22 September 2022","text":"I've been waiting for something since Mind-Hunter got cancelled that would fill it's sinister void, and this new limited series by story-telling legend Ryan Murphy is IT!!Absolutely loved Crime Story & AHS so I knew this would be to the same high standard of acting and production - I wasn't wrong.Evan Peters is chilling at Jeff Dahmer. I read somewhere that Peters has to take long breaks after filming with Murphy as the characters he often plays are so dark, twisted & vile.... And boy, he plays them so well.He'll probably have to take a year off after this one... the first episode alone was terrifying!!Really looking forward to binging the rest of this one.***update*** now on episode 6 and well and truly invested in this show, it is GRIPPING. Bravo to Ryan Murphy for casting real Deaf actors in this episode. They were incredible :)"},{"id":"rw8560533","title":"Good but far too long","starRating":"7/10","datePosted":"22 September 2022","text":"A great show but severely needed editing down, I finished the 5th episode and could not understand how there were 5 left, and then when I finished the 9th episode I really couldn't fathom why there was a 10th when everything already felt wrapped up.That being said the acting from everyone is really quite great, the show looks good, sounds good (apart from dahmers accent) and the story itself has a follows an interesting timeline.Episode 6 Silenced is by far my favourite, the actor for Tony is great and I felt so tense the entire episode, even pausing halfway because I just didn't want things to escalate the way you predict them to.Overall 7.3/10."},{"id":"rw8560621","title":"Never forget the victims....","starRating":"8/10","datePosted":"22 September 2022","text":"The show is one of the very few Dahmer presentations that show respect for the victims and their families IMO.Additionally it sufficiently calls out the failures of law enforcement and the backdrop of urban decay with racial tension... much of which still exists today in blue collar Americana.Much of the intrigue still lies in the enigma of Dahmer as a quasi sympathetic monster. The fact he was murdered was a missed opportunity to further understand the nature/nurture paradox underpinning most all serial killers.Some superb performances all round, especially Joyce and Lionel Dahamer. Evan Peters wore pure Evil like a second skin; a creepy yet nuanced masterclass.My heart goes out to the 17 souls and their families. Let's not forget what this is about."},{"id":"rw8560638","title":"a real masterpiece.","starRating":"10/10","datePosted":"22 September 2022","text":"What a brillant and mesmerizing while terrifying series ! Evan peters did again. Just give him already the emmy for best actor in limited series .For me , him and jeremy strong are the best actors in this new generation!Watched it all in one day . Kudos also to ryan murphy , he delivered again ! I think after this show , there no need to depict the Dahmer again . He was portrayed perfectly . And i like the way it also focused on the homophobia and racism at that time , and the disdain from the police towards those group minorities.Finally Netflix gave us a good series to watch because it's been a while that they did."},{"id":"rw8560667","title":"Unprecedented","starRating":"9/10","datePosted":"22 September 2022","text":"The very first episode is some of the most intense television I have ever watched. Starting off in reverse, I was a bit unsure but as it developed it just got more and more extreme.Evan Peters does a brilliant job as always, I feel like he is one of the most underrated actors of our time but glad to see he continues to work with Ryan Murphy on some iconic television, Pose was brilliant. I genuinely have not seen a premier episode that hit the mark as this one did. It is definitely not easy viewing and many may struggle with the gore and the level of violence that is depicted. Onward to episode two."},{"id":"rw8560714","title":"Wow Evan...wow!!","starRating":"10/10","datePosted":"22 September 2022","text":"This is so well done and Evan Peters is stellar as Dahmer! He did so well that I am concerned for his mental health after this.The accuracy and reminder of the absolute dumpster fire the police created made me angry all over again.Ryan Murphy once again knocks it out of the park with his amazing story telling. I really hope that he, Evan and Neicy are all recognized for their amazing abilities to tell a story.I feel that framing this one in a mini series format allowed the full and total story to be told in the most thorough way possible. While the subject matter is disgusting, they tell the story as completely, without being gratuitous or overly gruesome, keep in mind it's a serial killing cannibal we're talking about, but it's well done."},{"id":"rw8560757","title":"Well made but...","starRating":"7/10","datePosted":"22 September 2022","text":"The acting and screenplay is just superb, no denying that at all Evan Peters should get all the awards and recognition he deserves.I agree with other comments though with regards to the fact that it's packed with a lot of filler and fiction. I feel like with subject matter such as this it should try to stick closer to the facts as opposed to all the fluff.Also product placement can be a bug barer of mine, especially when it is included in a scene and the focus on the brand is completely unnatural. He had a drinking problem but was his drinking problem exclusively Budweiser? It starts to annoy me when every other scene the Bud brand is the sharpest thing in shot. Sometime laughably.. shame."},{"id":"rw8560798","title":"TOTAL BINGE WORTHY","starRating":"10/10","datePosted":"22 September 2022","text":"The story of one of the most notorious serial killers in the United States, largely told from the points of view of his victims. Being a fan of creepy thrillers and the horror genre I had to binge watch the entire 10 episodes each running 60 minutes. Ryan Murphy scores big on this one and is forgiven for some of his stinkers.Evan Peters as Dahmer is totally intensely creepy that I had to keep the lights on while watching. It is amazing how he can play any character tranforming himself. Niecy Nash as the concerned nosey neighbor deserves an Emmy for her role. The rest of the cast are superb as well.Make sure your doors are locked,the lights are on and you order enough food and drinks if you plan to binge watch this as I did."},{"id":"rw8560876","title":"OUTSTANDING AND AMAZING","starRating":"10/10","datePosted":"22 September 2022","text":"My husband I watched this yesterday all 10 episodes omg what a mini series from start to finish EVAN\nPETERS FANTASTIC AS JEFFERY DAHMER as we're all the actors never knew it was his white privilege let him get away with murder for so so long and how he was honest in his police interviews I didn't see EVAN PETERS as the AHS actor but JEFFREY DAHMER looks mannerisms the works or that a double hernia op could be blamed for the way he turned out 1 of the best real life mini series we have watched since ZAC EFRON as TED BUNDY. How the police ignored his neighbours follow up enquires over the safety of the 14 yr old they took back took him 10/10."},{"id":"rw8560938","title":"Creepy but amazing portrayal!","starRating":"8/10","datePosted":"22 September 2022","text":"Evan Peters has potrated Jeffery Dahmer, amazingly well. You could visually see the works of an evil psychopath though the screen. Don't get me wrong I was totally creeped out on some parts. So much so I had to look away but this just goes to show how much of a good job he has done. I would definitely say this is worth a watch.It also shows us the racism/prejudice that was happening to these people at the time and what many people will still have to endure today. It also asks the question. If Jeffery was killing only straight white men would he have gotten away with it for so long? Probably not!"},{"id":"rw8560994","title":"Great performances, missed opportunities","starRating":"7/10","datePosted":"22 September 2022","text":"Peters is amazing not just in his acting but his embodiment of the character. Nash and Learned are also brilliant. Performances are deserving of the rating. The drawback is the sensationalized depiction, not just the focus on the grotesque murders but with dark lighting, butcher shop meat etc that seems more like a horror movie when it's a horrific true story. At ten episodes it's too long to tell this story unless it had more focus on the victims and their story, especially the Laotian family who had two brothers victimized by Dahmer. More development of victims story could have made this more interesting and less disturbing, but more importantly made this about telling the victims story. Sensationalize story telling wasn't necessary and missed an opportunity for original storytelling from the victims perspective and the impact Dahmer had exponentially on so many lives beyond just those he murdered, like Glenda Cleveland. Even the focus of those victimized is on Dahmer's family, white people. Yes they are victims too, but the balance is off."},{"id":"rw8561057","title":"So Slow!","starRating":"5/10","datePosted":"22 September 2022","text":"Sorry everyone, I can see this will be an unpopular opinion but I felt this series was incredibly slow paced.I had to skip through so many slow, overly dragged out scenes. Example, Dahmer would meet someone new, and it would take a good 10-15 minutes to establish the purpose of where the encounter was heading.Bearing in mind, he had many encounters and many victims to get through!Maybe I was hoping for more focus to be on post-arrest. I would've like to see more interrogation.Hearing his reasoning to the cops. But instead the majority was focused more on past events.After all, this is a drama and not a true crime docuseries. So perhaps if you have a similar taste to me, this will feel slow to you too."},{"id":"rw8561215","title":"Evan Peters!!","starRating":"10/10","datePosted":"22 September 2022","text":"Evan Peters is an amazing actor! His versatility and range for the complex characters he plays is nothing short of amazing! No spoilers, but the first episode will have you hooked, I love this guy (Peters) not Dahmer, haha. Jeffrey Dahmer has had many a movies made about him, but this one has so many little detailed scenes and it's not rushed. So, thankful for 10 episodes of brilliant acting and not to mention, Niecy Nash really surprised me with acting shops, I didn't know she had that in her! After you watch the first episode the movie art of Peters eyes will make sense, just brilliant. I rate this a 10!"},{"id":"rw8561267","title":"Masterpiece!!","starRating":"10/10","datePosted":"22 September 2022","text":"I've followed the story of Jeffrey Dahmer and have been interested in his case for some time trying to understand him and what drove him to commit such acts there wasn't really anything that captured Dahmer quite like this the movie my friend Dahmer was good but still a lot of key parts of his story were left out. This amazing take on Dahmer's story is another genius writing masterpiece by Ryan Murphy with an incredible cast this series really shows the ins and outs of what not only lead to the gruesome events by Dahmer but also shows the victims and how it affected their family and lives after their family found out they fell victim to Dahmer. It captures the absolute chaos that was left behind after his heinous acts and how his acts affected not only people in his life but many around him through the years. Evan Peter's plays Dahmer eerily well his awkwardness and how he struggled with social interaction. The show also incapsulates how Dahmer's childhood led him to this point... psychology struggling with separation anxiety and the fear of being alone due to his mom leaving and his dad never really being around due to work but also finding common ground within animals and their anatomy and the biological side of them this was his only form of love and attention he received from his father growing up and it begs to show whether this is why he ended up finding this \"love\" in other forms as well as his need to be held his father mentions at one point that his mother never hugged or held him when he was a baby this would have played a massive part in Jeffrey as a child and through to adulthood. The victims could not leave him if they were deceased and he had full control over his fantasies when he had them drugged. It was an amazing outlook in the end to see the victims for what they were which was human, when looking at documentaries etc we as humans tend to not realise that these victims had families and lives and we become so fascinated by the mind of the killer that we forget who fell victim to him.. this series shows them and their stories as well as their families and the pain Dahmer brought to them all. It also shows the deep issues when it comes to the police with racism and homophobia and this is what led to Dahmer getting away with so many murders. He was never clever with his killings, he wasn't clean and calculated and this really shows that the reason he got away with killing so many young men is because the police refused to listen to the people of colour who were crying out for help not only that but nobody was looking for these boys because they were gay, nobody noticed they were gone in the late 80s / early 90s gay men were outcasted from their families and ran away from home leading to them never really being looked for... it was easy for Dahmer to take them as his victims because of this. The show embodies everything we need to know about Dahmer and this case and how racism and homophobia played such a deep part in why so many people fell victim to him. I'll say it again and again this is a masterpiece and Evan Peter's is an incredible actor and portrayed the sick twisted mind of Dahmer so incredibly well."},{"id":"rw8561302","title":"amazing but also weird and creepy","starRating":"9/10","datePosted":"22 September 2022","text":"Each episode is different as it adds more depth and interest to Dahmer as you learn about what his mind set was and what drove him to do the things he did but also makes u hate and despise of him doing these things to innocent people. Evan peters as Dahmer is a great casting choice as he is able to embody the character as if he was actually Dahmer and not someone trying to play him. The director has a distinct style which suits Dahmer as a character but the darkness and creepiness to the show making you feel more creeped out and disgusted even more than you already do. Another part that is well done is how true and factual the show is to what Dahmer did and acted in real life and how what the police didn't do to arrest Dahmer earlier in his spree rather than later and how we can't do nothing or complain about it as it's already happened."},{"id":"rw8561312","title":"Evan Peters excels in his portrayal!","starRating":"10/10","datePosted":"22 September 2022","text":"An excellent series which provides different prospectives and is an eye opener for viewers. Evan Peters has excelled in his portrayal of Jeffery Dahamar along with excellent performances by the rest of the cast.The intertwined viewpoints of different people in this recount of events allows the audience to get to grips with the effects of events on each of the protagonists. It also asks the question of whether we have learnt anything as a society on how to prevent serial killers or events like this occurring again and whether the killer becomes the focal point rather than the victims - this series really gets to the core of how families of the victims feel in the aftermath."},{"id":"rw8561442","title":"gripping and slow at the same time.","starRating":"8/10","datePosted":"22 September 2022","text":"This series concentrated on the effects of Dahmer's crimes that affected those in his life. It was quite in-depth and insightful. You'll be able to skip some parts as it's slow in places. If you think you've seen the lead actor you may remember Evan peters as quicksilver in X men. Peters gave a good performance which to my knowledge of Dahmer portrayed him quite well. From what I've read on Dahmer this story seems to keep to the story. Will we ever know why he committed these atrocious acts? Probably not. It also shows how a parents love for a child can still survive such a crime. There is also a side to this series that touches on the 'Is it really the fault of the perpetrator' if there is a problem with the wiring of the brain and should that be taken into consideration when treating such offenders. All in all it was good viewing albeit a bit slow in places. There are some graphic scenes both sexual and gore so be warned but probably necessary to the story."},{"id":"rw8561446","title":"Felt like watching a slow movie in slow motion","starRating":"6/10","datePosted":"22 September 2022","text":"This movie fell short of all my expectations despite it being the one I was looking forward to most this year and wanted to give the most leeway to. I love Evan Peters but the way this was filmed could not make it any drier. It had so much potentially to make it truly terrifying which would give a reaction appropriate to the crimes committed. Instead it was soul less, boring, and what really should just have been condensed into a really good movie. Instead it wasted many hours of my time. The dialogue was cliche and vanilla, there was minimal gore. The action scenes were my biggest disappointment. I love horror, but I never got that eerie or shocked fear response. You could check your phone throughout the whole series and not miss a thing. I wanted to love it so much, but it was ultimately a waste of a good story with a good actor. Maybe I'm spoiled with the quality of HBO."},{"id":"rw8561470","title":"watch it, if you want to get traumatized","starRating":"7/10","datePosted":"22 September 2022","text":"Don't watch episode 2. They recreated Dahmer torturing and murdering a 14 year old boy. Showing all the details of how it went down. It's heartbreaking and disturbing. Feels like you are really watching someone getting murdered by a psychopath. The boy actually managed to escape, even though he was drugged and got a screwdriver through his brain, leaving him unable to speak. He is found by the neighbors, but when they call the police, Dahmer convinces them it's his drunk boyfriend and they let him take the boy back into his apartment and leaves. Wtf. And at the end, if you weren't traumatized enough, you hear the real 911 phone call from the neighbor to Dahmer trying to make them come back and help the boy, but in vain. I love true crime series, but this was too much. Not gonna continue watching the series, even though it's well made. Probably worth more than 7/10, but can't give it more than that, cause it's too violent."},{"id":"rw8561475","title":"Recommended","starRating":"7/10","datePosted":"22 September 2022","text":"\"Dahmer - Monster: The Jeffrey Dahmer Story\" is a 10 episodes Netflix mini-series about Jeffrey Dahmer. Dahmer is easily in the top 10 most interesting serial killers. A very complex man and his prison interview was fascinating.This is the third non-documentary movie/series I'm seeing about Jeffrey Dahmer and I think it's fair to say it's the most accurate. Evan Peters is doing a very good job as Dahmer and the production gave a lot of attention to details. I still don't understand why it's jumping back and forth in time instead of just telling his story in chronological order.6/10 Recommended."},{"id":"rw8561491","title":"Show of the year","starRating":"9/10","datePosted":"22 September 2022","text":"Let me start to saying that Even peters did such an amazing performance. This show was the first that make me live into the skin and the mind of a SK it gave me chills in my bones . This show was well crafted and i really wish that netflix will make more seasons about other SK. These kind of individuals are nothing to cheer for they are horrible human beings and the show made that clear they didnt glorify any of it .they also showed us the consequences of his acts and how the surviving victims and their families coud never be the same . So BRAVO to all the people who worked on the show. Amazing."},{"id":"rw8561496","title":"Excellent","starRating":"10/10","datePosted":"22 September 2022","text":"Evan Peters is simply outstanding in this, in fact the whole cast are amazing! This is not slow, it's telling the story from all sides. Don't watch if you're into watching murders!!! This is a character driven series. Mr Peters has immersed himself completely and it's paid off, awards please! This obviously is about Dahmer but for once, victims, their families, the impact , devastation on all of them. A racist, homophobic police force (as today), useless as well as a court system which is and was broken. It is creepy, scary and so sad. It will move you, I was completely in and watched in two evenings! Complete package. More like this please Netflix."},{"id":"rw8561605","title":"A dark, taut and compelling docudrama.","starRating":"9/10","datePosted":"22 September 2022","text":"For those interested in the psychology of a serial killer, there is no more fascinating character study than Jeffrey Dahmer. He was a psychiatric enigma and a profoundly sick individual. A chronic alcoholic from a very young age. A sexual deviant with all manner of unusual fetishes. A necrophiliac. A cannibal.A pure psychopath and the product of a perfect storm of schizotypal/borderline personality disorder, developmental toxicity (exposure to psychoactive drugs in utero), negative parental influence, neglect and childhood trauma, a morbid curiosity with the macabre, social exclusion at school and deep feelings of loneliness, sexual confusion and insecurity.He longed to be cared about and loved by his family. He longed to be accepted by his peers. But, at the same time, knew deep down that he would inevitably disappoint his parents because of his inability to live a normal life and that he wouldn't be accepted by friends due to his odd personality.We all tend to seek out like-minded people and make connections with those we have something in common with. The problem was that Jeffrey knew there wasn't anybody out there with the same interests or outlook as him. Left to his own devices by absent parents and socially isolated, he became increasingly withdrawn and followed a path of introversion and solitude.He must have felt like he didn't belong in this world, and that there wasn't a place for him within society, so he abandoned all attempts to participate and pursued a voyeuristic way of life. He lacked a clear or positive self-image, meaning his perspective of other people was skewed, which resulted in him fully embracing his warped perception of pleasure and satisfaction. The men he felt attracted to were purely sex objects to him; walking, talking sex dolls. His interest was solely in their aesthetic, or physical appearance.He appeared to have been a deeply troubled soul from the outset and his behaviours were predominantly a consequence of his genetic constitution, exacerbated by negative life experiences. If his childhood had been a more positive one then he may have been able to adapt better to his personal limitations and dysfunctions, but there is no way of knowing the extent of the damage his upbringing had on him.It was evident from his own admissions that he felt predestined to live a peculiar and unorthodox lifestyle due to his innately bizarre persona. The conventional joys of life simply didn't float Jeffrey's boat.I rarely, if ever, feel sorry for multiple murderers, especially ones who commit such heinous and sickening crimes as Dahmer. But I have to admit that I found his story to be tragically sad.My usual take away from accounts of serial killers is wondering how and why someone could do that to another human being over and over again!? In Dahmer's case, I am left feeling conflicted with a strange understanding of, and empathy for, his actions. Of course I'm not condoning what he did, but I can see how and why the sequence of events transpired.In his televised interviews he was so open, frank and forthcoming which is exceptionally rare for someone in his situation. He came across as a gentle, thoughtful and articulate person who was genuinely tormented by his inner demons throughout his life. He freely admitted to his crimes in detail, demonstrated that he knew what he had done was evil and offered honest explanations for his actions. He wanted to pay the ultimate price for his sins, resisting advice to make a plea of insanity, and took personal responsibility for the choices he made.The good part of him wanted to change and stop what the bad part had started, but he required external intervention to do so. The urges and compulsions that controlled him became an obsession and his psychosis led him down a progressively irreversible path that was impossible to resist. The dark side had an unrelenting grip on him.My personal opinion is that he was clinically insane, due to a combination of psychiatric disorders, but at the same time I feel a legal judgement of insanity would have been an insult to the families of Dahmer's victims and an inadequate penalty for such a fiendish series of killings.If you listen to him describe how he felt during his childhood and adolescence, it's clear that he should have been under the watchful eye of mental health professionals from an early age. His mother was so wrapped up in her own mental illness and his father preoccupied by work that he didn't receive the emotional support, medication and therapy he desperately needed. This was inexcusable given that both parents were acutely aware of their own emotional problems and the likelihood that these had been passed onto their son.I can't help but feel pity for Dahmer, and also that the casualties of his maniacal way of life were preventable.Between his mid-teens and early twenties he was basically a \"walking cry for help\" but nobody seemed to pay attention, try to understand him or find out what was wrong. In any case, because of the appalling and unspeakable nature of Dahmer's fantasies, it's unlikely that he would have felt able to share them with anyone, even those in a medical capacity. This would've made him feel trapped and that he might as well turn his fantasies into a reality because there was nobody to confide in and no way out of his spiralling mental condition. Like a lost cause.I mean here was a guy who felt completely alone in the world. A total and utter misfit. So reckless and uncaring about what other people thought of him, making absolutely no attempts whatsoever to conform to social norms. A loner without even a rudimentary inclination or understanding of how to make friends, relate to others or find a romantic partner. He didn't seem to know what to look for or what he wanted in a partner. His perverted version of attachment and sexual arousal didn't allow him to.I suppose all he had experienced was watching his parents at constant loggerheads and in a loveless marriage. This would have left him detached, emotionally stunted and unaware of how to express love and affection. I suspect realising that you're homosexual is a troubling and confusing time for anyone. But for someone like Dahmer, who was mentally unhinged and devoid of emotional support, it was a major dilemma and yet another psychological obstacle to contend with.He was given such an unstable start to life by bickering, neglectful parents who appeared to be unwilling to put their children's welfare first. This obviously had a massively detrimental impact on his self-esteem and sense of security, leading to an intense fear of abandonment. Hence his preference for duping his victims into spending time with him and then incapacitating them so he could enjoy their company without that fear of rejection. That way he could exercise total control over their lifeless bodies and indulge in his fetishes to his heart's content without contest.I expect he sank to unimaginable depths of depravity during those private moments, searching for the unachievable, ever-fleeting sense of fulfilment and satisfaction that he desperately wished to hold on to and savour.I've read quite a lot about Dahmer online, watched a number of interviews and the brilliant film 'My Friend Dahmer'. Evan Peters portrays him with a seemingly effortless and convincing performance that is heavily nuanced and intensely creepy. He absolutely nails the flat affect, monotone voice and distinct lack of emotional expression typical of most psychopaths.He really conveys the emptiness Dahmer had in his soul; the numbness, subdued anger and sexual frustration which engulfed him. He truly embodies Dahmer and was perfectly cast in this role.Technically speaking this series is very well researched, skilfully put together and held my undivided attention throughout. The acting by the whole cast, especially Richard Jenkins as Lionel, is first class. The tone is pitched perfectly for such a grim and sordid story. The directors create numerous moments of highly suspenseful and tense drama including some horrifying, darkly-intimate and cringe-inducing scenes, but these are needed to tell the story of Dahmer's debauchery in full.Episode 6 \"Silenced\" in particular is an exceptional and highly original piece of screenwriting with some of the most absorbing television I've seen for a long time. It was like a mini-masterpiece of melodrama.I really feel the writers got inside the mind of Dahmer, not only giving us the facts of what happened but allowing us to feel what it was like to see things the way he did. There are a number of minor adjustments or expansions to the narrative, but equally some omissions in order to make the content more palatable for the viewer. None of this affects the credibility of the series in my opinion as we are given ample opportunity to form a mental image of what happened from the point of view of all parties concerned.Despite having read up on the subject matter beforehand, and knowing how the events of his life unfolded, this excellent series has a real edginess and provides a fresh, unflinching and comprehensive account of the disturbing life of Jeffrey Dahmer.If like me you're fascinated by how a monster like Dahmer is formed, you're in for a real treat."},{"id":"rw8561606","title":"Evan Peters is Chilling","starRating":"9/10","datePosted":"22 September 2022","text":"This show exceeded my expectations. It Stands Tall amongst all other true crime content on Netflix and other streaming services these days. Evan Peters is amazing as always but he really brings it in this series. Showing the Insanity and also the struggle of Dahmer, and will make you both disgusted with him and empathetic at the same time. It's amazing how long He got away with his crimes and I believe he really didn't care if he got caught or not which is especially scary. You gotta feel bad for the families of the victims and also Dahmer's family. The vibe of the show is incredibly dark but hard to stop watching. 9 stars !"},{"id":"rw8561647","title":"Heartbreaking to The Core","starRating":"10/10","datePosted":"22 September 2022","text":"Although a very much a bingeable show that can be watched in 1 day. I had to break it down into two days when the sun was out. It was so disturbing, evil and devastating. Episode 6 really got me. What an evil man he was and the horrible things that happened to these young men. It was infuriating to watch the lack of law enforcement taking Glenda's claims seriously. That poor 14 year old boy, his family. Screaming at the TV for sure!!!Evan Peters played this amazingly. Definitely creeped me out! I hope he has overcome playing this monster. I had nightmares from watching this show. I can't imagine having to play this character for a long period of time. It's such a dark story.Highly recommend!"},{"id":"rw8561714","title":"Speechless!!!!!","starRating":"10/10","datePosted":"22 September 2022","text":"Evan Peters is mesmerising!!!!!! The way he becomes Jeffrey Dahmer is amazing!!!!! I love his acting!!! All you can see is Jeffrey!!!And the way it takes you into the \" rabbits hole \" is breathtaking!!!It's both excited and upsetting at the same time !!!!Food for thinking !!!!!I only wish that they make more of this kind of serial killers series!!!It's \" killing it \"\nOn point!!!!And for the closure......Don't forget that caring for others and what's is \" just \" and \" fair \" is the noble thing one can do .Sometimes it can save lives!!!!I can't wait to see what's next for Evan Peters!!!!"},{"id":"rw8561758","title":"Definitely Award worthy.","starRating":"8/10","datePosted":"22 September 2022","text":"Very Hard to watch. Almost had to look away in the beginning cause it's very tense. Guess the fact the actually lived in Milwaukee (unusual high amount of Serial killer come from this place). ...Hits a nerve. Netflix pretty much outdone themselves this time. Probably win something for this. So far watched 1-4. ...which explains how he was captured, the initial ineptitude of law enforcement, and how he became to like his killing obsession.Evan Peters (plays Jeff) and Richard Jenkins (plays Lionel which is Jeff's dad). ...Supposed a combined of his parents, his Mom taking drugs while pregnant(plus she was weird too), Inability define himself sexually, his obsession with killing early on and no real direction in his life. ...plus his other multiple obsessions include relating intimacy with tons of other things. ...but it was this and Alcohol that did him in. Hate to mention white privilege helped him a bit, but in the end his Obsessions became his weaknesses."},{"id":"rw8561885","title":"Far too long and quite boring","starRating":"6/10","datePosted":"22 September 2022","text":"This story could have been told in half the episodes. Much of the \"side\" plots was irrelevant. It was also far too kind to this serial murderer. Not worth watching. Trying to draw comparisons to another serial killer and some eclipse of the sun is just silly. People want to know about this serial killer - I personally don't believe many of the \"facts\" set forth in the program. I wish I hadn't wasted my time watching 10 episodes where virtually nothing of interest was depicted. I actually watched witness evidence (real witness evidence of the trial) and it was far more compelling than this dreary, boring and lengthy \"documentary\"."},{"id":"rw8561915","title":"One of the best series to watch!","starRating":"10/10","datePosted":"22 September 2022","text":"By default, I love Evan Peters... and his rendition of Jeffrey Dahmer is superb! Niecy Nash should get an Emmy for her role as Glenda Cleveland. The whole series is gut wrenching, it takes you to an uncomfortable place but you can't stop watching.Evan is an amazing actor, I have no idea how he was able to finish the series, in any case, he needs to do some serious counseling.I remember when this was happening, I was 14 at the time, lived in Chicago. So many stories being told and so many people missing. It was horrible to witness the victim's families pain during the trial. And the actress who launched herself to him... it reminded me of watching that even in live tv.May the victims rest in peace... congratulations to Evan Peters on a praise worthy performance.And of course, Ryan Murphy.... thank you for bringing uncomfortable stories to the mainstream.D'Eva Longoria."},{"id":"rw8561928","title":"Don't listen to the ratings","starRating":"4/10","datePosted":"22 September 2022","text":"Boyfriends review - This could have been good but just like with everything now it's trying to send a political message. Whether the message is true or not isn't the point. I watch things like this to learn about what sort of person could do these types of crimes and get enjoyment from it. The first few are good but after a while it stops focusing on Jeffery and starts focusing on nonsense nobody cares about. Do yourselves a favour and don't watch it because you will end up wanting to smash your head against the wall like me.Girlfriends review - Had every opportunity to be a cinematic masterpiece. This is something so many people have waited years for but unfortunately was nothing short of mundane, bland and all in all fairly tame. If you're into gore, or at the bare minimum something with encapsulating substance then don't waste your time on this. Just know going into it unless you're easily impressed or unsettled than you will leave disappointed and that's a guarantee. So, so wanted to enjoy this but it completely fell short of what it had to potential to be.Far too political, the aim should've been to delve into the mind, acts and gratification of a serial killer yet focused far too much on the obvious. We all know killing, torturing and so forth is wrong and the people surrounded by the victims suffer immensely. It didn't need to waste 3/4 of the series showing us this. It should've been scary, disturbing and unsettling and as a common theme with all new things released these days just became about politics & social issues. I won't give this series a second thought, the disappointment is almost immeasurable."},{"id":"rw8561936","title":"Another Murphy Classic","starRating":"10/10","datePosted":"22 September 2022","text":"This was a really tough watch at times but ultimately a really well done depiction of the horrors committed by Jeffrey Dahmer. Knowing the story there was some stuff left out but you get the idea. For me, Niecy Nash delivers a powerhouse performance that I was not expecting from her. Although I am aware of her work I didn't know she had these acting chops! Give her ALL the awards. Evan Peters also gives another great performance as expected. This story really is the stuff of nightmares, especially where Glenda is concerned. True crime lovers will enjoy this but anyone who appreciates fantastic acting will too. 10/10."},{"id":"rw8561963","title":"Fantastic","starRating":"10/10","datePosted":"22 September 2022","text":"When something is made, it's always about Jeffrey Dahmer, his side of view, what he felt and to glorify the ''mystic part'' of the killer and his psyche.Here in this mini-series, I feel for the very first time, the viewers are compelled to live it exactly (or as closed to) as it was from the victims's eyes. Obviously not to the same extent as they felt at that time, but it has the dread and the eerie feeling to it. They didn't take time to show the gory part too much, since it was filmed as if you were the person in the room with him.It has been amazingly done, it's crushing, from the perpetretor's family to the victim's, the unprofesionnalism of the police, the racism still in place at that time, it's enraging, and eye-opener. It's a real cinematographic masterpiece."},{"id":"rw8561964","title":"Holy Moly!","starRating":"7/10","datePosted":"22 September 2022","text":"Holy moly this was intense, creepy, disturbing and terrifying from the start to the finish. Based of course on the true Jeffery Dahmer case of kidnapping, murder and cannibalism.Evan does a very convincing and disturbing job playing Jeffery Dahmer. His looks and demeanor, the way he talks and even moves is just disturbing. Absolutely convincing and all around terrific job playing this role. Absolutely stunning performance.The writing and production are top notch and professional and even the simple music is haunting and matches the story and scenes.The rest of the cast is very competent and talented and play their roles very well. But Niecy Nash steals the spot for best female performance. Brilliant and emotional.All around I would say watch it."},{"id":"rw8561973","title":"Excellent yet CHILLING portrayl from Peters...!!!","starRating":"10/10","datePosted":"22 September 2022","text":"I typically don't write reviews. But i have too say Evan Peters is JEFFREY DAHMER. Everything from his midwest accent, down too his mannerisms, he is a perfect fit for this role.Now being a gay man myself and out too a very supportive family. I must say that their were SO MANY \"red flags\" where Jeff could have received the help he needed too \"come out\" and deal with his obsessions with the macabre. He was crying out for help and know one was listening. Let me be perfectly clear here. I DO NOT condone what he did on ANY LEVEL. As he definitely had deep psychological problems. But i do believe with a different upbringing and more \"understanding\" parents things may have gone differently for him.The true moral of this story folks is too make sure your listening too your kids. And i mean TRULY listening when they come too you and want to talk. Jeff didn't have this and resorted too heavy drinking which only made his psychological problems even worse. If he were able too talk with a psychiatrist and be put on the proper medication. I think his sanity and soul could have been saved. Their is a part of me that feels very sorry for him that he didn't have access too this kind of help.When you examine the first few episodes you see a father encouraging him in behavior that was \"abnormal\". Picking up roadkill and cutting it open only deepened his fascination with the macabre. And in turn worsened his psychological welfare. So in that regard YES i blame the father for getting him interested in such abnormal activities. He also couldn't handle the divorce and that is when he immediately needed counseling. Because he spiraled out of control from that point forward.The bottom line here is people can be \"saved\" if they have the proper channels and outlets. Even if they are incapable of seeing themselves changing for the better. As an outsider one must still try and exhaust all efforts too save that individual from such psychological torment. Jeff had none of those outlets. And it's a shame that his life turned out the way it did. He certainly was born gay but i don't believe he would have done the monstrous things he did. If it wasn't influenced on him at such an early stage from his dad. So i hold him accountable for part of his issues. Upbringing and good parenting skills are vital too ANY child's outcome as they reach adulthood. All in all an EXCELLENT performance of a truly troubled soul that was desperately crying out for help."},{"id":"rw8561985","title":"Well done, dragged, but very little.and gruesome","starRating":"8/10","datePosted":"22 September 2022","text":"Imagine being so lonely that you are compelled to eat someone's flesh in order to feel any semblance of companionship or love....something none of us can even begin to comprehend, and so very, very sick and unforgivable.This series, I think, portrays the madness of Jeffrey Dahmer very well. He said, in real life, he wasn't insane, (and he was above average intelligence). Interesting, and certainly debatable, the insane bit, but possibly true.I thought a couple of episodes dragged a little bit, but I found the back stories of all the people so horribly fractured during his life very sad, tragic, and long-lasting...some, still to this day.After I watched this, I pulled up the official FBI reports of his interviews. Much of what was portrayed was true to life. There were a couple of gruesome surprises in the FBI report. Nothing was ever mentioned about him drinking from donated blood bags, which when I saw that on the series, found it somewhat unbelievable... I don't know if that truly happened.And I knew Silence of the Lambs was heavily based on Dahmer, and this series indeed showed the parallels between his life and that movie, like the head in a jar and the basement, which in true life, was his grandmother's basement.I was surprised to see that it was Molly Ringwald who played the second wife/stepmother. I did not recognize her. And Richard Jenkins playing his father Lionel, was exceptional in portraying the plethora of emotions that poor man went through. I do think they portrayed Dahmer's actual mother more kooky than she really was.... I mean walk a mile in her shoes. Crikey. Though she has since passed away, she garnered high praises for her work with HIV positive people. And I hope his grandmother was as fearless as she was portrayed. That was Michael Learned who is better known playing the mother in The Waltons.Other characters I thought brilliantly portrayed were Reverend Jesse Jackson and Dahmer's next-door neighbor, Glenda Cleveland, who died at a young 56 years of age in the early 2000's, from heart failure/cigarettes. Her wish for the lot where the apartment building once stood to become a memorial park never came about, as even today the lot sits empty and overgrown.I'm not sure how I feel about them showing actual photographs of what they found in his apartment. Imagine being someone even six degrees of separation from those horrible events, viewing this series. Truly the stuff nightmares are made of. And images that can never be erased from the mind.I binge watched this in one day, thought it was well done considering the subject matter, and once was enough.My first comment about \"being so lonely, compelled to consume flesh,\" triggered a weird memory. When I was 11 or 12 years old I was sitting astride a horse in an alleyway inside a barn. There was a pretty little fair-haired girl I had not seen before, and probably six or seven years old, playing with some barn kittens. I guess I said hello to her, because she looked up at me hugging a kitten and said, \"I love these kittens so much I want to eat them.\""},{"id":"rw8562090","title":"Does what a lot of SK series fail to do...","starRating":"10/10","datePosted":"23 September 2022","text":"At a running time of nearly nine hours, many might wonder why it takes this series nearly 7 hours more than most other films or documentaries on the same topic to capture the life and events of Jeffrey Dahmer...The answer is because this series offers a rich panorama of both the psychopath's journey as well as all of the psychological horror he inflicts on all of the lives in the crossfire. His apartment neighbor, his father, his grandmother, his victims, and his victims' families.The tragic series is surprisingly detailed and stays as close to the story as possible. The narrative moves around on several timelines through periods of his life in an unpredictable order. This seems to me to have been done for pacing rather than providing back stories. Though it moves in a more linear timeline in the last few episodes.What this series does better than most is breathe life and humanity into the victims--mostly through the life of Tony, a young deaf, aspiring black model with a big heart from an incredibly loving family. It may bring you to tears when that episode wraps up. It is just devastating.All of the acting is sublime. You feel for nearly every character on screen at times, even the monster himself. Standouts to me are Evan Peters, Niecy Nash and Richard Jenkins, as they had the most screen time, but it was well acted throughout.TL;DR give it a watch, especially if you've seen other Dahmer movies... This one is something special."},{"id":"rw8562227","title":"Unwatchable for all the wrong reasons","starRating":"5/10","datePosted":"23 September 2022","text":"I really wanted to 'enjoy' this, I've watched several documentaries about Dahmer so a series that focused on the victims was absolutely interesting to me as they are so often forgotten and I hoped this show would address WHY he was able to get away with it for so long but despite some excellent acting, beautiful cinematography and well handeled details of the murders - not overtly gruesome or gratuitous - the whole thing was like wading through treacle.I will admit I threw in the towel halfway through the 4th episode.The storyline was shot out of order for no particular reason I could decern which lead me wondering 'which victim is this'?, So much detail was poured in to his relationship with his parents or lack thereof, seriously the 'blame the parents' thing again? Were we meant to feel sorry for him?Disappointing."},{"id":"rw8562244","title":"A match made in... heaven?","starRating":"10/10","datePosted":"23 September 2022","text":"I'm referring to Ryan Murphy and Evan Peters, whose disturbingly sick synergy has been made evident in AHS; it's a perfectly horrific partnership and is just what this dark topic needed.Finally, FINALLY a production team that wasn't afraid to go balls out on an extremely disturbing subject! Peters is, of course, brilliant, as we learned from his insane portrayals throughout the AHS seasons (his wildly erratic characterization in 2017's \"Cult\" epitomizes this). He encompasses the role of Dahmer to the point where that annoying fourth wall comes crashing down and leaves the viewer smack-dab in the midst of the blood-soaked horrors going on in that tiny apartment. Creepy is an understatement.A big thing to remember is the stigma that was prevalent during the early days of the AIDS epidemic when this story is set. Having lived through that time, the cops' reactions are unfortunately not atypical. Rewatch \"Philadelphia Story\" to get a glimpse of most people's mindset. When Tom Hanks's character is rocking his sister's baby (or IRL when Princess Diana touched or held AIDS patients in clinics overseas), it was groundbreaking behavior because (it was believed) nobody in their right mind would be anywhere near an AIDS patient. Hence the cops' hesitation to search Dahmer's apartment and their (by today's standards) insensitive comments about needed to wash off the gay. It was less a racial thing than a homophobic thing.Under Murphy's keen sense of the macabre, everything from the spot-on costume design to the skewed cinematography enhances the twisted storyline.Clearly I can't say enough good things about this series. Definitely not for the feint-of-heart, but there you go."},{"id":"rw8562268","title":"Terrifyingly Brilliant!","starRating":"10/10","datePosted":"23 September 2022","text":"Out of all the serial killer movies and documentaries, I have watched, & that number is quite high, this is the single one, that literally terrifies me, and I think that's primarily, because for once, this focus's on the victims, and in no way is glorifying the killer. This series, is definitely hard to watch at times, and I have had to look away, cringing, but this side of the serial killer story, needed to be done, and Netflix has done a brilliant job at doing it! The series is seriously creepy, chilling, shocking, and all too real, which for me, makes it one of the best representations that has ever been created on this subject! Bravo Netflix, and thank you for sharing the victims side...."},{"id":"rw8562293","title":"Unacceptable","starRating":"1/10","datePosted":"23 September 2022","text":"This show is absolutely disgusting it is only one of two movies in my entire life that have made me ill. I have a great stomach for dark and disturbing films but this is so graphic I almost wanted to vomit and the police are portrayed as a complete idiots who did not stop the situation when they could have under many circumstances. I don't think they should be allowed to air this show because it's not good for anybody and only ignites those that are inclined to enjoy it. I will say that the acting was good and Dahmer's growing up and past we're rough but we've all had rough upbringings and haven't turned out like that. I don't think they should validate his actions by a bad upbringing."},{"id":"rw8562329","title":"Disgusting","starRating":"4/10","datePosted":"23 September 2022","text":"It gave a headache while watching and I dont cringe while watching this kind of genre.The details are too much to handle. Then they try to focus more on the race factor even though the victims were not just black. The woke agenda has been forced into the story line which I think was unnecessary as people do read through the lines.The story should have focused on one character. However, they try to tell many stories which makes this show all over the place. Very slow churn.The show had a good potential which the show makers have squandered.I would not recommend this show for anyone to watch."},{"id":"rw8562471","title":"Excellent/one clarification","starRating":"9/10","datePosted":"23 September 2022","text":"Clarification: The \"American Indian\", Jamie, was 14 years old, not an adult. This was his first minor victim. Every other victim was portrayed correctly.This was absolutely horrifying! I wasn't sure if I could handle it but with the deep dive into his parents that blends in so seamlessly I couldn't stop.Evan has Dahmer nailed. This is probably the best portrayal of a serial killer I've seen.Absolutely a must see but there was a lot I couldn't watch. Those scenes were short and I am a lightweight on blood and gore so keep that in mind.I find myself very frustrated with a lot of people who could have stopped him a lot sooner.This was brilliantly done with an excellent cast!"},{"id":"rw8562490","title":"Magical!","starRating":"10/10","datePosted":"23 September 2022","text":"I can't believe how amazing this limited series is! It's like, 'someone else out there really gets me'!After binge watching the first five episodes, I learned that I had to watch the rest of the series in just 2 or 3 shows blocks at a time, because as we've all learned from those certain pharmaceutical commercials - seek medical care for erections lasting more than 4 hours! I should have known better. Emergency Room visits ain't cheap, my friends.The intensity of Evan Peters is mind blowing. I can almost feel his breath in my ear, and his fingers caressing my chest. And the blood! Oh my gosh, I can smell the metallic odor and taste it from how well the cinematography pulls me in!"},{"id":"rw8562495","title":"Subpar writing and inaccuraricies.","starRating":"1/10","datePosted":"23 September 2022","text":"I can't take this seriously with all the bad writing and inaccuraricies. Would it kill Ryan Murphy to actually do some thorough research and stick to the source material. It's waaaay more compelling. Also, Evan Peters' one note monotone robotic performance is not realistic (combined with his brown eyes and dark hair). Watch the Dahmer family home movies. He came across as an unassuming nice regular Joe schmo. Maybe it's the writing and direction's fault but there are tons of interviews and trial footage to create from so why make up completely inaccurate scenes that discredit the victims true experience? It does a major disservice to the poor victims. I don't like that, especially considering the situation involving the 14 year old boy (character assassination) ALSO.: (The moment with the cops is almost accurate, but should have been handled differently). The Niecy Nash character didn't even live in the same building as him! Get out of here with this fictional mess.Yes, there are a tiny few solid moments and some of the production designs are spot on, but the inaccuraricies outweigh the few small good moments combined with a lot of boring filler and too many flashbacks. All in typical tasteless Ryan Murphy fashion (couldn't even think of an original title). Skip and stick to an accurate thorough documentary if you're that interested.I can't rate this higher than a one, unfortunately due to handling of production and the big missing part, humanity."},{"id":"rw8562513","title":"Just binge watched this and...","starRating":"9/10","datePosted":"23 September 2022","text":"I thought it was a movie when I first put it on and was upset when I found out it was a series but decided to let it play anyways and I am glad I did. As I watched the show, I did research on Dahmer to see how closely the story stuck to the true events that actually took place and the writers did a great job incorporating all of not most of what happened without embellishing too much if at all. The acting was superb from Dahmer's appearance to all of the extra cast members. The only flaw I found in the presentation was how the story jumped around and did not go in chronological order but I understood everything well enough as I had done my research on the time line of events. I don't support serial killers or murderers but the show I entertaining nonetheless and definitely worth a watch. Only 9 stars because there is no replay value."},{"id":"rw8562588","title":"Brilliant","starRating":"10/10","datePosted":"23 September 2022","text":"I have watched almost every serial killer doc, tv series, and movie imaginable. With that said, I have never seen one capture the darkest crevices of the serial killers mind like Dahmer does. Unlike other shows, you also get to know the victims on a personal level. This has to be the best portrayal of a serial killer ever captured on film. Its brilliantly written and its terrifying. It has every element you would want in a series like this and some. It does not shy away from details no matter how brutal it may be. I hope this director decides to capture other serial killers. All I have to say is BRAVO!"},{"id":"rw8562776","title":"Niecy Nash","starRating":"8/10","datePosted":"23 September 2022","text":"For true crime fans, I believe that we all have an opinion about who is the worst of all serial killers. This is an terrifying scope into the life of Jeffery Dahmer, possibly most terrifying of them all. The cast is brilliant to say the least. Evan Peters has shown himself to be in the same class as hard-working actors like Alexander Skarsgârd and Michael Shannon. However, the unsung hero of the cast is without a doubt, Niecy Nash. Her desperate cries for help for Dahmer's victims makes the story gut wrenching. Her role in Monster will give you chills thinking about how you felt when you watched.\"When They See Us\"."},{"id":"rw8562821","title":"Ryan Murphy truly is an extraordinary talent. Everything he brings to the screen is a stunner.","starRating":"10/10","datePosted":"23 September 2022","text":"As one has come to expect, this Ryan Murphy production continues to grow his amazing stable of cinema treats.It takes a brilliant writer to explore the character of 'a monster' that, whilst a horrifying psychopath, was also human. A human beyond redemption. Its aim isn't perhaps to show sympathy or even empathy for the nightmare that was Jeffrey Dahmer, but more to include his history, not as an explanation of that, but as allowing the audience to look in horror and wonder how and why this happened. There is more than one monster here. The Police involved made some major mis-steps that could easily have prevented many murders at the hands of this damaged, psychotic individual. The blood of at least one victim lays clearly on their hands.The pace suits the material perfectly and the viewer may well be surprised at where in the Dahmer story this series begins. At first I thought , 'No, they're not!', but they did. And it's a brave choice by the two writers.All the production values here are top notch, particularly the acting but the scriptwriting is where all the value comes from. It's a corker, taking a story and making it more than simply engaging...it's riveting."},{"id":"rw8562823","title":"Speechless","starRating":"9/10","datePosted":"23 September 2022","text":"Just finished the series and wow.Usually I find TV series with similar attributes take a long time to get to the point. Not this series. Not at all!Completely taken back and shocked, first episode in!Actually had to have a few breaks between episodes.Evan Peters did an outstanding job at portraying Jeffrey Dahmer. It felt like I was watching everything unfold in real time right in front of me.I wish the final episode had more acknowledgement on the victims. There was only the last 10 seconds with small pictures. I would have loved maybe a slide each, maybe some details like if they had hobbies and siblings etc.Must be hard for victims families to relive this. But I hope they know that their loved ones names and stories are reaching a whole new generation."},{"id":"rw8562883","title":"Not bad despite Evan Peters' performance.","starRating":"7/10","datePosted":"23 September 2022","text":"I enjoyed this show, however I'm just not sold on the robotic and monotonous performance by Evan Peters. Statements from the neighbors and acquaintances of Jeffrey Dahmer describe him as someone who appears normal. Evan Peters in his role as Jeffrey Dahmer on the other hand, comes across as a complete creep from the very first sentence. The slow deliverance of his lines without showing any kind of emotion is just not how a normal person would speak, and I highly doubt someone would be able to convince so many people to come over to his place by speaking in that manner.However, the different viewpoints from victims and neighbors keep the show interesting in my opinion, albeit a little slow at times. Overall not bad, not great, but merely okay."},{"id":"rw8562919","title":"Niecy Nash Deserves ALL AWARDS","starRating":"10/10","datePosted":"23 September 2022","text":"Niecy Nash did an amazing job! She deserves every award possible for her performance in this limited series. She did Glenda Cleveland proud by getting her story out there and letting people know how she Ms. Cleveland stood up.Evan sure can play a psycho.If you think you know the story you do not unless you wrote a thesis on the serial killer's victims or it. This is very informative and you are going to learn a lot.I wish they had put even more light on his victims so everyone knows their names:\nSteven Mark Hicks\nSteven Walter Tuomi\nJames Edward Doxtator\nRichard Guerrero\nAnthony Lee Sears\nRaymond Lamont Smith\nEdward Warren Smith\nErnest Marquez Miller\nDavid Courtney Thomas\nCurtis Durrell Straughter\nErrol Lindsey\nTony Anthony Hughes\nKonerak Sinthasomphone\nMatt Cleveland Turner\nJeremiah Benjamin Weinberger\nOliver Joseph Lacy\nJoseph Arthur BradehoftHis survivor's names! All his victim's family members and friends and community members."},{"id":"rw8562958","title":"A grim but watchable and well made docu drama","starRating":"8/10","datePosted":"23 September 2022","text":"This is very good. First episode was incredible, very well paced and acted and the production values are very high.Subsequent episodes are less compelling and act more as history lesson in how this odd ball was able to morph into the cannibal he became and how he evaded capture. There are some awkward 2022 racial politics inserted, as we should expect unfortunately.His childhood and early adulthood are well documented and other films have been made about his school days such as My Friend Dahmer, and this show references that period in his life to good effect.I'm over half way through so I wanted to add a review to encourage others to give it a go, it's grim, especially early on, but it's very well made and worth your time.Edit: now finished the show and the 2nd half is actually much better and gives the victims much more air time. Those who have criticised the show should have watched it through before doing so!"},{"id":"rw8562964","title":"A true horror masterpiece","starRating":"9/10","datePosted":"23 September 2022","text":"Ryan Murphy brings the story of Dahmer alive from every angle.From probable causes for his behaviour and the institutional racism and homophobia that allowed him to get away with the murders as long as he did.Also it does not glamorise Dahmer as some have done with similar stories of serial killers.This is a thorough look into both the man and the heinous acts he committed.If you love true crime this is for you.Evan Peters does a frighteningly good job as Dahmer. Plus the proven creative relationship between Murphy and Peters only strengthens after this master class of story telling.This is a must see and I would be shocked if it didn't gain a few accolades along the way."},{"id":"rw8563032","title":"Heart-rending","starRating":"9/10","datePosted":"23 September 2022","text":"I followed the case in the 90s and was utterly shocked by the incompetence and biggotry of the police at the time.I saw all biopics and documentaries available so I was definitely looking out for this one.From the moment Lionel (Richard Jenkins) gets informed about his son's crimes, you are trapped inside a series that will leave you completely drained and exhausted when finished.Evan Peters captures successfully the depraved mind of Dahmer. He genuinely scared me.The visualization of the darkness of the case is perfectly set and the songs used are here so disturbing because I used to have an amazing time dancing to them. Absolute must see!"},{"id":"rw8563104","title":"Amazing","starRating":"10/10","datePosted":"23 September 2022","text":"This show makes you hate and love and loath and feel sorry for one of the most brutal serial killers ever. Evan Peters is fantastic, makes you wanna hug him and and punch him and run away from him at the same time.And all the other actors are great too, especially Richard Jenkins playing Dahmer's dad.Besides this monster's drama the show focuses on social problems as well, especially on the fact that the police could not care less that young men of color were tortured or killed. Dahmer got away with his terrible actions several times just because he was white and articulate. Yet, the show is not trying to pray, it just shows everyting in a matter of fact way.The atmosphere is so strong at some points it felt like I was watching Seven. Great show!"},{"id":"rw8563167","title":"Outstanding series","starRating":"8/10","datePosted":"23 September 2022","text":"Firstly, don't believe all the hype about this being a gore fest: It's anything but.The producers and director have done a remarkable job of balancing drama, tension, and storytelling to create a series that explores the human cost and exposes the societal deficiencies surrounding the case of Jeffery Dahmer.Evan Peter's ( American Horror Story ) turns in an award winning performance as the grisly cannibaliser-however the series dives into Jeff's upbringing and perhaps some of the major events of his life that played a pivotal role in moulding him.It doesn't push any particular narrative in this respect-and what it does do very refreshingly is expose the incompetence of the police who could have stopped Dahmer had they heeded the warnings of those around him.I'm reminded of perhaps ( if possible) the worst case of Nathaniel Bar Jonah who's victims were young children in his case and similarly the system failed to properly appreciate the malevolence brooding within these serial killers.This also pays proper respect to the victims ( both dead and alive) without dousing the viewer in force fed sentimentality or virtue signalling.All in all a gripping series that is hard not to become engrossed in, with some important social commentary and excellent performances all round.Now all we can hope for is Netflix's algorithm to sit up and take notice that this is how a quality series is done."},{"id":"rw8563216","title":"Truly masterful","starRating":"10/10","datePosted":"23 September 2022","text":"This is so much more than a true crime series. As a writer, I was almost jealous at times of the choices the writers made. They artfully wove in themes of forgiveness, family, homophobia, racism, and the very nature of good and evil. Instead of focusing on how awful Jeffrey Dahmer was, and the tabloid bs that his actions entails, they chose to include genuine storylines about his victims, their families, and most of all-his neighbor Glenda. She was my favorite.Through Glenda, we experience the sense of knowing something is wrong, but no one listening. After Dahmer is caught, we go through the journey of trauma and healing with her. What a wonderful choice!We also see things though Jeffrey Dahmer's father's eyes. I think this is a particularly bold choice, because oftentimes, the relationship with killer's mothers are examined ad infinitum. For once, we see the anguish through the eyes of a father, and his attempts to reach his son throughout his life.And then, of course, we see the victims and the families. The episode with Tony Hughes, the deaf man, deserves a dang Emmy. It was the best thing I've seen in a while.And of course, Evan Peters as an actor was truly next level. I've seen dozens of Jeffrey Dahmer interviews, and Evan's first scene literally took my breath away. I couldn't believe how much he nailed the speech of Jeffrey Dahmer. It was exactly like how the real Dahmer talked!There were times, especially in the early episodes, where I was literally nauseous. This series doesn't shy away from the crimes, but it doesn't glamorize them either, in my opinion. It gets into the tough questions of nature and nurture, and forgiveness. What a truly incredible piece of art. Bravo to everyone who worked on this."},{"id":"rw8563252","title":"The accuracy.","starRating":"10/10","datePosted":"23 September 2022","text":"The accuracy shown in this show is beyond incredible.I had low expectations like many others, but this has gone beyond everything I've imagined. As someone who was immensely interested in Dahmer's case for years, I am amazed at even the smallest details shown.This is thanks to someone called Victor, who worked on this series to correct anything and everything. I have followed along with Victor's interest with this case and I can see just how much this potentially improved each episode. Thank you for your work, I will miss your content greatly.Besides the accuracy, this has been far better than any other \"biopic\" or loosely based film of Dahmer's case. The performance shown from every single actor was phenomenal. I loved how it didn't try to romanticize Dahmer in any way, and showed how horrible of a man he was. (unlike other media) It also focused greatly on the victims, which is not only important to the majority but also show empathy towards their families and loved ones, which horrifically, people tend to forget or ignore.10/10."},{"id":"rw8563375","title":"Evan Peters is brilliant","starRating":"10/10","datePosted":"23 September 2022","text":"Played the role professionally than Jeremy Renner in Dahmer(2002). As a troubled criminal mentality, which makes the series more intense in every episode. The flashbacks of the old events from time to time is an excellent idea so that we can see what Jeffrey was like and what changed his thinking pattern to this stage. Most of the stories mentioned about the victims were also interesting. I do not want to forget the role of the great actor Richard Jenkins and his role in the series and his attempts to reach the mind of his son. Excellent series I recommend to the documentaries crime fans hope you gonna love it guys."},{"id":"rw8563400","title":"What a brilliant creation!","starRating":"10/10","datePosted":"23 September 2022","text":"Oh I am speechless. This is the best Dahmer filming creation ever!!! I highly recommend it.Every single scene is gorgeously done. From music and outfits to bloody scenes and cars. Pure perfection . It also covers other perspectives and peoples views on the whole situation. I also love how we learn the aftermath, parents background, locations, victims lives..\nYou really get it this time. It's not like watching YouTube documentary where you learn nothing new. This is an eye opener and horrifically realistic. And the actors omg actors are incredible. Leading man deserves an oscar! And producers and directors deserve one too!!Watch it!!"},{"id":"rw8563470","title":"Excellent","starRating":"8/10","datePosted":"23 September 2022","text":"Loved it. Evan Peters is awesome and the depth of the story is fantastic. Really loved how they managed to portray the darkness without it just being merely a gore-fest. My main gripe is the majorly annoying Glenda and her terrible, terrible voice. Also wish they had focussed more on the intricacies of the murders rather than the back stories of the families. A lot of time was wasted on hypotheticals but all in all a good show, well worth the watch.I'll be honest, I felt that there was an element of sadness running through this story, mostly in relation to Jeff. Obviously someone who needed support from such an early age."},{"id":"rw8563533","title":"Well made series, just dragged a little too long","starRating":"8/10","datePosted":"23 September 2022","text":"This felt like a combination between American Horror Story and American Crime Story. It was mostly done very well and managed to keep you interested through majority of it.Evan Peters is an amazing actor as always and he managed to carry this very well. I always felt like he (the actor) deserves more recogniation than he gets, and I'm glad he is starting to get more of it now. Nothing but good words to him.While watching, I felt like the show did a good work showing you the victims side of it and giving them the respect that they deserve. Unlike most shows that maybe end up glorifying the killers by putting all of the focus on them, this one really attempts not to (though it doesn't always succeed because Evan himself is naturally likeable). They really try to make you feel for the victims and their families and how wrong they were treated, not just by the killer himself but also by everyone around them. It clearly criticizes the racism and the dismissive attitude by the authorities, both before and after the killer was caught. It also made sure to show you what happens after the killer was caught, how the story of trauma doesn't end there and people can't just move on with their life. And that's the part of reality that is often ignored in the media - the story doesn't just end when the person goes to prison. It's never that easy.However, after watching it I read that the families of the victims were never updated about this and that it triggered trauma to some of them. Legally the creators of this series did not have to ask for permission or anything, but as the series showed strong critisism towards the people who tried to make profit from the story after it happened without taking the families into consideration, it did feel very weird to learn that this series was made by people who pretty much did the same thing. Even though the series itself is very well made and probably the best non-documentary adaptation of the story, this fact about the families does leave you with some bad aftertaste in retrospect.Back to the series itself, the only downside of this series in my opinion is that even though it was interesting through most of it, at some point near the end it did feel like it just got EXTREMELY slow, and even became a little boring, kinda like a lot of the content and dialogs were dragged longer on purpose just so they can have 10 episodes. It was a shame to be so engaged in it through most of the series only to get sort of bored of it near the end, kinda underwhelming. I think it would have been much better if they squished things together a little more and kept it to 6-8 episodes total.For the accuracy level, to my understanding from a quick research the important parts about the crimes were mostly accurate, while fictional changes were usually related to the stories of the neighbors or the police (unclear to what level, but at the very least some parts of those were not accurate)."},{"id":"rw8563613","title":"Over all 10/10","starRating":"10/10","datePosted":"23 September 2022","text":"In short, I wanted to research the victims, the families and the outcome of the serial killer and not the serial killer itself.Acting was superb. The writing was impeccable. The injustice is felt without it being shoved down your throat. The police incompetence is infuriating but so cleverly integrated into the show. It's a feature but it fades out, just like reality.My thoughts towards serial killer was a confusion of sympathy and then anger, by the end I'd forgotten he existed and felt only interest in his father, step mother, neighbour and victims.This programme shows the endless talent in people of colour there is, and the irony was not lost on the programme.What a superb show. One of the best."},{"id":"rw8563767","title":"I dont know what to say","starRating":"9/10","datePosted":"23 September 2022","text":"I am an Englishman and was born after his crimes. I have a fascination with this sort of thing, yet the killer is normally romanticized or you feel some form of sympathy for him.This show just shows the deterioration of a person. That word is probably wrong, as his father was willing to admit he was an odd child, and did weird things, and a fathers prerogative was to protect his child. This show shows the descent (and odd lucid groundhog moments). Basically this show shows the reality as we know it today (from dahmer and others testimony).It doesn't sugar coat or downplay it, just shows the true morbid nature of Dahmer.(Typing this during the silent deaf scene (paused, I'm not that rude!) And just thought that even though I'm not a big \"whodunnit\" fan, or normal murder type shows, this was so good, and true)Enjoy x."},{"id":"rw8563768","title":"A tour de force","starRating":"9/10","datePosted":"23 September 2022","text":"Evan Peters is an absolute tour de force in this: he captured that utter blankness to perfection. Actually, the casting all round is excellent and I doff my cap to the acting skills of all those involved.It's not an easy watch by any means; there is a huge sadness in respect of the institutional racism that allowed Dahmer to continue killing for so long.This series also brought to attention the absolute destruction that Dahmer wrought on his victim's families; there is often far too much emphasis on the experience of the perpetrator. This series absolutely tackled the terrible pain left behind. My only (tiny) criticism would be a lack of focus on Dahmer's later attempts to convince the world that he was 'I'll'. He wasn't in the legal sense, he knew exactly what he was doing.Overall, cannot praise it highly enough."},{"id":"rw8563794","title":"Excellent depiction, strangely sad, while also horrifying","starRating":"8/10","datePosted":"23 September 2022","text":"Okay, so, this doesn't pull any punches, with respects to certain grisly details, but at the same time lands each blow with considerable care. We do see quite a good deal of the rather more grim elements of the story, the behaviour, but it's been so sensitively crafted that it's impossible not to feel some amount of sadness for Dahmer on elements of his journey in between killings. The loneliness is so expertly depicted. There's one episode that gives us more of a victim POV, I won't say which, that was so beautifully done that, while also exhibiting some additional degree of horror in relation to what happened in the end, that was so beautifully constructed that rather more than horror, I felt an unexpected and considerable sense of grief, even though I knew what was coming.Anyway, it's almost perfect. Doesn't quite land perfectly at the end, goes on a little long, could have been stripped down to maybe 8 episodes, the ending appearing to drag on a little. Nothing major, it's still all very well done otherwise.Evan Peters is fantastic, as Jeffrey Dahmer, and his horribly conflicted and disturbed Dad, Lionel, is played beautifully by Richard Jenkins. Everyone in it is marvellous actually."},{"id":"rw8563924","title":"Evan Peters is terrifying","starRating":"9/10","datePosted":"23 September 2022","text":"I'm not going to lie, I didn't know anything about the Dahmer story before watching this but wow is this quite terrifying to watch and realise this is all true.Evan Peters gives an Emmy winning performance as the psychotic serial killer that is truly disturbing and terrifying and after reading up about Dahmer after watching the show, he really does capture the look and characteristics of him.The supporting cast truly do a great job (Dahmer's parents especially) as well in bringing this whole murderous event to life.I would recommend for people who are fans of shows based on true events and who just love Evan Peters work."},{"id":"rw8563997","title":"Outstanding","starRating":"10/10","datePosted":"23 September 2022","text":"Well....... If you think Evan Peters can be messed up in American horror universe wait till you get through this. He truly is at his disturbing finest in the portrayal of Jeffery Dahmer. This is probably the best telling of any serial killer ever made, a real eye opener into the mind of the epitome of the deranged and psychotic. I would recommend holding off wiki or googling Dahmer before finishing this, enjoy the series and be prepared to say WTH a lot during this. There are also some great acting from some great actors and actresses ie Jenkins, Miller, Ringwald etc. Expect awards for this series."},{"id":"rw8564008","title":"Brilliant!!!","starRating":"10/10","datePosted":"23 September 2022","text":"Awesome series!Brilliant actor (Evan Peters).I already knew the story, but was completely dumbfound about the police officers negligent behavior.The series brought a completely different light upon the tragedy surrounding Dahmer. It makes us aware that police forces really neglected non-white people.It makes you think. At the beginning you might want to strangle Dhamer. At the end you might want to strangle people arround him.I wonder if the threatening calls to a victims' father were really made by... whom the series indicated.At the end, you lean back and wonder: Who's the real monster in this?"},{"id":"rw8564023","title":"He really pulls off dahmer to a T","starRating":"9/10","datePosted":"23 September 2022","text":"The ted bundy movie was one of my favourite serial killer movies (the original 2002 one not the corny zack efron one) i thought that captured the weird demented mind of a serial killer great but this is pretty much on par but without any snippets of dark humour, this is just dark and morbid, i always knew Peters could pull something like this off though, great actor well done to him. Master of his craft, it must be hard putting yourself in the shoes of such a sick weird human being. Even his mannerisms are spot on and the voice is pretty close to, no disrespect to renner he did a good job but this version is better for me."},{"id":"rw8564064","title":"Brilliantly Done","starRating":"9/10","datePosted":"23 September 2022","text":"I was 10 years old when Dahmer was caught, so I knew about it, just not the details obviously.This series was EXCELLENT. The acting was superb by the entire cast. I hope they win awards. The accent was a bit over done, however, it's hard to get our accent right here in this neck of the woods without going overboard. It is creepy, it is gross-but they make you imagine the gore with sounds. It will make your stomach upset, and will make you feel quite disturbed by the end of the series. I gave this a 9 star review because of the acting, the level of creepiness, and the unanswered questions I still have about the aftermath. I'm actually thinking of reading his(Dahmer's)father's book for more insight. I'm positive the writer used some information from there."},{"id":"rw8564088","title":"Inefficient at Best","starRating":"5/10","datePosted":"23 September 2022","text":"This show would be a lot better if it was maybe 5 episodes as opposed to 10. Even the series itself seems to be bored with itself by episode 6 or 7. Ultimately I regret starting the series but it had a lot of potential.It's also one of those shows where's it's difficult to tell what's based on reality and what isn't. If you're making something for entertainment make it entertaining. If it's supposed to be a historical account a google search shouldn't reveal immediate fabrications to the story.Great performance by the lead and dad role though. The dad especially does some really nuanced work that's worth seeing."},{"id":"rw8564226","title":"Evan Peter's was fabtastic","starRating":"6/10","datePosted":"24 September 2022","text":"Evan Peter's really made this, the way he portrays Dahmar was just spot on, better than Efrons bundy imo, but other than that and the anticipation of what he will do next and how it does shine more light on the victims which often gets overlooked with our facination with serial killers but the rest was lacking. Extremly repetitive, long and drawn out storytelling and once again over saturation of woke idealism. Can be a great thing when called for but coming from the likes of Ryan Murphy I just expected a great horror mocumentary about Dahmer and his victims. What could've been became more politicized to serve a specific agenda it seemed, its not a requirement for everything entertainment anymore but yet again were flooded and forced on us. What starts as a great horror drama just fell short by over political controversial takes and the over misuse of the length of the 10 hour long episodes. Casting and characters over all where perfect to which half way saves the series."},{"id":"rw8564294","title":"Unwatchablely SLOW","starRating":"1/10","datePosted":"24 September 2022","text":"Holy hell this show is slow. We made it about half way through the second episode after suffering through the first. The end of the first episode gives you hope things are picking up but then it drags back to a snail's pace.The acting seems good but whoever edited this shouldn't be allowed to edit anything ever again. The pacing is so off it just drags on and on.This seems to be common with Netflix. Take an hour or two of content and stretch it out into several hours of episodes.The Dahmer story has better adoptions. I'd recommend pretty much any or all of them over this agonizingly slow POS."},{"id":"rw8564332","title":"Terrifyingly AMAZING!","starRating":"10/10","datePosted":"24 September 2022","text":"I'm honestly not big into true crime anymore. A lot of it has always been interesting for me though but this show takes the CAKE. Episode 1 was terrifying cause you know the story already and what's going to happen. You're on the edge of your seat the entire time. I've watched so mant documentaries and shows on Jeffrey Dahmer but I believe that this really does bring justice to the victims and their families. It even dives into Jeffery's family and how it impacted them. I recommend this show to whoever is interested in True Crime or just needing something to watch. So interesting! This show a WATCH!"},{"id":"rw8564423","title":"7.5 / 10 - Very impressive....","starRating":"7/10","datePosted":"24 September 2022","text":"So better than a '7', but not quite an '8'.....I've read a couple of books about JD, and seen all the interviews on YouTube, and I can assure you that factually this drama has it mostly spot on. Obviously due to the subject nature, it's dark and horrific, but if you can deal with that (or like myself - enjoy it!) - you are in for one helluva ride. It's slow, for sure, but I'm totally OK with that.And the Emmy Award goes to.... Evan Peters for his portrayal of the man himself. Stunning piece of acting. He really does create the character of Dahmer - to the point that I actually almost felt sorry for the guy. He really does make him human, as opposed to just a cardboard cutout of a monster. And that is not easy to do. Also Niecy Nash must get a mention playing JDs long suffering neighbour. And of course, Richard Jenkins never disappoints - I remember first seeing him back in the 80s in The Witches of Eastwick with Jack Nicholson, and he was great in that.So definitely not everyone's cup of tea - certainly not something that I would recommend to my mother, but if you like your drama dark, and have any interest at all in Jeffrey Dahmer, then trust me, you'll love this."},{"id":"rw8564606","title":"Surprisingly Insightful!","starRating":"10/10","datePosted":"24 September 2022","text":"Before I begin, I want to make it clear that I do not enjoy horror nor the true crime genre - I pressed play on episode 1 as I remembered a Dahmer being mentioned in Lost eons ago buried in the boggy silt of my memory and wondered about the connection lol..I was RIVETED to my seat. When the first episode finished, my heart was thrashing and I was boggling at how there could possibly be more to the story and was ready to be bored with lengthy court scenes. Wrong!This was so well written. I wasn't there, obviously, so I cannot speak to the truth of what went through each person's mind and of their experiences - but this felt real and rings true. We see Dahmer: the man and the monster; his victims; his family; his neighbours; the police; and, dear lord, how very few steps forward we've taken since the 90'sI've read that the victims' families have not been involved in this production. I hope that's not true! I dearly hope that Netflix is sharing the profits with them, or will build the Memorial Garden.(Message to Netflix: you're being demonised in the media.. show everyone your money's where your heart is!With love,\nK x)"},{"id":"rw8564624","title":"amazing performance given by Evan Peters","starRating":"9/10","datePosted":"24 September 2022","text":"I enjoy how the show doesn't just focus on the horrific crimes performed by Jeffrey Dahmer, but also how they were carried out, such as the police officers who ignored the risk because he was a white male and didn't think to conduct a background check that may have saved many lives. The entire series, in my opinion, effectively portrays Jeffrey Dahmer's severe emotional problems and the need he felt to kill people. I believe it was a clever addition to include some background information to what, if not the precise cause, may have precipitated this reaction. I like how it demonstrates how the horrible deeds done had an impact on the relatives of the victims. I also find it interesting how his parents, and in particular his father, react to learning the truth; they still loved him despite knowing what he did. I adore Evan Peters's portrayal and how he was able to perfectly impersonate Jeffrey Dahmer, in my opinion. As a huge fan of horror myself, the series is one of my new favourites and I would highly suggest it to anyone who enjoys true crime or horror."},{"id":"rw8564636","title":"disgusting!!!!","starRating":"1/10","datePosted":"24 September 2022","text":"After watching one and a half episodes even with fast forwarding parts. I failed to see why this show was ever even produced. His sociopathic had no bounds there was no specific method to his madness his spectrum of sociopathic-Ness was broad. Only he could ever explain why he did what he did. And even that wouldn't make sense to anyone. I felt that it was pointless to try to understand him even in this show! The only thing I got was power and everyone around him was a specimen. It was sick deranged demented and a unfounded subject to show the world. I feel films like this cause more damage. He gives people with similar thoughts and tendencies to think of him as a kinder spirit when they have none they are robotic and Deranged and sick. I almost threw up five times I see no point in the show. Other than trying to understand somebody that wasn't even humane and projecting this garbage into this world! Which helps no one."},{"id":"rw8564678","title":"NIECY NASH & EVAN PETERS! I can smell the Emmys!","starRating":"9/10","datePosted":"24 September 2022","text":"Niecy gives a stunning portrayal of a woman who suffered by hearing and watching the vindictive things Jeffery did. No one wanted to listen to her and Nash captures the essence of a woman who could have stopped more murders from occurring. Evan Peters dives deep into the role of a sadistic spineless killer. Peter's performance shines throughout every scene. Although the series is well thought out, these events did occurred and how the Milwaukee Police failed to save so many lives. The lives of innocent black and brown men, the victims and their families still need to be respected. Remember them."},{"id":"rw8564700","title":"THE TIMELINE !!","starRating":"6/10","datePosted":"24 September 2022","text":"The first episode is the episode where Jeff get arrested finally. So by that time after watching the rest of the episodes we know that his father know multi things wrong with Jeff specially after been arrested twice so his father know for sure his son is trouble maker. And we also know that Jeff's neighbor Glenda had it with Jeff noise and smells to the extent she gave up and start crying every time she heard the fight noise and the utility noise (in the 7th episode). And in the 7th episode the landlord gave Jeff the evacuate notice and he confront Glenda about it.With all that said WHY WHY in the first episode the first scene Jeff working in his apartment and Glenda hearing the voice and she was calm like it's nothing terrible happening (as we saw her in the 7th episode) and she even called Jeff about the smell (like it's something new happening) and Jeff respond with an excuse (like he is not evacuated already). Glenda even said I saw you throwing rotton meats WHAT!Another thing Jeff father as I said he used to his son as trouble maker and when he went to the station he act like it's something new happening not that his is weird already.TO: every scriptwriter if you willing to take the risk of starting the tvserice from the end. You better know your timeline because what happend with this show was mayhem.Beside everything above:The actor Evan Peters is weird already so good castingThe father Richard Jenkins deserves an Emmy for sure."},{"id":"rw8564709","title":"Pure fantasy","starRating":"1/10","datePosted":"24 September 2022","text":"First of all, I have to give credit where credit is due. Richard Jenkins delivered a fantastic performance (as usual) playing Dahmer's father. I like most of Jenkins' movies but here he shines as the guilt stricken father of the infamous serial killer. Without Jenkins however, this series would be unwatchable. Evan Peters also delivers a great performance as Dahmer. Now that that's out of the way, I'll get into the problems with the series which is the writing and the extreme and dishonest levels of \"artistic liberty\" the writer, director, and producers take on telling the story. In a nutshell, they took a true story and used it to push a very \"special\" narrative. We've seen this before, the police are a bunch of, well you know what they are. It's gotten so bad I don't even need to say it. And I don't wish to be hunted down by Biden's DoJ for posting a review. Also, the character who plays Glenda is almost more unlikable than Dahmer himself. She is his neighbor and for some reason half of the series is about her. My very first impression of her was positive but that quickly changes as she does nothing but scream and yell and complain about everything under the Sun. As for the \"artistic liberty\", if you watch this series, and I advise you not waste your time, just try to think outside of what your being fed. Anyone with a critical thinking mind will see this piece of pure trash for what it is; propaganda."},{"id":"rw8564717","title":"Evan Peters is incredible","starRating":"10/10","datePosted":"24 September 2022","text":"I've always liked Evan Peters. This mini series made me love him. He is absolutely the best actor to portray a killer since Zodiac. I honestly don't know if that's a good or a bad thing. Nonetheless, he was phenomenal. Every actor in this is outstanding as well. I can't think of a single bad performance. I hate binge watching shows most of the time. I usually can't watch more than 1 or 2 episodes every other night or so. I finished this in a day.Do yourself a huge favor (if you enjoy a good serial killer movie or series) watch this immediately.I wouldn't be surprised if this was showered in awards and Evan Peters is hailed as one of the best actors of the decade. I may sound like I'm over exaggerating. But, to me, this was one of the best performances I've seen in years."},{"id":"rw8564850","title":"Started off captivating and then turned into another anti white promotion","starRating":"2/10","datePosted":"24 September 2022","text":"Why are almost all tv/movies becoming political messages or painting white. People as the devil? This kind of message only creates division and will do no good for society! It's time as the human race we work together instead of the terrible nonsense going on today.Why are almost all tv/movies becoming political messages or painting white. People as the devil? This kind of message only creates division and will do no good for society! It's time as the human race we work together instead of the terrible nonsense going on today.Why are almost all tv/movies becoming political messages or painting white. People as the devil? This kind of message only creates division and will do no good for society! It's time as the human race we work together instead of the terrible nonsense going on today."},{"id":"rw8564975","title":"Extraordinarily good for a Ryan Murphy show","starRating":"10/10","datePosted":"24 September 2022","text":"Lightning gets caught in a bottle here, Evan Peters channels Dahmer in a way that Renner nor Ross Lynch could dream of. Gotta echo two reviewers above saying that it's got the vibe of Mindhunter, and that Peters deserves serious recognitionThe supporting cast is phenomenal as well, with Niecy Nash absolutely stealing the show sometimes with her character who desperately wants to help up against clearly slanted and insurmountable odds in an everchanging society with certain constants.. such as unresponsive or, even worse, hostile, police.Richard Jenkins is fantastic as always.Its extremely disturbing that the cops handed a 14 year old boy who Dahmer had \"zombified\" right back to him to successfully murder. That same dude went on to be promoted in his district.Unbelievable.Great show. Episode 6 needs awards."},{"id":"rw8565076","title":"Father that raised a sicko tries to hide his guilt","starRating":"1/10","datePosted":"24 September 2022","text":"Another 'true crime' that, rather than being centred around the bravery of the victims, has the sole agenda of showing these sicko losers, the Dahmer family, as 'anti heros'If we suspend our disbelief to the level of this being just fiction, it's 'watchable', but the undercurrent of 'painting' the father as the 'good all round American dad' was far from subtle;It is as if the father had to 'sign off' those Jeffrey & Dad scenes\nGlossy scenes, bad acting. Sorry we are not that stupid.Dahmer, to turn into what he was, was clearly the victim of some SERIOUS abuse at home growing up.This series stinks of 'film makers got rights from the Dahmer' family'.There is ZERO character development about any of the victims ... think about that ...The relentless need for the father to show the world he is 'a good guy' would make a more interesting film than this."},{"id":"rw8565159","title":"This is how it's done!","starRating":"10/10","datePosted":"24 September 2022","text":"I'm not a fan of gory but I am a fan of good story telling. I remember when they captured dahmer, it was all over the news and i remember even more when they killed him. It was all over the front page in huge letters and it was a relief. This mini series is a spectacular piece of storytelling. It brings us into his evil world without glorifying him or making excuses. His father was always apologetic in a way that he wanted the recognition. Who could blame him really? Trying to take credit for the monster he nurtured. The mini series presents the people around him, from his family to his victims, to the people who suspected there was something wrong but didn't know exactly what, to the incompetent police (guess that never changes). At no point is dahmer made to be the anti hero or the one we should be rooting for. He was a very real monster who committed very real crimes and destroyed very real lives. I hope to think Ryan Murphy wanted to portray that in his writing.We all know how this ends but I was right there with the inmate who brought his justice. I felt like I understood his mind set and although I had tears in my eyes, none of them were for dahmer. I also knew what had happened to all his things but watching the actor who portrayed this benefactor and the disgust he displayed for those around him who were fascinated by dahmer, I was right there with him as well. Feeling disgust for all those people who viewed him as some sort of idol. Even now there are still fools who idolize him and it's disgusting.I cannot end without mentioning Niecy Nash's portrayal of the conflicted neighbor who didn't know how else to point to the monster next door. And his grandmother, who saved at least 1 life by not walking away. This story was brilliant indeed without feeling dirty afterwards by rooting for the evil who wasn't fiction."},{"id":"rw8565175","title":"True to actual events","starRating":"10/10","datePosted":"24 September 2022","text":"This ten-episode series tells the story of Jeffrey Dahmer. A horrible and shocking story that will probably not only leave you disgusted by the nature of the crimes, but also by a complete lack of professionalism by the local police at the time.While the story unfolds I did some research on Dahmer and found this series to stay very true to actual events. It's very wel made in every aspect of cinematographic art. Camerawork, acting, scenario and dialogues are above and beyond average. The story sticks.The quality of this series is not only in depicting Dahmers life and crimes in a truthful way. It places all of the events in the context of that time, which adds to the uncomfortable truth that Dahmer could go on for so long. We see racism within the police force, the beginning and advance of AIDS, a strong religious culture with all of its taboos and 'things not spoken about'. We're also confronted with a sich phenomenon that still exists today: people in full an sick admiration of Dahmer, asking for his autograph and sending him money. Companies that build on the gruesome deeds by publishing comic books on the story. A police force with a culture that makes change hard, if not impossible.The series not only shows the story of a very sick man, but also of a (partially) sick society. It's not for the faint of heart, but definitely a series I'd recommend for all of the above reasons."},{"id":"rw8565185","title":"Absolutely incredible journey through the life of a madman","starRating":"10/10","datePosted":"24 September 2022","text":"I was young when the Dahmer Murders happened but I knew what this was based on but after watching this You really find out what kind of monster this man really was Also just how tragic the police police system was in the way those people were treated I went into this around one o'clock at night and I was only gonna watch 1 episode and I ended up watching the whole 10 hour series I could not stop watching it it is 1 of the most Telling stories of one of the world's most notorious serial killers And now I find myself wanting to learn even more and watch even more series like this because it was so interesting."},{"id":"rw8565242","title":"Slooooow sepia-toned nonsense","starRating":"3/10","datePosted":"24 September 2022","text":"Acting great, screenplay horrible, direction unimaginative and boring. With everything that happened can't understand how they made this so dull. Was excited to see Evan Peters in another Ryan Murphy production, but this pandered to a simple audience. If you care about the victims, victims' families or their POV at all then do we REALLY have to see/be force-fed Dahmer's backstory? This could have been half the episodes because there's so much filler and even entire duplicate scenes in non-linear timelines. There are more clever cinematic ways for an audience to side with or 'get' a villain and attempting compassion for him ain't it. Don't bother!"},{"id":"rw8565265","title":"Netflix","starRating":"7/10","datePosted":"24 September 2022","text":"It's the best Netlix has done since the 2017's release of season 4 of black Mirror. That's not saying much, considering the mediocre quality of Netflix's content.It took Spielberg 3 hours to tell the story of the Holocaust. Netflix pulls out 8 hours to tell the story of this demented cannibal serial killer. The priorities are all messed up. What's up with Netflix telling two-hour stories in 8 hours? And what's with this fascination that Netflix has with serial killers? It seems like it's all they can manage to come up with, docu-dramas of serial killers. Can't they manage to come up with an original story for once? And what about telling us a story that lifts us up, excites us and inspires us, all at the same time.I'm rambling, but I don't think Dahmer deserved a movie as well-made as this, and this show symbolizes the artistic and moral bankrupcy of these streaming sites.It's incredibly well-made though. It really is the best that Netflix has done since the first seasons 4 seasons of Black Mirror. Better than the highly acclaimed, but overbloated and tedious The Irishman and Roma.The acting is some of the best i've seen in a long time. The lead actor, Peters, just ticks off all the boxes. Even if you're aware with Dahmer, his charecterization is quite amazing. He does the Dahmer impersonation, but he manages to create a very real person at the same time. The minor actors are all quite good. Really good acting.The writing, directing and cinematography are fantastic. It's done very stylish, but composed at the same time. It didn't surprise me to find that the first episode was directed by Carl Franklin, one of the best black directors ever to work in Hollywood, known for his 1992 minor masterpiece One False Move. The series was written by Ryan Murphy, the guy who created Glee.It's exploitative, and doesn't have an original bone in it's body, but it's suprisingly tasteful considering the material and the involvement of Netflix."},{"id":"rw8565274","title":"What went wrong","starRating":"7/10","datePosted":"24 September 2022","text":"The first half of this show was very intriguing I really enjoyed it,it was skin crawling creepy and had me looking away from the tv in some parts as it portrayed dahmer for the sick twisted individual he was,evans did a good job playing dahmer and his father in the series also played a great part with great acting but then the second half of the story turns into typical Netflix political agendas,racism and police corruption is the topic of the final 4 episodes of this series which really spoils the show and I struggled to finish it off.why must shows have to tread this line is beyond me there was no interactions with the families of the white men damher killed and the show just made it out that everyone white was racist even the serial killer 🙄 Netflix should of just made season 3 of mindhunter I'm honest a great show they killed off just when it had us all on the edge of our seats."},{"id":"rw8565324","title":"Surprisingly well-made, insightful, and thoughtful docu-drama on America's most notorious serial killer of my lifetime.","starRating":"10/10","datePosted":"24 September 2022","text":"I believe Netflix did an excellent job with this mini-series, and I've watched many about other American serial killers over the years. I've actually purposely avoided watching documentaries about Dahmer, exactly because what I remembered about his particular crimes seemed more \"humanly unimaginable\" than those of most other notorious serial killers. But Netflix, IMO, is becoming a pretty good maker of mini-series like this, from the ones I've seen and then researched the truth of--so, I decided to give it a shot.SPOILERS AHEAD\n..\n..\nFirst, they started with his last crime and capture, which was the first that we, the public, heard about him. The rest of the movie was spent offering explanations for how and why he did what he did. Most people watching likely already knew about the cannibalism and that he preyed on a particular type of person. So, nothing was \"given away\" much in the way they began the series.But, then the rest of the episodes began to unfold the stories of other key people in his life, including the neighbor who tried to get the police's attention, repeatedly, and what she was experiencing emotionally because of that. And, little, by little, the series unfolds things about Dahmer's life that make us wonder if it was nature, nurture, opportunistic circumstances, pure evil, or a combination of all of them, that formed Dahmer into the killer he became.After finishing the series last night, I felt the most frightening thing of all is what we see the dad going through--what, if anything, could the dad have done differently, as a parent, so that Dahmer would have become a different person? And thinking about how any of us would react if we'd been in his shoes, once he found out about Dahmer's crimes, during the trial, and then once his son was dead.Personally, I've thought that a lot, over the years of watching these documentaries and seeing news about crimes as they happened. HOW could the families of the Amish kids killed in that schoolhouse years ago, be forgiving toward the mom of their children's killer? That too seems humanly impossible, but they were, as the nation watched. How DOES a parent feel, when their child does something so, so horrendous? What kind of guilt does that parent carry? I pray none of us reading this ever find out....Anyway, IMO, Netflix did a great job of letting us see Dahmer himself as the totally unfathomable monster he was, but it also did a great job of showing us what some of the victims, the parents of the victims, the parents of Dahmer, and the neighbor who kept telling the police, over and over, that something was wrong, felt and experienced, especially in the aftermath.From what I've read on IMDB so far, the series seems to have been pretty factual about most of the details, and I didn't see it as coming from any kind of particular \"angle\" because it, IMO, portrayed the victims and their families & friends, the witness and her family, and Dahmer's family in similar ways--letting us see and feel the HURT all these people went through.It also was not nearly as gory or descriptive as it could have been, and which many other actual documentaries (not dramatized mini-series) usually are. So, I came away with far LESS visuals in my head than I feared I would--and that is a very good thing. I believe they kept the visuals and details down to a minimum, again IMO, compared to what they COULD have shown and described, and I'm very thankful for that.They also intentionally determined NOT to show the situation from Dahmer's own point of view (according to IMDB), because they did not want the audience to have sympathy for him. And, they left some of the issues regarding his spiritual situation \"open\" during the last episode. I had no clue that Dahmer got baptized in prison, before he was killed. I checked online, and this was true--it happened in May, 1994 and an article (or more) was written about it at the time. There was a LOT of Christianity displayed, and actually in a fairly good light, in this documentary--again, surprising given the bent of stuff these days.I saw a review on IMDB where the writer calls this series \"part Civil Rights movie\" and I actually disagree. I had no clue that Jesse Jackson got involved early on, when the story broke, so when he appeared on the scene I was set for the series to take some sort of angle about that, not to mention the LGBT angle it could have taken. But, it did neither, IMO--it pretty much simply showed us what happened and who was preyed upon, and Jeff's sexual orientation, but I didn't detect any big \"statement\" about any of that, that didn't seem appropriate for the time and situation.So, what I'm trying to say is, this was absolutely one of the worst serial killer cases we know of, in American history, but I have to give Netflix a lot of credit for, IMO, presenting & adapting the story as a bio-drama in a way that showed wise restraint, regarding WHAT they could have shown, HOW they could have visually presented it, and HOW they treated some pretty currently-hot topics, in a way that was respectful of the time in which this story takes place. Dahmer himself wasn't used to drive our emotions, his killings certainly drove our emotions, but so did the way the victims, their families, the witness and her family, and even Dahmer's own family, were portrayed.And it gave me, for one, a lot to ponder after watching the last episode, that I never imagined I would be pondering, regarding this particular serial killer situation. It made me walk away with empathy, not just sympathy, for every major character, except for Dahmer himself, and the 2 cops who did not, IMO, get the \"reward\" they deserved...."},{"id":"rw8565562","title":"Disturbing to say the least. Peters is worth an Emmy","starRating":"10/10","datePosted":"24 September 2022","text":"Definitely worth a watch. Not much because of Evan Peters INCREDIBLE performance (worth an Emmy!!!!), but because of the work that has been done regarding the point of view. There's a remarkable difference between this one and the other Murphy's show \"American Crime Story: The Assassination of Gianni Versace\". Despite both protagonists being serial killers, in Versace the point of view is Cunanan's, and at times the character even seems ridiculous, or pathetic. There is no feeling on behalf of the viewer here, in Dahmer, but real, utter disgust. How Peters says \"I'm not insane\", sums it all up."},{"id":"rw8565578","title":"A bit all over the place","starRating":"5/10","datePosted":"24 September 2022","text":"So far I've seen four episodes, overall I think it's too slow. There's already been so many works done on the Dahmer story. Capping this at four one-hour long episodes could have been accomplished.The series is full of peaks and valleys, mostly the latter. I can't say it's a binge worthy series- usually I'm not eager to flip to the next episode right away (like I was with Netflix's \"You\" or Apple TV's \"Severance\"). I think the camera work is astonishing and Evan Peters and Richard Jenkins do a good portrayal of Jeff and Lionel Dahmer respectively. It's definitely a grotesque and unpleasant series to watch, but it's tolerable in terms of Netflix content. I particularly like the scenes of Jeff speaking with the cops (while Jeff is pulled over and when they visit his apartment) and psychologist. This all helps us enter the deranged character's psyche.The fervent interest in Dahmer's mental state, fetishes, and killings makes sense, but the creators are putting in too many extraneous details. We don't really need to see the Dahmer's before Jeff was born, Joyce Dahmer's work life or addiction, or Jeff's extended interactions with a mannequin or his erotic magazines. Those are just a few examples, but the constant oscillation of the time period can also get confusing. This simply wasn't streamlined and it's hard to tell what the focus is.So I can recommend giving it a chance just for the shock factor. While it's not consistent in terms of excitement, there's some brilliant acting and dialogue."},{"id":"rw8565719","title":"WELL MADE, COMPLETE STORY","starRating":"9/10","datePosted":"24 September 2022","text":"Although brutally graphic, this is probably the most accurate and comprehensive tv series/ movie ever produced about Jeffrey Dahmer. Outstanding performances from all the actors but particularly Niecy Nash as the passionate Glenda Cleveland who delivered an amazing performance as Dahmer's neighbour. An horrific story of this man's abhorent crimes that will leave you numb, especially watching all episodes in one sitting. The set decorators and costume designers did a great job of accurately representing the time periods the series is set in. Certainly not for children to watch or the faint hearted."},{"id":"rw8565785","title":"Great","starRating":"10/10","datePosted":"24 September 2022","text":"I didn't know Evan Peters was in this and as soon as I saw his face, I was like okay, this is already a great show. He was so AMAZING in American Horror Story. He really is a star. Oscar worthy actor. He'll make it there someday. There's just something innocent with his face, but then in his eyes and voice you can really see how he just dominates a character. I will watch anything this guy is in because he is amazing. Like Johnny Depp or Tom Cruise amazing. I hope to see him on the Oscar stage. But for now, I hope he gets an Emmy for this. He just truly embodies every role he is in. I am obsessed with crime documentaries so after watching so many about Dahmer, he really portrays him the way he is. A monster, but a damaged child inside."},{"id":"rw8565819","title":"Honest and gripping","starRating":"10/10","datePosted":"24 September 2022","text":"The producers of this show have done a great job in honestly representing Jeffrey Dahmer as something more than just a mindless murderer. What we get to see is a deeply disturbed young man failed by everyone around him at a every step throughout his life.Dahmer himself was a victim of those who failed to acknowledge and act on his strange behaviour and then ignore him when he asked for help. When his father finally did something pro-active to help his alcoholism, he was already a murderer and it was too late.I like everything about this show. As with Mindhunter, the production quality is excellent, as is the direction and acting by all involved. Evan Peters is incredible. He somehow manages to look convincingly both 17 and 31 at various points in the timeline.Having read much about Dahmer, I thought the depiction of him as a lost boy who just wanted his victims to stay, was quite moving and left me pitying one of the most notorious serial killers of all time, who perpetrated just about every conceivable act of deviancy imaginary.Unlike other killers such as Ted Bundy, Dahmer didn't set out to deceive, conquer and dominate his victims, as he very clearly felt empathy for them as he didn't want them to suffer, so in this regard I don't think he can be considered a true psychotpath. More himself a victim of a terrible mother and an ignorant father.This show is brilliant. It's horrific, moving, uncomfortable to watch, and fantastically acted."},{"id":"rw8565860","title":"Another woke Netflix show","starRating":"1/10","datePosted":"24 September 2022","text":"So the show throughout the first six episodes was brilliant, and dare I say captivating, the acting was fantastic, characters were developed in a great way and you can most definitely tell Dhamer was deeply studied in order to deliver this epic performance. Now the the cons... However great this show was, it took a spiraling downfall when Netflix, against all their woke liberalism they claimed to have left behind, decided to go woke and make the ending about a racial issue...forgetting of course a lot of the victims were white...and here I thought Netflix was telling the truth...will be canceling today..."},{"id":"rw8565879","title":"Extremely Well Done. Disturbingly Effective.","starRating":"10/10","datePosted":"24 September 2022","text":"Not only was this the best serial killer series I have ever seen, but it is the best series in general that I have seen in awhile. Every aesthetical and technical aspect of this film deserves a standing ovation, from the cinematography, acting, editing, and storytelling.To all of the negative reviews due to it being \"gross and disturbing,\" that's kind of the point. This is a non-fiction piece based off of one of America's most deadly serial killers. It would not be nearly as effective if they left out the disturbing details and made it PG.That said, don't watch it if you can't handle it. It will make your stomach turn inside out, but you won't be able to turn it off."},{"id":"rw8565896","title":"Not really good","starRating":"3/10","datePosted":"24 September 2022","text":"This series tries very hard to be good, yet fails. If Dahmer was really like depicted here, he would never get anyone to go home with him. He was a pretty, blond, white man. Very manipulative and charming, who knew very well which part is he suppose to act.In series, he is shown as a creep. I mean, it takes just few minutes of first interview one can find on Google to see how to take that role. It seems like our main actor can only \"act\" one role forever. It spoiled the show completely for me.My condolences to the victims and their families, I hope they found their peace. It's hard enough to be involved in tragedy of murder, but probably thousand times worse in such high profile cases that keep digging into the wounds forever.Only show on Netflix that captures the essence of psychopathic serial killer is The Serpent."},{"id":"rw8565901","title":"I was surprised and impressed","starRating":"9/10","datePosted":"24 September 2022","text":"There are at least 3 reasons why I really liked this series: 1. It is not graphic or gory as I expected it to be (nothing like the Hannibal Lector movies) 2. The cast is brilliant. Jenkins delivered a poignant portrait of the father, Ringwald did ok as his wife, and the actress who played the neighbor is fantastic. But nothing compares to Evans' brilliant work as Dahmer. It was very easy to forget it was an actor and not the real Dahmer I was seeing on my TV 3. Unlike other serial killer films/series, this one doesn't end with the trial. There is a lot shown after the trial and I think some of the best parts of the story are in it."},{"id":"rw8565912","title":"Tense, Horrific, and Eye Opening","starRating":"9/10","datePosted":"24 September 2022","text":"I love shows about serial killers and I also love Evan Peters as an actor which made this show a must try for me. This mini series is largely a horror show, with more focus on Jeffrey Dahmer in the act than the aftermath of what he has done. It has a historical aspect to it as well, but those are not super present until the last three episodes or so.The acting is phenomenal - especially from Dahmer's dad, the pacing is great but occasionally slow, and the actual meat of the show (no pun intended) is solid almost every time. If you need something to scratch your Mindhunter itch, this is your show."},{"id":"rw8565971","title":"Murphy does is again!","starRating":"10/10","datePosted":"24 September 2022","text":"Nobody in their right mind would start watching this thinking this was just going to be a Docuseries and that's it....not when it come to Dahmer and the heartbreaking stories of all the people that he impacted with the choices he took. It was not only hard to stomach but extremely consuming. If you're here to just see what he did then ok...you'll\nGet that...but we finally see the victims in the spotlight. Who they were and their families and how they were impacted by all of this. It is sad, it is dark and it was spectacular to say the least. Superb performance by Niecy Nash, Evan Peters, Richard Jenkin and Rodney Burford (to say the least)."},{"id":"rw8566150","title":"Bad Seed","starRating":"","datePosted":"24 September 2022","text":"For the most part, I'll leave it to others to speculate, analyze, and dissect (no pun intended) what caused Jeffrey Dahmer to do what he did. Although his fractured home life certainly didn't help his already warped mind, I believe he was simply a bad seed. He wasn't a \"demon\" as the religious crazies have typically and absurdly claimed nor was it the fault of his distant and neglectful father or all the medications his mother took when she was pregnant with him. Monsters like Dahmer are born, and I don't think all the therapy and treatment in the world would have changed or helped him. Plenty of people are reared in dysfunctional households -- some much worse than Dahmer's -- but they don't grow up to become serial killers who eat their victims. Perhaps it was a combination of things in his life that created a monster, but I will always believe he was born bad. Although a good, long, hard spanking usually benefits most bad boys -- my husband insists that my spankings help to make him a better person -- nothing would have helped Dahmer except maybe a lobotomy.Evan Peters (some here have written \"Peter Evans\") gives an engrossing and memorable performance as Dahmer in which he perfectly captures Dahmer's demeanor and personality. He definitely deserves an Emmy as does Richard Jenkins."},{"id":"rw8566177","title":"They got it right","starRating":"10/10","datePosted":"24 September 2022","text":"They could have got any skinny white actor to play a crazed, deprived version of Jeffrey Dahmer, and it would have been a good story but they did something very special here. They focused on the mid-western \"Milwaukee\" accent and muffled persona. This was the first thing that stuck out to me, as Jeffrey wasn't a man of too many words, but when he did speak it was clear, he was a product of his surroundings. They got the right actor with the perfect range for this role. It's more than just the horrors that one man inflicted, it's about everyone in his orbit. The families, friends, neighbors and businesses that he left cratering in his wake. He lived like he was invisible but the ripples from his life are being felt far and wide. This is a phenomenal series, everyone put their heart and soul into it and every scene is heartfelt and powerful. It's a must-see."},{"id":"rw8566204","title":"Good show with some bad takes on things","starRating":"7/10","datePosted":"24 September 2022","text":"The show is detailed and shares a lot of relevant facts from the case. The show has an anti police narrative that exaggerates the knowledge everyone had of Dahmers crimes with the police doing nothing about it. The police certainly messed up bringing the child back to Dahmer but the neighbor (and others) in real life were not as self aware of what was going on as they were in the show. She did not know Dahmer was killing people and the show makes it seem like she told the police of that multiple times and they did nothing about it. I did not like how the show continuously pressed on that. Glenda Cleveland didn't even live next door to Dahmer in real life, she was way too relevant in the show. And so were the police who shouldn't have been. Outside of that, I enjoyed the show."},{"id":"rw8566210","title":"For once... Netflix Excels","starRating":"10/10","datePosted":"24 September 2022","text":"Wow. Top notch acting. A rare look into the \"humanization\" of a monster, antagonized by his very detailed actions. Yes it's gruesome and creepy and shocking yet not gory. The kill/dismemberment/sexual scenes were very well filmed and directed to ignite the horror without turning into a halloween sharade.So much psychology in this. So much parallelism that shows what it meant to deal with the police in WI at the time if you were white vs if you were black. Every actor in this series deserves an award.Leaves a mark, makes you think. Something neftlix has failed to do so far with its horrible fill-time latest series. I hope everything they produce from now on is at this standard !"},{"id":"rw8566340","title":"Peters, Jenkins and Nash's acting is extremely accurate!","starRating":"10/10","datePosted":"24 September 2022","text":"This series is insanely accurate! I loved that the filmmakers told the story of Dahmer mostly through his victims and through their families, their own life stories. Ryan Murphy and the team really portrayed how systematic racism and sexism enabled Dahmer and only made it easier for him to be a white male serial killer in the most segregated city in America. I loved the episode \"Silenced\" because it shows black, disabled, queer joy. It showed the stupidity of police and racial bias. It showed the experience of Nash's character, Dahmer's next door neighbor, who contacted authorities countless times."},{"id":"rw8566380","title":"Netflix can't help themselves","starRating":"3/10","datePosted":"24 September 2022","text":"Started off pretty good, then in Neflix fashion they decided to bend it to fit current sociopolitical issues around racism. Dalmer killed all different races including white men. In his interviews (check on youtube) he even states race was not a factor he was just picking up whoever he could. Netflix continuing to try and stir up the anti white sentiment. Multiple times in the show they try to bring up race issues. It does also get pretty slow inc too much filler and jumps about way too much.The acting is quite good, although maybe a bit monotone. I don't believe he was as introverted and solitary as the show makes out."},{"id":"rw8566414","title":"Good but slow","starRating":"7/10","datePosted":"24 September 2022","text":"It was a good series.. it was also very slow. I watched some of the real dahmer interviews and he wasn't that slow.. speech nor mentally. I also thought they left out a lot of gory details, especially considering this was done by Murphy who has held a lot less back for his AHS episodes. Some of those AHS episodes I was thinking how in the world is this on tv. This series shows not much really other than \"sounds and smells\" thru a vent. I don't know, guess I just expected real horror and gore and it was a bunch of talking. I do like that it showed kind of how he became the way he was. That must've been their goal and the only goal."},{"id":"rw8566521","title":"My expectations were too high","starRating":"8/10","datePosted":"25 September 2022","text":"I find the first two episodes very slow moving and I almost didn't make it past them. But luckily it gets better as there is more room for the other characters in the story later on.I don't particularly enjoy just replaying the scenes of Dahmer on the hunt despite the brilliant performance from Peters. To me the side characters and their point of view in the story is much more interesting. And second part of the mini series delivers exactly that.Adding more scenes with the engagement with the police on uncovering the crimes would add some other angle. Too bad that the police force is portrayed only as bunch of pricks and the detectives were sidelined in the later episodes."},{"id":"rw8566529","title":"Another Propaganda Piece Ruins True Crime Story","starRating":"3/10","datePosted":"25 September 2022","text":"Dahmer- one of the most hated, prolific of serial killers in history. Preys on young gay -usually minority- men. Red flags his family don't want to see. Its an amazing story, and the acting is great. Until around episode 5. Now the propaganda begins. The injected fictional side stories to focus on the Big R. Yep now I see where this is going and Heck No I am not wasting another second on this garbage. So tired of it. Every darn show, no matter what its about, always ends up here.So if you want to see revisionist fictional history of Dahmer where every road leads to Racism, look no further. I'm out.Since when do reviews need to be at least 600 characters? Is this being graded?"},{"id":"rw8566712","title":"Extremely slow","starRating":"3/10","datePosted":"25 September 2022","text":"Note: This review is written after watching the first three episodes. It's possible that the rest of the series could improve dramatically but it's doubtful.Dahmer-Monster: The Jeffrey Dahmer Story. Even the title of the show is too long. How can they make ten one hour shows about this man? I read a biography of Dahmer several years ago and while the main points of this show are true, there's an awful lot of padding in there too. The show is slow, boring and lacks focus. It jumps around between time periods, one scene is Dahmer as a young boy, the next as a man, then back to being a young boy again. It's not good story telling. I only started watching after I saw the trailer with Richard Jenkins but after three episodes I don't think I'll stick with it."},{"id":"rw8566749","title":"Some of you just don't get it...","starRating":"10/10","datePosted":"25 September 2022","text":"First, this was an incredible docudrama. Evan Peters is phenomenal. The rest of the cast is.. wow. Seeing the side of the victims was a new view of what we normally see in true crime. I think Tony Hughes broke my heart the most. Some of you say, \"the woke and the liberal make it this and that\". He literally got away with it for so long because he was a intelligent, white male. There are recordings of police laughing joking about gay men and racism. Those two factors let this disgusting monster brutalize men for over 10 years. If you don't get that, you are no better. Take a look at yourself. SMH."},{"id":"rw8566798","title":"You will not be bored","starRating":"8/10","datePosted":"25 September 2022","text":"As far as I've seen, this is the most detailed and honest of any Dahmer movie/series to-date. Great acting, too. Nash shines like one of the most brilliant of actors, and Peters is deserving as well. I hope Nash receives the recognition that she she damn well deserves for her portrayal of Dahmers' neighbor, who withstood an immense amount of ptsd causing distress, due to the ever neglectful eye of the police -especially in the late eighties and further. Wins and wins for both of these incredibly talented actors. Both are often overlooked, especially Nash. Give Nash an award for this! Please give Mash the award she deserves for her portrayal of Ms Cleveland!!"},{"id":"rw8566876","title":"Well presented but one glaring credibility gap.","starRating":"3/10","datePosted":"25 September 2022","text":"Last night we decided to give the new Netflix series Dahmer a chance.Rather reluctantly at first; the subject matter is not exactly \"nice\" viewing. If it were going to be a bloodbath, it would have been a no-go.But it is instead a dark, brooding psychological study. Well scripted, directed, and acted; it is a superior crime drama, all told.Evan Peters in the title role is crazy good. He completely captures the strangeness and unease of Dahmer.However. Peters is not believable in looks as someone who had the power to lure men to his place. His face is hard and rather homely. You see in the early 80s mug shots the real Dahmer who had borderline blond porn-star looks, a kind of facial prettiness that could plausibly be a \"bait\" snare.It is a crucial point - believability.Still, the series is enormously compelling, and the back story really provides much."},{"id":"rw8566942","title":"Look dad! There's roadkill!","starRating":"6/10","datePosted":"25 September 2022","text":"I didn't want going to watch it at first. After all it is a disgusting and disturbing story, to say the least.I can say it was mostly done with a modicum of decency. The gore and violence was kept to a minimum.It was a decenct show until episode 7. Then it became an excuse for people not involved to claim victimhood. The best segment was the background of the sweet young promising deaf man. I really was hoping this would be more like the Versace segment of ACS and focus on the victims.The police are damned if they do and damned if they don't, aren't they? If they'd have stuck their nose in too far they'd have been accused of harassing people based on race or sexual orientation. They are easy to blame instead of those committing carnage. I think most people in that particular building minded their own troubles and didn't want the law around. The police were told to lay off the gay community. Also, some say Gacywas racist because he only killed white guys.The acting was good. It was overlong though. It takes a stab at trying to make sense of how Dahmer became a monster. I don't think anyone will ever know. It did show Dahmer as a soulless automaton. Seems pretty accurate. I think this is why he couldn't hold anyone's attention and the reason he had no feeling for other humans. Some reviewers don't believe his personality could have attracted all those men. It didn't. It was the fact he was blonde. A status symbol. A trophy hookup.At least they didn't show scenes of vulnerable people suffering and begging for their lives."},{"id":"rw8566951","title":"Two stars, one for each episode I could bare to watch","starRating":"2/10","datePosted":"25 September 2022","text":"Good acting, but the snail's pace is unnecessary and inexcusable. I was bored stiff in the middle of the second episode. A non fiction movie/show/book should give you some informational takeaways but after an hour and a half I only learned that an opossum is the only marsupial in North America. I turned it off and decided to refresh my memory of the events with a quick read on Wikipedia and then I moved on to something more entertaining. BTW I thought the John Wayne Gacy mini series was great, and could have been a guide to make this more educational and interesting. Don't waste ten hours on this one."},{"id":"rw8566960","title":"Definitely a Ryan Murphy take","starRating":"5/10","datePosted":"25 September 2022","text":"Heavy-handed, obvious, and bordering on theatrical. Complete with cops affecting Fargo accents and a wooden Dhamer performance that comes across like a Joe Pera impersonation, this is a truly strange and uneven series from the mind behind Glee and Eat Pray Love. Certainly research was done, but to what extent it is hard to say, as \"Dahmer - Monster: The Jeffrey Dahmer Story, A Story About Jeffery Dahmer and All Those People Who Were Killed (By Dahmer The Monster)\" seems to bounce around and highlight the parts it sees fit in a sort-of-socially-relevant-but-still-luridly-entertaining type of way.Thankfully we have the always reliable Richard Jenkins to keep us coming back for an emotional and empathetic performance."},{"id":"rw8567031","title":"Stop Murphy, Please","starRating":"1/10","datePosted":"25 September 2022","text":"I love Evan Peters and Richard Jenkins, and most seasons of American Crime Story so I had such high hopes for this, but after 30 minutes of the first episode, I just had to throw in the towel and give up.First- why change the pertinent facts of the story? There's plenty of detail and facts surrounding this entire case that are interesting and worthy of being portrayed, so I fail to see what exactly demanded such ridiculous story arcs that make no sense? This was incredibly loosely based on facts.Second- what is it with the obsession with dark, grainy, shaky cameras? It's not artsy or edgy and makes nothing more interesting. If anything it gives the feeling of nausea. Stop it. It wasn't good when it was first demonstrated, and no matter how many people use it with their own interpretation, it doesn't get better.Lastly, the victims are still victims. From all accounts, none ever egged him on, at least not in the manner in which the writers suggest- so much so that many victim's families are considering suits. I sincerely hope they're successful and Murphy can knock it off with his odd obsession with twists that make victims look stupid and like they're asking for it.If anyone in Hollywood even still cares what the average audience cares, listen to us when we tell you we've had our complete fill of Ryan Murphy- stop giving him money for nonsense."},{"id":"rw8567211","title":"Traumatizing","starRating":"1/10","datePosted":"25 September 2022","text":"I get that Netflix doesn't legally have to contact the victims families, but they should have. They're reliving this tragedy every single time something about Dahmer is created. Let them mourn in peace, stop being a part of their trauma just to put money in your pockets.As for Evan Peters, I've always been a huge fan. I'm disappointed to know that you didn't reach out to any of the families before portraying this monster. I know he's not the first and unfortunately he won't be the last.Moral of the story.. contact the families and receive their blessings before you give these monsters anymore attention.To the victims and their families, I am truly sorry.You deserve better. You deserve peace."},{"id":"rw8567320","title":"Masterpiece","starRating":"9/10","datePosted":"25 September 2022","text":"I have watched several programmes about dahmer this is by far the best one. The sad reality is most people watch these to find out about the murderer because they want to understand how someone could do those things. What made this show great is that it gave us that insight but it also gave us a huge insight into the victims and their families and Dahmers family. I have not seen this done so well in any of the other dahmer series /films. This series shows the failures of the police and the injustice for the community and families of Dahmers victims it leaves you feeling sick with anger at the lack of responsibility of those in power at the time of his killings. It doesn't glorify Dahmer but shines a light on those who fought to bring him to justice. Evan peters deserves all the recognition for his portrayal of dahmer he does and amazing job and so does Niecy Nash who deliveries an outstanding performance as Glenda Cleveland his neighbour that never gave up trying to stop him from committing these crimes. This series could not be done to a higher quality."},{"id":"rw8567369","title":"Very well made","starRating":"10/10","datePosted":"25 September 2022","text":"I love how this series are made . I love how they have shown Jeff Dahmer like everyone knows him in first episode but after that shows why he was the well known Dahmer . I also like how they have shown the difference between him and Bundy or Gacy . Evan Peters was Amazing and Richard Jenkins is always superb , overall I think the most gruesome episode was the first one and if you can pass that yes it still has horrible stuff but it shows the reasons for them as well and with Dahmer I really think that he wouldn't be Dahmer if his parents ever looked at him and helped his sick mind that with right medication and professional help may not exploded like that."},{"id":"rw8567410","title":"The commodification of real victims tragedy","starRating":"1/10","datePosted":"25 September 2022","text":"Like most \"true crime\" this is appalling. This is literally a cash grab at the expense of retraumatizing the families of the victims. They did not consent to the making of this series. Yes, netflix doesn't legally need consent from them, but from a moral standpoint, they should have. Some of the families are considering lawsuits against this series. This is not speculation.These tragedies are NOT entertainment. And if you view it as entertainment, you have no sympathy for the families. Watch some thing else that is fictional and has no real victims. This should have not been made. Do not watch this as you will be contributing to the commodification."},{"id":"rw8567485","title":"Incredible story telling","starRating":"10/10","datePosted":"25 September 2022","text":"I've seen a lot of people complain or comment on how difficult this series is to watch. But it's supposed to be. I've read a lot on Dahmer and his case and sometimes it's easy to forget that real people with hopes, dreams and day to day troubles died in horrific ways.Sure there have been dramatisations of serial killers lives before but they typically focus wholeheartedly on their story, with little regard to those who lost their lives.This show doesn't do this. Yes, there are segments that show insight into Dahmer and his childhood, but it detaches itself from being entirely from his perspective.This show gives the young men who died a voice, it makes the audience see them as people. Something that is often missing from written accounts of Dahmer and his crimes.Evan Peters has done a fantastic job, from the blank expressions and monotone voice to the way he moves and recounts Dahmers crimes in the interview scenes. The cast is incredible strong and all have done a wonderful job of portraying those who were impacted.Lastly, the show largely stuck to what is commonly known about Dahmer and his life. There were moments that weren't fully accurate (the jogger as an example), but, as the real life version was horrendous enough, I'm glad that directors didn't feel the need to embellish things even further for the sake of viewers.Well done to all involved."},{"id":"rw8567690","title":"Probably the best biography on Jeffery Dahmer.","starRating":"10/10","datePosted":"25 September 2022","text":"The entire series gives you goosebumps, the acting is insanely good. The casting choice was also amazing.Niecy Nash and Evan Peters' acting was very realistic, it felt as if I was there when everything was happening because of how realistically they portrayed everything.It was a bit hard to watch if I'm being honest, it was eerie and disturbing especially when you consider the fact that this actually happened in real life and everything is factual, that just makes it scarier. Ryan Murphy truly made this the best biography of all time, it's realistic, thrilling, ominous, and creepy.I recommend this."},{"id":"rw8567756","title":"Fictional series with very few REAL facts","starRating":"1/10","datePosted":"25 September 2022","text":"The largest part of the story about Glenda is almost all made up facts. She was NOT his neighbor but she lived in another building. There is over an hour of her talking about her smelling death through her air vents and she didn't even live in the same building, let alone next door. I'm all for a little drama but this is just completely false.In the series opener, there is news playing about 5 white officers beating a black undercover officer. The Milwaukee Journal could not find any record of this event. Yet again, Netflix creating lies and a false racial narrative.Dahmer's father did write the judge a letter but he asked the judge to keep Dahmer locked up, not asking for him to be released or get a light sentence.I could go on and on since there are so many other parts that are fictional as well. If you research them, they are easily found. The series could have been made equally as entertaining by staying true to real life events or even being close to real life events.If you want a fictional show, loosely based on events, this is for you!"},{"id":"rw8567785","title":"Really Awful TV, This is bad for you!","starRating":"1/10","datePosted":"25 September 2022","text":"If you're on the fence about watching this, just don't. Go for a walk, donate to charity, sing a song, ask someone out for a drink, but do yourself a favour & don't watch this misery fest. I realised I actually felt disgust watching this, but not in an entertaining way, it's just misery/ horror porn & that is a bad thing!They also seem to be making it, right from the very first words, about racism, which is just laughable 2020 stuff, as if there isn't enough of that already, let's stoke up more trouble, the producers say to themselves, how helpful of them!!!It's also boring & just left me feeling dirty, there is absolutely no point in polluting your brain with this grime. I think I might watch Mary Poppins instead."},{"id":"rw8567835","title":"Ryan Murphy's mind is unique.Dahmer is his perfect masterpiece.","starRating":"10/10","datePosted":"25 September 2022","text":"Ryan Murphy did it again,he made another masterpiece that kinda looks like a mashup between American Horror Story and American Crime Story. I suggest you to start watching the series in the morning because you'd want to binge all the episodes in one day(that's how amazing the series is). All the cast plays their roles beyond perfect,but Even Peters has the best performance of them all(i hope he will win the Emmy).The year 2022 is the year with the best true-crime shows(Candy-Hulu,Under The Banner of Heaven-Hulu,The Dropout-Hulu,The Staircase-HBO and Black Bird-Apple TV+).Another great detail that makes Ryan Murphy's series to shine from all the other crime stories of 2022,except Black Bird,is the fact that Ryan Murphy doesn't need to glorify the gore to makes the audience frightened by Dahmer's horrible crimes. Seeing Dahmer's neighbor,Glenda Cleveland reacting to the weird smell as well as the scary sounds that comes from Jeffrey Dahmer room is spooky enough to give you nightmares.I also liked that,even though the series is called Monster:The Jeffrey Dahmer Story,the director also presents the story of Dahmer's victims. When it comes to true-crime shows about serial kilker,we often focus on the bad guy story more than his victims. Ryan Murphy changed that.In conclusion,Monster:The Jeffrey Dahmer story stands out as number 1 of top 10 true-crime shows of all time."},{"id":"rw8568016","title":"Another Dahmer film?","starRating":"8/10","datePosted":"25 September 2022","text":"When I saw this I thought, do we really need another Dahmer movie? It's been done many time. But turns out we did. Excellent portrayals that will haunt your psychy. I haven't finished it yet but I can honestly say it is very well made and nothing like the previous exploitative slasher films. We all know the story so there is no point in giving anything away. But if your into true crime and the events and psychological disposition of those that commit these atrocities this is one of the better ones. Say what you want about Netflix, they killed it. I just wish Mind Hunter would have continued, but this makes up for it a little."},{"id":"rw8568045","title":"Extremely disturbing","starRating":"8/10","datePosted":"25 September 2022","text":"It feels irresponsible to recommend this series despite how brilliant it is. It is equal parts disturbing and utterly heartbreaking, even a somewhat sensitive viewer may find themselves very freaked out.The writing, the acting, the production design, the music, all of it is so well crafted its hard to critique. I hated how gory it was and you were never spared the violence, but I get why. We needed to know in order to understand what comes next. I felt this was less a story about a murderer and more a story about the poison of systemic racism in our society. It hits the bulls eye on the consequences of prejudice and in this story, had the powers that be seen the truth rather than skin color, all these poor people and their families would have been spared. Its a damming judgment on the justice system and sadly, not much has changed since then.This is one of the very few murder serials that has accomplished leaving the viewer not with thoughts of the murderer, but of the victims and their families. I now know their names! Their names are repeated over and over. Their stories are told and I think this was the point.The show captures the rupturing impact of the kind of grief violent crime creates. As someone who lost a close family member to murder, I felt it perfectly depicted the impact of a loss of that nature. The psychological trauma, the fear of the monster who did this, the anger, the nightmares, the inconsolable grief all paralleled by the horror of the events that led to it. People need to see this.I rate this show highly, but watch at own risk. Its heavy as hell."},{"id":"rw8568068","title":"Freaky AF!","starRating":"9/10","datePosted":"25 September 2022","text":"Can't believe the guy who played Michael Scott's nephew was such a good actor. (from: the office)\nThe Dahmer story is so freaky, it's kind of terrifying. Scenes are absurd, characters are killer and the story line is very unique with almost no background music; which makes it even more scary. Takes a dig at the broken police system, a little racist backdrop and the Jeff dahmer character takes a place around 1966 timeline. It's a worth watch for anyone that likes crime drama and serial killer shows. It's interesting from the very first episode and stays like that throughout. You're gonna wanna avoid eating while watching though. It's gets a bit disgusting in some parts.Happy watching!"},{"id":"rw8568105","title":"Disappointing, upsetting","starRating":"7/10","datePosted":"25 September 2022","text":"First I wanted to give a solid 10, brilliant acting, beilliant story telling I was fascinated and felt they give justice showing what he did until I got to episode 6, Tony, the deaf guy. Beautifully written, showing the victims life etc until I searched and BANG!! They LIED!!!! This is despicable and heart breaking! They show in the film they were romantically involved when the truth is they were not! This must feel like a punch in the stomach to the victim's family! Aweful! I know it's a film but should have stay close to the truth. Now I can't even trust anything what they show in the film. Very disappointing."},{"id":"rw8568398","title":"Evan Peters Hats off to your performance","starRating":"10/10","datePosted":"25 September 2022","text":"A mini tv series well executed and directed with a power packed cast. Evan Peters as Jeffrey Doehmer kicks ass. He portrayed the monster very well! The 10 episode series is well engaging with true characters, the victims of his heinous crimes. Every episode has its own life to it, be it sadness, thriller or grossness. Even though we are all well familiar with the gruesome Jeffrey Doehmer and his story, the tv series did justice to its every details. At the end of the day, you feel for the poor victims and the people who came across this monster. Again, Evan Peters deserve an Emmy ! Hats off to you!"},{"id":"rw8568448","title":"Evan Peters shines again!","starRating":"8/10","datePosted":"25 September 2022","text":"Another brilliant performance from Evan Peters, as well as Richard Jenkins. The series had a good pace, kept our interest through our binge nights--usually 2-3 episodes a night. Peters captures the mannerisms of Dahmer very well, from his almost-distant gaze, to his way of speaking. Jenkins did a superb job as a distraught father torn to pieces at the idea he may have made his son into the man that fascinated the nation with his disturbing crimes. Definitely one of the better iterations I have seen on Dahmer--solely due to Evan Peters' portayal.The only negatives I would mention that actually annoyed me while I was watching were the fact that it jumped around so much, with the flash-backs and flash-fowards, it just became too confusing at times, especially when they started repeating scenes that we had seen earlier, just not in their entirety. It just became too muddy sometimes. The other negative is that they concentrated too much on his neighbor. Given the fact he lived next door to her gave her character relevance to the story, but it didn't warrant the amount of story and dialogue we had to endure. I found myself asking the question, why is any of this important to the main story? And the answer was, and is, that it's not. The series, although very well done, and obviously we'll acted, could have been shortened by a full episode by eliminating the need to flesh out her story. It wasn't necessary. She wasn't a victim, she just lived next door. And the fact that she always brought Dahmer up to co-workers, when one of them mentions how Gacy was the worst-of-the-worst, and she says her neighbor was and asks her if she ever smelled a dead body. It was just stupid writing and didn't need to be in there, all it did was fill up time and take focus off of Dahmer and the families of the victims.Overall, the main actors did a superb job and the series was very well made. I already knew the Dahmer story, as I do most of the other famous serial killers, but it was nice to see the minor details that aren't always made known in other sources, and this series did a good job fleshing those out. I wish we saw and heard a lot less of the neighbor, it was just unnecessary filler in an otherwise perfect series."},{"id":"rw8568465","title":"Well made, awful subject","starRating":"1/10","datePosted":"25 September 2022","text":"First, the acting, direction and script seemed sound. The problem is, Dahmer is pathetic in a way that makes for a boring story. I am a sucker for downer movies, and this is not out of revulsion for Dahmer, but this was a waste of time and resources. I don't think it's possible to make a good story about him unless you completely fictionalized his life story. One redeeming lesson: don't encourage your kids to play with road kill.All in all, it would be a good thing if there were no longer a demand for serial killer miniseries, particularly where the effort is to try to stay close to real life events. By comparison, Henry: Portrait of a Serial Killer was a good movie because it took a pretty bleak storyline from a true story and worked with a serious, thoughtful script. If you simply tried to recreate what the real life character had done, it would be worthless."},{"id":"rw8568478","title":"A chronological mess","starRating":"8/10","datePosted":"25 September 2022","text":"I've never been a fan of starting at the end, and then going back to f. Ex. \"2 weeks earlier\". In this show they go totally nuts with this. Also, there are parallel stories that does similar things with the chronological pace.This is more of a sigh though, it doesn't change how good the show as a whole is. It manage to show how cold and gruesome Dahmer was. Evan Peters is amazing and gives face to Dahmer almost too well I imagine.I know him from American Horror Stories. He was one that made it as good as it is, until they messed it up bad.One more sigh... what the heck is it with Americans and religion? Is it still such a big thing today, like at the time this show depicts?"},{"id":"rw8568504","title":"A nice surprise from Netflix","starRating":"10/10","datePosted":"25 September 2022","text":"This is a must see! Evan Peters plays a terrific Jeffrey Dahmer in this superbly detailed biopic drama. Ryan Murphy does it again with another binging series that'll shape future drama shows. The camera work is simple yet effective with the lighting sometimes falls flat and overly dim lighting to dramatise things in scenes but nonetheless the show is simply worth watching. The soundtrack is very good when showing different timelines. The handheld is very effective also so well done to whoever shot this. Some scenes with Dahmer and his victims in the hotel seemed to drag a bit whereas I liked the tension it was portraying. Interesting take for a serial killer drama."},{"id":"rw8568534","title":"Why make this into a series?","starRating":"1/10","datePosted":"25 September 2022","text":"It is traumatizing enough reading about what Jefferey Dahmer did, why do we need a series on it? I don't understand the purpose of this at all. I don't think something this disturbing and disgusting should be made into a series no matter how good the filming or acting is. There is no happy ending to this, so many people suffered and lost their lives horrifically. And to act out what had happened to real victims feels like they are taking things way too far - this is not exactly a documentary. This is some form of sick 'entertainment'. It feels insensitive and unnecessary and I just feel shocked, angry and frustrated that this has been created."},{"id":"rw8568550","title":"Evan Peters needs an Oscar.","starRating":"10/10","datePosted":"25 September 2022","text":"Difficult to watch, but brilliant acting, writing and directing. Evan Peters has just got better and better as an actor and my god you've got to be brave to take on a role like this. I wouldn't wanna do it. The writing and directing just great as well. It tells the story of Dahmer without making the audience feel sorry for him, that's not the point. It's to show the journey of a truly evil sadistic man. Blood curdling to say the least. I wish it were fiction, as I feel bad for leaving a 10 star review for content so deeply upsetting for the families of those who were murdered. I'll pretend it's fiction for my own sanity and say bravo to those involved."},{"id":"rw8568634","title":"Ryan Murphy does it again....","starRating":"10/10","datePosted":"25 September 2022","text":".....celebrates white male serial while disrespecting the families of their victims.The ten stars were just for exposure; I'd give this three stars. While occasionally achieving a respect tone, RM is unable to hold on to those treads and maintain a point of view. Regardless of how much RM says he honoring victimes and shining a light on their stories; it's not his story to tell especially without the consulting The victims.He doesn't have the talent, character, or willingness to craft the story he pretends he wants to tell. The redeeming parts of show aren't because of RM. I suspect there's a thoughtful show in here, but RMs hand in the project stifles it.Niecy Nash is amazing! I'd edit out all of the gratuitous Dalmar scenes, and make the whole show follow her story."},{"id":"rw8568639","title":"So read the critics of TheFearMakers and whatever you see just believe the exact opposite","starRating":"9/10","datePosted":"25 September 2022","text":"I swear this dude THINKS he knows everything while he dont have a clue...So whatever he says just erase it and think the opposite...The show is phenomenaly good...Direction is amazing,the climax its on point and Evan Peters gives a perfomance worth for Emmy Awards...Its so clever and just to not ONLY see the monster he became but HOW and WHY and that series made it PERFECTLY...No i dont feel sorry for Jeffrey Dahmer there is no excuse for murdering so many people in such brutal way but nobody born as a monster and neither did Jeffrey...So enjoy the show for what it is...As for the haters they always have something to complain so just ignore them."},{"id":"rw8568672","title":"Brilliant","starRating":"9/10","datePosted":"25 September 2022","text":"Brilliant. With impeccable production values, a perfect pace, really well written, great direction and editing, it's always full of tension and can instil fear in any of us.All the different perspectives, all the different stories. We know about Dahmer, of course (one of the greatest performances in history by Evans Peters), but also about his victims, their families, his neighbours (so great Niecy Nash!), his parents (Jenkins...damn!), the awful cops, all the media circus...a great and complete limited series that can be the definitive work about this evil human being.I understand some of the critics, but I believe the pros - mainly showing this in a scary way to all the new generations and also highlighting the black community as the main victims - are way more important than any kind of sensitivity."},{"id":"rw8568790","title":"Evans is amazing; Creepy, chilling account","starRating":"10/10","datePosted":"26 September 2022","text":"Wow. This was disturbing to watch, the story. How sick this guy was from an early age. The signs were all there. His family knew something was not right with him. But never really did anything. I guess what could they. Denial I think the gravity of it.The apartment he lived in, the way the police didn't care. Didn't respond. Shocking. The smells. The noises. All the calls the neighbour made to 911. They never came. The poor 14 year old boy and his family, who had already been victims of this monster. Trusting young men, taken advantage of.The victims. Appalling their deaths. Couldn't turn it off. Great acting. Well written and fab cast. Evans is totally believable."},{"id":"rw8568805","title":"Went from OK to very bad","starRating":"","datePosted":"26 September 2022","text":"This started out ok. Obviously, the Jeffrey Dahmer story on its own is highly compelling. It should have been easy to make a great miniseries about the story.Unfortunately, after a few episodes of decent story (but subpar acting), the series goes downhill rapidly. Instead of a story about Jeffrey Dahmer, it becomes a typical Netflix production that focuses on politics and race.You'll be lectured about AIDS and told in one episode that it impacts churchgoers more than the gay community. Then, the story will shift into a focus on race. You know the drill with Netflix by now: White people bad and Black people good.If that's not enough for you, wait until you have to watch an entire episode with no sound because the director thinks it's important for you to experience the episode as if you were deaf.This show becomes unwatchable. Don't waste your time."},{"id":"rw8568901","title":"Dahmer well worth the watch","starRating":"9/10","datePosted":"26 September 2022","text":"Enjoyed all 10 episodes tremendously! All characters were cast well. Evan Peters as always, phenomenal and Nicey Nash, what can I say! The time taken to cover not only Dahmer but the people around him, the victims and families was not only vital but heartbreaking. The victimization, discrimination, racism by those who should have been protecting the community. A stellar cast telling a gruesome, horrific story, with care and attention to details but not glorifying to Dahmer actions.Would be interested in watching more series like this on people who've had a jarring impact on our society and where it takes us."},{"id":"rw8568912","title":"Jeffrey Dahmer is the sub plot","starRating":"5/10","datePosted":"26 September 2022","text":"Just. Wow. I'm still shook. It took several days to watch this. If you can't/don't \"disconnect\" from the internet fir the roughly 10 hours this spans, then just watch Jeremy Renner or My Friend Dahmer & you'll get that part of the story. Taken in as a full 10 hours this became, for me, less than just about Jeffrey & more of an epic composition of stories of different people all of whom became caught up in the ensuing cat-5 this story would become. It becomes a commentary of humans & humanity. Of guilt vs shame vs apathy vs blame. Of religion and how humans view religion, regardless of affiliation, and use it in their own individual way to gain their perspective of their own world...of which, like it or mot, we are all a part of. My grand takeaway from this was rather...restrained? Dim? Hopeful? That time only ever moves forward as it creates and then erases mountains and that we are really just \"dust in the wind\" as time moves on & that good & well-intentioned people get tossed by the wayside in humanity's ever survival-of-the-fittest. I'm going to go hug my dog and cat now after a long, hot shower. If this doesn't sweep every major award category come award season, and not just for Peters (I cannot fathom how one falls into such a role so completely without carrying some if that funk with you for life) but the also the brilliant Niecy Nash then there truly is no redemption for us."},{"id":"rw8568936","title":"goosebumps","starRating":"10/10","datePosted":"26 September 2022","text":"Literally. Echo others' comments. It truly is produced outstandingly.It is very much disturbing though, not for the faint of heart. I mean it. The storyline is damn disturbing. Maybe its me, but it did have a depressing effect on me, to learn about such incidences. Totally production worthy material and treated justice to, in productizing into a well made binge worthy series.Hats off to the characterization and performance, esp dahmer's. It is hard to characterize such a devil as a human and holy God, it is just heck of a performance.Binge watch material for sure. I remained on the edge of the seat, in horror. Take a bow, Netflix."},{"id":"rw8569021","title":"The scale","starRating":"6/10","datePosted":"26 September 2022","text":"The scale of true crime horror presented in the play is relatively conservative. One is Dahmo's unhappy growth experience and the gradual formation of his perverted personality. The other is the story of the victim, which is the most tender and heartbreaking sixth. The pictures of people on the fringes of the two societies expressing their affection and love in words will even make people willing to immerse themselves in the short-lived sweetness, and when all this finally returns to darkness, they will feel the freshness of the life he destroyed with his own hands even more painfully. The third live article is an in-depth discussion of social issues that is generally not lacking in excellent crime works. Neighbors are full of angry but powerless questions and accusations against law enforcement agencies, which still reverberate in countless communities today in the 21st century.The audiovisual language is still high quality in narration and expression e6 seems to see the shadow of Ryan's ACSs2 and Pose again The attention to the minority and the disadvantaged Both Dahmer and the 17 victims were once neglected marginal figures and ironically the victims The family of the murderer was haunted by nightmares all his life. After being imprisoned, Dahmo got the attention he had never received in his life and the so-called God's acceptance. Being killed by God's messenger was also well deserved."},{"id":"rw8569199","title":"Great acting, mid overall","starRating":"6/10","datePosted":"26 September 2022","text":"(Jeffrey Dahmer, born May 21, 1960 in Milwaukee and murdered November 28, 1994 in Portage, nicknamed \"the cannibal of Milwaukee\", is an American serial killer who confessed to having murdered seventeen young men between 1978 and 1991.)Well, where can we start? Evan peters (Playing Jeffrey Dahmer) delivered a great acting as usual same with his father Richard Jenkins (Playing Lionel Dahmer) plus Penelope Ann Miller (Playing Joyce Dahmer) and Molly Ringwald (Playing Shari Dahmer) but the others are forgettable or overdone at some points. The first 3 episodes at would were really good but after that it keep jumping from time to time and was kinda boring at some moments. But the worst came when Netflix decided to pop up and destroying and re-creating to Story of Dahmer. A lot of things has been changed or created for the show (The insults towards the asian familly or the cops promo etc) and they did there woke moments with some horrible sentences who were non sense and should't even be here but it was pure hate towards us. And talk about the woman neighbor? Seriously? So much. Too much screen time when she was just a neighbor? We would have removed it from the series that would not have changed anything at times? Why taking so much for her? Anyway, good to see these 4 actors but too bad Netflix had to put their dirty nose in it."},{"id":"rw8569303","title":"The best series in 2022","starRating":"10/10","datePosted":"26 September 2022","text":"I loved everything about this series. The suspense is beyond expectations. The actor did a very good job in representing the real dahmer we know. In short, it a must watch series that was produced to last.I liked the focus on the mind of Dahmer. His motives, emotions and most importantly his childhood. We were taken in a journey to discover his true self. Starting with murders and then delving deep down into the darkness. I think the show made us understand Dahmer in a brilliant way.After the disappointment of high budget series in 2022, here Dahmer comes to compensate.I recommend watching it."},{"id":"rw8569331","title":"Absolute brilliance from Evan Peters","starRating":"10/10","datePosted":"26 September 2022","text":"Yet again one of the most underrated actors of our generation knocks it out of the park. Peters becomes almost unrecognisable as he portrays Dahmer and gives easily his best performance to date. This show is definitely not one for the faint at heart, it's unsettling and disturbing in many ways. But for those that love the true crime aspect and haven't a weak stomach will have much to enjoy here. Each episode breaks up bits of Dahmer's life and in no way glorifies him. The show does a fantastic job, especially with Peters staring as the killer, of showing just how much of a monster he really was. A must watch for true crime fans."},{"id":"rw8569362","title":"You don't know Dahmer.","starRating":"9/10","datePosted":"26 September 2022","text":"I won't simply repeat what is being said here by far better reviewers, but yes, Evan Peters deserves an Emmy for this, only because the show is not eligible for the Academy Awards. The other characters were all real. I didn't see anyone \"acting.\" The show is creepy, disturbing, and frightening, even if you know the story, and I do.Suffice to say that I was 20 years old in 1978, a part of the gay community in Chicago, and remember this entire case quite well. Jeffrey Dahmer was EXACTLY as you see him on screen in this series -- Peters nailed it to a fault. Those here saying that he appeared to be an automaton, or stupidly, he had no character arc, WAS Dahmer. He had very little human affect to him. He was robotic, and although I won't try to place blame, in hindsight, his mother's drug use during pregnancy may have been a contributing factor, and his father didn't really come around to being demonstrative with Jeffrey until after his crimes were found out, but again, no actual blame to either of them for what Jeffrey Dahmer did. He did what he did all on his own.The writers were not kind to anyone except the people that tried to expose and stop Dahmer before he was finally caught. The Milwaukee police of 1991 were taken down handily, and although that Officers of the Year ceremony didn't happen, it merely drives home the fact that the police homophobia and AIDSaphobia, and blatant racism contributed A LOT to Dahmer being able to have the killing spree he did.I highly recommend this series, but make sure you have 10 hours free because it's doubtful you'll be able to break away from it once you start. Although I didn't find any \"wokeness\" in this series, if you happen to be one of those red-pillers, you might, because you'll be looking for it. Don't do that. It's not really there. Calling something \"woke\" is code for \"this makes me feel uncomfortable because I know it's all true, and that makes me feel icky, but I'm not allowed to show it.\" Everything is not a comic book. Everything is not some trope from a popular movie series. Some things are just simply true no matter how much you wish they weren't."},{"id":"rw8569384","title":"Bloated and boring, two adjectives I didn't think I would be applying to this show after the first trailer dropped","starRating":"5/10","datePosted":"26 September 2022","text":"This show was way too drawn out. Did we really need 10 almost 1 hour long episodes? This series should have been trimmed to a maximum of six episodes. I am noticing this trend with these true-life crime dramas to extended them well beyond what the story structure can support (Under the Banner of Heaven, The Staircase to name some recent few) which results in the series plodding along with a lot of dead time instead of being a tight, brisk and thrilling watch.While I enjoyed it, I thought Evan Peters performance of Dahmer was very one note and a bit of a disappointment to be honest. For me Richard Jenkins as Lionel Dahmer quietly steals the show. Niecy Nash also gives an honest and enjoyable performance as Glenda Cleaveland, Dahmer's next door neighbor who had to put up with all the smells and noises coming from his apartment and who on many an occasion called the police because of the terrifying sounds she heard coming out of the grating that connected her apartment and his, but was simply ignored by the local police.I will say Episode 6 was a punch to the gut though as they focus on one one of his victims, Tony Hughs, which was just heart-rending to watch. I found myself wanting to shout out at the screen to warn poor Tony once his path crossed with Dahmer's and so desperately wished for him to be one of those victims that managed to escape with their lives intact, but this was not to be the case.One of the biggest sins this show commits (and one I am sure could have been alleviated with less episodes) is that it's boring and I am a true-life crime enthusiast. When you have your viewers falling asleep throughout the show (and during the day too since it was a daytime watch) about one of the most notorious and gruesome serial killers to have ever existed, then that tells you something is definitely wrong with the pacing of your show, as is evident here.On a side bar note : - Why these people even went into a house/flat that smelled of rotting flesh is beyond me. Our bodies are hard-wired to be repulsed by that smell. Even if the bloke wasn't a serial killer, my hygiene buttons would have been pushed to their limits. There is no ways I would have stayed."},{"id":"rw8569418","title":"Solid but weak last episodes","starRating":"7/10","datePosted":"26 September 2022","text":"This is a solid true crime show with brilliant acting. Especially Evan Peters does an awesome job. It's exciting to see the horrible story of JD staged so carefully. Would have been an 8 but the last two episodes focus too much on JDs neighbour Glenda Cleveland. She surely suffered a lot when JDs crimes were discovered but 15 people had been killed whose friends and families certainly suffered a lot more. I think those people deserve more attention than a lady that indeed did a good job but was not involved in the matter so much. That's why the last episodes are a little bit slow moving. All in all worth a watch."},{"id":"rw8569493","title":"Too slow","starRating":"7/10","datePosted":"26 September 2022","text":"I watched the series Black Bird just before I watched Dahmer, and even though it's not fair to compare the two series, Black bird was so intens and I didn't get bored one minute of it. Dahmer doesn't hold my attention all the time, and I think they should have had less episodes. They jump weirdly back and forth in time as well which is a little confusing. Netflix manage to make an very insane and interesting story boring. That being said, the actors are amazing and because of them I managed to watch all 10 episodes and give this show a 7. The way Netflix tell the story only deserves a 5 at max."},{"id":"rw8569517","title":"An important story to tell that's told brilliantly.","starRating":"10/10","datePosted":"26 September 2022","text":"In my opinion, the Netflix DAHMER series might be the best true crime film/show I've seen and brings to light a lot of things that are important and shouldn't be shoved under the rug. It's extremly well written, acted and directed. Depicting a real life tragedy is never easy, and it's bound to make some people angry. True crime dramatization will always be controversial, but I believe the show really means well. It honors the victims and survivors and brings a light to the social injustices and incompetence of the police that led to a killing spree that should never have went on as long as it did. Episode 6, \"Silenced\", was one of the most gut wrenching and well made episodes in any television series I've ever seen and truly started to bring things into perspective after the shocking first half of the series. For those who might have been unable to get past episode 6, I urge you to continue on. The series starts off shocking and full horror, but I have to say the second half is what makes it so good by honoring the victims and the survivors. In my opinion, its a great example of how to appropriately approach a true crime story of a sensitive nature and how to approach social injustices in America that so many writers want to write about these days with all that's going on in our time. The crimes of Jeffrey Dahmer just doesn't tell a scary story... It's an important event in American history that should not be forgotten. The writers should be proud. I'm hoping this series will set a higher bar for the writing behind Netflix original content. 10/10."},{"id":"rw8569631","title":"A sad account, in every sense of the word, particularly however, with the liberties it takes.","starRating":"6/10","datePosted":"26 September 2022","text":"While Evan Peters certainly deserves accolades for his particularly engrossing and gripping personification of the monster that was Dahmer, the series - the first half of which was excellent - leaves much to be desired.Note: A special mention should also be made of actor Shaun Brown who delivered a stellar performance in his portrayal of Tracy Edwards, Dahmer's last would-be victim.Like a good book that you just do not want to put down and which leaves you wanting to know what the next page will bring, the first episode of \"Dahmer, Monster\" is compelling enough that if you have the time, you will not even think about turning off episode two.The issues, for me, began around episode 5. This is when the story began to move away from Dahmer and his actions somewhat, and began to concentrate on other aspects of the case and the people who surrounded him. This disconnect just grew and grew into the ensuing episodes, with Dahmer being present, less and less. While some viewers may not have minded this, and perhaps viewed it as being 'thorough', to me, it was fluff and fill. There's is no convincing me that this series would not have benefitted from being two episodes shorter. In fact, you could turn it off at episode 6, and could truthfully say you saw it in its entirety, ...or at least all its best parts."},{"id":"rw8569644","title":"an enigma in the end","starRating":"9/10","datePosted":"26 September 2022","text":"I hypothesize that aggression and sex co-exist near each other in our brain for they both reward us with pleasure and gratification. Otherwise, how else can you explain away that in all cultures, cussing is always in the form of aggressive sexual expletives? I think our evolution as social animals mandated us to separate violence from sex as a fundamental survival contract between us. A code of right and wrong for coexistence as species. As for this story which is a true story, it is about a young man where his barrier of separation between sex and violence had broken down and the pleasure he had gotten from the combined both became an addictive intoxication which led him to become a predatorial serial killer for the pleasure of his own sexual fantasies. This is a finely crafted series looking to become an Emmy Award contender. Or maybe even Emmy winners, especially for the stellar performances from Evan Peters and Richard Jenkins. Just ace! I do have some quibbles though. The first has to do with the script, it shifted focus from Jeff Dahmer to one of his victims in the second half as a lead-in to espouse on racism. Even though the introduction of the character Tony Hughes was clever, but racism is really a different form of victimization. I think the story pounded too heavily on this point which to me becomes a diffusion more suitable for a different angle and another story based on the same plot. The other quibble I had was how John Wayne Gacy was brought into the story. It was an unnecessary and exploitative spotlight on him just for the sole purpose of underscoring a few lines about repentance from Jeff. My final verdict is a high recommendation but only if you are not offended by the shock of male sex and shocking violence."},{"id":"rw8569646","title":"Mixed Feelings","starRating":"10/10","datePosted":"26 September 2022","text":"It almost feels wrong to call it \"great\" or \"really good\" given what happened. I spent many of the scenes thinking of how would the victims families feel about so much horrific detail in specific scenes. It almost feels exploitative at times of the victims and their families.On the other hand, I believe it's also one of the best directed and acted (Evan Peters) series I have ever seen. The feel of the show is hard to put into words, Horrifying, Jaw-dropping or Chilling? Either way you cannot stop watching. The Negative reviews about the series being too long or slow are rubbish. Part of the reason the show is rating so highly is due to the depth they go into for some scenes, something that likely wouldn't have been achieved over a series with 4 episode or the like.I'm not sure the show should have been made but ultimately it was and is now out there. Therefore, it deserves a 10 for what it is, whether it should have been made is a separate issue."},{"id":"rw8569813","title":"Good luck not binge watching this...","starRating":"10/10","datePosted":"26 September 2022","text":"Dahmer is one of those shows which, once you start, you're hard pressed to stop until the end. I watched it in two 5-episode sessions over two days, and everything about it was excellent! The atmosphere of dread and filth, the haunting theme song, and the continued unpredictability carries the story from start to finish. The crimes themselves aren't even the \"star\" of the show as much as the acting, writing, and constant tension wondering what will happen next. Have I mentioned the acting is top notch?Having never heard the Jeffrey Dahmer story, everything was new to me. But after looking up some details and interviews afterwords, the facts seem to be accurately portrayed here.Not for the faint of heart, I highly recommend this show to anyone interested in a worthy telling of the Jeffrey Dahmer story."},{"id":"rw8569827","title":"From pretty good to leftist propaganda.","starRating":"2/10","datePosted":"26 September 2022","text":"This show started off well. But the more episodes I watched, the more the pace of the series started to annoy me. Another thing that bothered me was the constant time jumps. It didn't make any sense. And then they mixed in some political stuff about race, even though Dahmer also killed white and a latino men. And of course it's all the (white) police fault, according to Netflix. It's true that the police made some horrible mistakes, but of course Netflix had to portray some pure evil white cops.And the last two episodes get totally ridiculous. They make a charicature of the christian faith. No pastor would ever say 'congratulations, your sins are forgiven' after you're baptized. 'cause that's not what baptism does. Yes, it symbolizes it. But if you don't believe that Jesus died for you, then there's no forgiveness of sins. So, this show is kind of ridiculing the christian faith by telling that Dahmer just gets his peace with God for going down in a bath.And then there's the killer of Dahmer.. man.. I won't spoil anything, but they totally make that political as well. Sorry about my english. It's not my native language.Anyway, a 2 for the acting."},{"id":"rw8569903","title":"A masterpiece with master class acting","starRating":"10/10","datePosted":"26 September 2022","text":"Even Peters will surely be recognized for his portrayal of Dahmer for years to come. He was a perfect balance of creepiness and impenetrability, leaving us constantly sickened but thoroughly intrigued. Every moment in this series was riveting, carefully planned, and meticulously portrayed. Scene after scene artfully captured the essence of a time without social media, when life in certain communities was so lax and obscure that such crimes could go unnoticed. We feel pity for some characters who don't necessarily deserve our sympathy, while being completely enveloped in sadness for others. Count on seeing several well-earned awards handed out for this one in the near future."},{"id":"rw8569982","title":"\"Guess I really done it this time, huh?\"","starRating":"10/10","datePosted":"26 September 2022","text":"That's how Jeffrey Dahmer, a man who slaughtered, cut up (and often ate) 17 young men sums up his arrest and indictment. Like many people, I knew the headline of Dahmer's story but little else. This dramatization, starring the great Evan Peters shows the story from the victim's perspective which I found very compelling. In these stories of mass murder, society rarely gets an opportunity to understand the human beings that suffered the most. Sure, we get their stories, but their inner personalities, lives, dreams and motivations in life are never really known.It's very well done, yes hard to watch, but masterfully directed (four episodes of Season One were directed by Jennifer Lynch). Niecy Nash, always superb, plays Glenda Cleveland, one of Dahmer's neighbors who (in vain) begged the cops to investigate bizarre screams, buzz saws, and the stench coming from Dahmer's apartment. As her character states, \"For years I told you to do something and you did NOTHING.\" Nash is simply superb in this role.Stories are told from at least 10 instances where this monster was nearly caught but time after time, released. Inept cops and judges that give him a pass are simply astounding. So if the father, who makes everything about him.As always, Richard Jenkins delivers a perfect performance (as the senior Dahmer) Molly Ringwald, Penelope Ann Miller and Michael Learned skillfully play other Dahmer women.Once again, we have another story of police not being held accountable. The ineptitude of cops and judges is shocking."},{"id":"rw8570050","title":"Watch this for Evan Peters.","starRating":"6/10","datePosted":"26 September 2022","text":"Finished watching this series last night, I will say I did enjoy it even though as some reviewers have said the truth was stretched a bit but of course that doesn't come as a shock because this is a series and they do spread certain scenes out for dramas purposes.The episodes seems to go fast when you were watching, especially when Evan Peters was on screen as Dahmer, he was brilliant.I am still at a loss as why some have said they had to turn it off because it was bleak, of course it is. This series is about a serial killer.Overall a very well done drama series, it's not as gory as your led to believe."},{"id":"rw8570129","title":"Outstanding acting all around","starRating":"10/10","datePosted":"26 September 2022","text":"I really hope this series wins awards for the story telling and the acting. Evan Peters performance was perfect. The only thing is that I am curious to see / make sure the victims and victims families were compensated the money they deserve. Not a spoiler so don't worry about that. I started rewatching it as soon as I had finished it the first time through and it made all of the themes stronger and the layout even more clear as to the overall design. Ryan Murphy never disappoints with the music, colors, timelines, themes chosen etc. It has become a tradition for me to binge watch his content. Fresh, relevant viewpoints."},{"id":"rw8570201","title":"The police is the true monster","starRating":"8/10","datePosted":"26 September 2022","text":"The biggest question that comes up on my mind from that series, what has changed in the policy of the public service and in Milwaukee and in general in the United States since then , was anyone from the police who turned a blind eye and all the conversations that were ignored, was anyone prosecuted? Has anyone changed any policies following the incident. I'm just shocked not by the horrible deaths that I was aware I would be exposed to following the series, but by the anger I accumulated from episode to episode caused by the police's disregard and how they actually lent a hand and helped this monster continue to kill."},{"id":"rw8570234","title":"Wow....unbelievable, heartbreaking, amazing performances!","starRating":"10/10","datePosted":"26 September 2022","text":"So from beginning to the end, this show had me gripped, it's been delivered so well. Evan Peters is outstanding and should definitely be nominated for his impeccable performance of Jeremy Dahmer. Richard Jenkins who plays his Dad displayed unconditional love despite what was happening and also delivered a great performance. I couldn't wait to watch the next episode once one had finished. At times, yes, this is a tough watch, the families of those involved is heartbreaking. This show raises an awareness of a number of things, and it was all portrayed as well as it could be. Very well done to all involved."},{"id":"rw8570284","title":"Evan Peters, wow","starRating":"10/10","datePosted":"26 September 2022","text":"I have always liked Evan, but this is a whole other level (I know a cliché). He goes from tenderness to monstrous in a heartbeat. The supporting cast is outstanding too. This is one of those really tough viewing series that keeps you gripped and you can't look away. The only other series that was like this in recent memory, was Chernobyl. That feeling of dread in the pit of your stomach. It's not even the same genre but that gripping horror is the same. The one thing that the Dahmer series dies, is keep the directly gruesome images out, it's mostly indirect but you know exactly what you're (not) looking at."},{"id":"rw8570448","title":"The truth is unbearable to watch","starRating":"10/10","datePosted":"26 September 2022","text":"To make it short: this isn't a show about a very sick being. This is a document of a very sick society full of racism, neglect, white privilege and a police structure that is self-righteous without being controlled.It makes you physically sick. But not watching bones in acid and blood stained beds. It's the injustice, suppression of black and brown and whatever coloured people other than white and inequality that runs deep in the veins of the US. The true horror is that system that let Dahmer keep going. A system that rules white over black and brown. A system that is far from being a thing that happened in the past. It couldn't be more \"now\".This is letting you freeze up.Watch it."},{"id":"rw8570522","title":"Slow, confused, waste of time","starRating":"2/10","datePosted":"26 September 2022","text":"Thought it was going to be based on the facts but it wanders off all over the place. A hard slog through some pointless scenes. Political, social issues thrown in which turn it into something else. I'm not sure what it was meant to be. Waded through it as I'd started it but was a most unpleasant and boring in parts, story that has been better told. I also read that the relatives of the victims were very unhappy to have the series made. Some good acting that's about it. I really wouldn't bother - the last couple of episodes are all over the place and a total waste of 2 hours of your time.*****"},{"id":"rw8570548","title":"Well done","starRating":"10/10","datePosted":"26 September 2022","text":"This was so beautifully written, directed and casted at top level. The cast is great and acting is all time high. But, Evan Peters is a true genius of is portrayal. This guy has always been a great actor but this has to be his all time best. Evan Peters deserves an award here! There was times I forgot I was watching acting and it was like he became dauhmer. The way they show the victims and give them a place and heart really spoke volumes. The writers made them part of the story which many crime shows/movies do not do. The way this is written makes you truly care and feel for all involved. Ryan Murphy never disappoints."},{"id":"rw8570582","title":"Really good BUT..","starRating":"5/10","datePosted":"26 September 2022","text":"It's a really good show about Jeffry Dahmer and his killing spree. The first half of the show was amazing BUT Netflix...\nThey started to lean heavily on the racial aspect of it even though it was never understood to be racially motivated. If anything it was more so targeted towards the gay community. Then comes the portrayal of all the victims. They could do no wrong. They were all angels apparently, like seriously? No one deserves to be murdered but come on let's be realistic. Not one victim has a flaw?Felt like watching the news. \"Oh this young man just got murdered for no reason whatsover, he was a PhD student and community leader that just so happened to have a gun and was in a high speed chase.\" Yeah its a little exaggerated but you get my point."},{"id":"rw8570596","title":"A grippingly scary & true take on a monster.","starRating":"10/10","datePosted":"26 September 2022","text":"The acting is incredibly captivating, a take on the truth of how the monster (Jeff Dahmer) murdered and tortured the innocent men he met. Quite shocking in many places but without unnecessary gore. A serial killer with evil intent who came to meet his fate at the very end of his sick and twisted actions.Evan Peters is absolutely brilliant in this take on Jeffrey Dahmer, if you liked the Ted Bundy tapes and the film about him then you'll enjoy this limited series consisting of 10 hour long episodes.Gripping, so much that I binge watched the whole limited series in two days. Acting is excellent throughout."},{"id":"rw8570670","title":"Tasteless and Unnecessary","starRating":"1/10","datePosted":"26 September 2022","text":"I think it is tasteless and unnecessary to make shows like this about serial killers. The man brutally murdered more than a dozen people, why would you want to make a tv show about that?A horror movie is one thing because they are works of fiction, I can see how that makes for a thrilling story, but the difference is that this was a real killer with real victims and some of the families are still alive, how do you think they feel when a new tv show comes out about the man who killed someone they love (almost glorifying him) and it becomes the most popular show on Netflix? Have Netflix really sunk that low?It would be different if it was an informative documentary, something like a collection of interviews with criminal psychologists, police, and victim's family members if they were willing, don't glorify him in any way, but just talk about what he did and try to explain why he did these things, maybe something positive could come out of that because people could learn how these monsters are created and we could all try to make sure that stuff doesn't happen again, but this is just cheap heat, it shocks people (and it should) but that is not automatically a good thing.If they really wanted to make something like this then they should have made it about Jack the Ripper or other cases like that, because it happened so long ago that everyone involved has been dead for a very long time. So I'm sure this is probably well made as far as tv shows go, but I think it is very tasteless and unnecessary to make a tv show about this creep, and I think it is even sadder that it is currently number 1 on Netflix. People are sick."},{"id":"rw8570691","title":"Hauntingly heartbreaking, but a triumph for Evan Peters","starRating":"10/10","datePosted":"26 September 2022","text":"Don't take this the wrong way, but as a lover of all things true crime, I've seen many drama series attempt to portray Dahmer but all have fallen short of capturing the horrors of this man in a realistic way. It's like everyone has been too afraid of how the audience would react. No one ever took the time for any character development so we could try to understand what happened to Dahmer, how he thought and felt... how many scenarios could have played out differently that may have changed the fate of so many lives. How he managed to lure so many innocent lives. What actually led to him to take such drastic, unforgivable actions. And so they diluted the story in so many ways that it always left me wanting more, feeling like they barely scratched the surface.This series isn't for the faint of heart. Was I disturbed? Yes. Was I disgusted? Of course. Did I need to press pause to ask myself, do I really want to continue... yup.I'll wrap this up by saying this.Is it a hard watch? Absolutely. But let's be real - who presses \"play\" expecting to NOT be disturbed? I don't think it's fair to rate this accordingly saying \"it's too hard to watch\". Guys - the man was a sadistic, murdering cannibal who kept pieces, if not entire bodies for his own pleasure. If you're not familiar with the story, listen to a podcast. Watch a series from cable TV. This series goes ALL in.Dahmer is a cinematic triumph. Ryan Murphy and Evan Peters truly outdid themselves with this series and it's exactly what I've been waiting to see for so many years. Not because I idolize him, but because I feel like this truly depicts his depravities leaving the viewers knowing exactly what happened, to whom and how.My heart goes out to the families of those impacted. I can't imagine the press and ads they've been subjected to, but let's not take it out on the cast and producers for taking on such a heinous, once in a lifetime story and totally nailing it."},{"id":"rw8570698","title":"I can't hack how realistic it feels watching it","starRating":"1/10","datePosted":"26 September 2022","text":"Watching it is an ok binge, I got to the end of ep.2 just there and I might not watch the rest of the series. I felt a bit disgusted at how realistic the reenactment is, like the level of detail freaks me out. If it wasn't actually based a true story, I think I could hack watching the whole thing.PR on this series is a bit iffy too. Not sure if I can look at the main actor playing Dahmer the same again. Maybe he could be a good Joker one day. Anyways, I'm terrified for life now. I might have the balls to finish watching it in a week or two or maybe over Halloween.Overall it's alright, bit graphic, story line will shock you, creative directing will probably shock you too, as they barely held back."},{"id":"rw8570743","title":"At a loss for words.","starRating":"10/10","datePosted":"26 September 2022","text":"I expected a charismatic, manipulative Evan Peters as the cannibalistic Jeff coming into the show. We got that, but it was portrayed in a way that took the focus from Jeff and showed the pain and chaos that were derived from his actions. It painted serial killers as they should be, monsters. Kevin and Niecey were both SPECTACULAR. Kevin's performance as Lionel Dahmer, will go down in my book as one of the best performances of my lifetime. When he walked into the room and the medical examiner pulled the cloth from Jeff's face, I BELIEVED him. When his head popped to the side and frowned, I believed he was a father who just saw their dead son's body. SUPERB."},{"id":"rw8570762","title":"The New Tabloids","starRating":"3/10","datePosted":"26 September 2022","text":"Until viewers get their fill we will be left with exploitative dreck like this.This show is gross. Period. Full stop.This genre of exploitative fiction, passing for non fiction is disgusting, it should be criminal. To force victims to relive this is ridiculous, all to turn a buck. It's gross.... if you support it, you are to blame.Stop watching this stuff, you want True Crime, watch that... to fictionalize it is disgusting, it's tabloid level garbage.This whole thing is incessant, we are getting non stop shows that attempt to dramatize fiction with no care to the victims, or truth.STOP WATCHING THIS DRIVEL."},{"id":"rw8570779","title":"Evan Peters is terrific here!","starRating":"8/10","datePosted":"27 September 2022","text":"I want to star off by saying Dahmer - Monster: The Jeffrey Dahmer story (what a ridiculous title) is a very tough watch. I grew up about 30min from Milwaukee and even though I was a little kid when he was arrested I still remember this story being a huge, especially around here. How he was able to get away with what he did for as long as he did is very troubling. The police dropped the ball time and time again and lots of innocent lives were lost because of it. Evan Peters deserves every bit of recognition he's getting from this series, he was brilliant. The rest of the cast is good too but it's Peters who makes this show what it is."},{"id":"rw8570822","title":"\"Y'all did nothing !!!\"","starRating":"10/10","datePosted":"27 September 2022","text":"If you know the story of Jeffrey Dahmer, there are no spoilers. If you don't, there are spoilers in my review.A must watch, great acting, in a true story about an evil human being that walked the earth scot-free for a awful long time before he got caught.The Dahmer story in ten gutwrenching episodes. The failure of the police to follow up on calls that were made by his neighbour Glenda Cleveland. The neighbour that was dismissed a thousand times and had they listened, there could have, would have, should have been less victims.There is some great acting by Evan Peters because at no point you feel bad for Dahmer, or even relate a little bit. Richard Jenkins as his dad, Lionel Dahmer, gives a great performance aswell, and Niecy Nash as the ignored neighbour Glenda Cleveland aces her part.You can almost smell the decay, sweat, stench, mold and the bloodsoaked matrass but the worst smell of the entire series is the story about how this Dahmer got away with his crimes for so long, and how little there was done for the (families of) boys and men who went missing, and how little there was done by authorities for the victims, letting each person who watches this, to have an opinion on who is to blame, if any. But the real 911 call by Glenda at the end of one of the episodes, is witness to the devil may care attitude by the authorities involved, because (so it seems) it was all happening in the black, poor and gay community. So no one, except for her, really cared.All in all an amazing story telling by. Ryan Murphy (why, at first, I thought they would steer from the true story but the absolutely did not) about a serial killer that didn't have to make so many victims, had they listened to Glenda. Cleveland in the first place.There are no spoilers for people who know the story. And one can go into detail about the disorders Dahmer may have suffered from, but sometimes some people are just plain evil.This story does not claim anything about what might have been, or gone wrong with him, it just tells the story of an evil man that for a long time, got away with murder."},{"id":"rw8570866","title":"Perfect Series","starRating":"10/10","datePosted":"27 September 2022","text":"I absolutely loved this series. The producers and directors rocked this film. This entire film was wonderfully made, excellent work, and thank you for making it. I noticed that this was all to the book almost 100% correct. I'm not sure why I have to have 400 characters for this but I guess I'll just keep talking and keep talking and let the thing record everything that I'm saying because this IMDb is making me do this. Not sure why but this film was very good and I am to be is making us do this and I'm not sure why or what the point of this is do you want us to keep talking keep talking about this or there's nothing more I can say about this. I am DB please take away the minimum characters. That's kind of silly."},{"id":"rw8571020","title":"Profoundly disturbing","starRating":"9/10","datePosted":"27 September 2022","text":"I'm still trying to shake the heaviness this show left with me after binging it over two nights. Evan Peters was outstanding, as he is in all of his roles. I was familiar with Dahmer's background and timeline. I think that made for a more interesting watch.The best thing this series achieved which sets it apart from other horror-dramas based on serial killers is respecting the victims through personification and humanisation. In this series, Dahmer's victims (including Dahmer's neighbour, Glenda) have there time as temporary protagonists which gives us a window into their lives and how they were destroyed by Dahmer. The series also does a fantastic job at demonstrating events in Dahmer's life that precipitated his crimes, without trying to rationalise them or create room for sympathy or empathy.The only reason is didn't give this show 10 stars is that the pacing with jumping between time points is a bit off at times.Highly recommend."},{"id":"rw8571029","title":"Let people like Dahmer rot, don't glorify him.","starRating":"1/10","datePosted":"27 September 2022","text":"Why are there so many documentaries glorifying and idolizing these \"people\" that did unspeakable things. Remember the victims and stop putting out stories for their families to relive these tragic events. Dahmers name should be forgotten just like all the other killers. You wanna make a fictional suspenseful show about a psychopathic killer? By all means do. I've seen Halloween, I've seen them all, but leave the real ones to rot and to be forgotten about. You're only fulfilling the attention that dahmer wanted his whole life, and giving him exactly what he wanted. I made it to episode three before I couldn't take it anymore because these directors are framing him in a light where you're supposed to actually feel bad for him."},{"id":"rw8571116","title":"Excellent!","starRating":"9/10","datePosted":"27 September 2022","text":"I knew this mini series was going to be tough to watch, and I was right. It was extremely disturbing and at times I had to look away or turn it off completely until I could go back and continue watching. But ... it was excellent! The creators, writers, and actors did an amazing job telling this horrific story. They took their time and they got it right. It never felt rushed. They did a fantastic job developing the characters so that we could really get to know them as the story unfolded. Evan Peters should be nominated for an Emmy for his performance as Dahmer. He was phenomenal, as was Richard Jenkins and Niecy Nash."},{"id":"rw8571180","title":"This is a TV show raising the bar while executing on every level","starRating":"10/10","datePosted":"27 September 2022","text":"The acting, writing, and ability to adapt a real life story off a serial killer into compelling episode after episode is mind blowing. They could have fkd this up hundred different ways, especially being in the horror genre and lose sight of the components that are needed to even have a chance on being next level television. I was drawn in from first 10 minutes and watched it straight through.There is a lot of junk on TV these days we don't have the luxury of knowing the shows that are worth our time, but this is definitely one of them. Acting was academy award worthy, and to be quite honest the most facsinating part to me was watching this kid grow up in a toxic family environment and how that greatly affects a child's psyche as they grow.Phenomenal job all around here to the cast, directors, screen writing, and exceptional acting**MUST WATCH**"},{"id":"rw8571188","title":"Dahmer an American Predator","starRating":"7/10","datePosted":"27 September 2022","text":"Overall I liked the series and the way they direct it\nEvan Peters acting was amazing and successfully\nRichard Jenkins was Legendary in the role of his father he was astonishing and so convenient and deserve an Oscar :)\nMy only reservation about the series is the prolongation, it could have been easly done in 5 or 6 episodes ; But overall it was not borring at all.Another thing I liked, the director succeeded to highlight Dahmer homosexuality without any repelling scenes and this was pure genius.It's worth watching for sure\nAlso shooting the series in classic way give it the lovely 70s and 80s style."},{"id":"rw8571192","title":"Slow burn.","starRating":"2/10","datePosted":"27 September 2022","text":"I apologize in advance to anyone that truly loved this series. I just could not, COULD NOT, get into it! I was already bored in episode one, and I kept going hoping maybe... just maybe it'd pick up. I've watched the entire show now and it never picked up. The acting is spot on! The actors and actresses here are definitely not to blame for this show being boring to me. It's just, a lot of scenes (heck, episodes for that matter) could've been cut down, or left out altogether. The entire show, in my opinion, could've been made into a two maybe three-hour special and it still would've gotten the message across about Dahmer."},{"id":"rw8571231","title":"Unnecessarily long","starRating":"5/10","datePosted":"27 September 2022","text":"If you already know the story and details about Jeff Dahmer this series might bore you. A few hour long youtube documentaries can pretty much cover everything. Their idea to bounce off different timelines from childhood, adulthood, victims etc and vice versa reminded me of Marvel's Eternals ... the trend of applying too many flashbacks and fast forwards is a terrible story telling method.His childhood and family history is interesting though together with the rest of the grieving victims, should be good for about 5-6 episodes... the rest of the series are just unnecessary fluff ... they keep on going back to the victims and eyewitnesses even after we already established their part in the story. And by adding more stuff it feels kinda low-key glorifying the serial killer.Not sure about the accuracy of this series, I'm sure the directors/writers applied many forms of artistic license to add more drama."},{"id":"rw8571535","title":"Best serial killer show I ever saw","starRating":"10/10","datePosted":"27 September 2022","text":"There's anything like this show when the topic is Serial Killer biography.The acting, story telling, everything is just perfect.Evan Peters just hit the maximum level of acting. You feeling that you're inside the scenes, living each moment e suffering with the victims.We can't forget to talk about others players in the field, like Richard Jenkings acting as Jeffrey father, Niecy Nash as Jeffrey neighbour and every 'victim' of this monster: believe me, they look really scared when the death moment comes.Anyway, just WATCH and enjoy this stunning show. Thank you Netflix! And don't stop doing shows like this."},{"id":"rw8571553","title":"A monster's story... For Kids","starRating":"6/10","datePosted":"27 September 2022","text":"First things first: Evan Peters is great. Which isn't surprising, especially for those who watched American Horror Story. He deserves an award for this interpretation of Dahmer, as far as I'm concerned.But everything else is just... Boring. It's not supposed to be gore or visceral, but Netflix's approach is a little bit too soft for this kind of story. Not only that, it lacks historical accuracy. By \"saving\" viewers from certain details of Dahmer's crimes, people who didn't know the story beforehand might still be unaware of the full extent of his madness, by the end of this series, and yes, that fact contributes to the feeling of empathy that many of the viewers might develop for him, throughout the story.I'm being purposely vague, so I don't spoil anything, but in the end, I'm very disappointed, the 6 out of 10 is just because I loved E. P's performance, nothing else."},{"id":"rw8571681","title":"Good job Netflix. More of this!","starRating":"9/10","datePosted":"27 September 2022","text":"This show is great. It's so disturbing that I can't stop thinking it about it in my free time, which means it was done right. If Netflix keeps on pumping out quality shows of this caliber, they won't have to worry about all of the competitors (who copied their model) taking them down. Long live Netflix!I can't understand why the critics aren't on board with this show either. It just comes to show you how out of touch they are with the audience-ya know, the ones who matter. The ones who actually consume the show and give Netflix money.Watch the show and ignore the critics. These are the same people who gave She-Hulk incredible reviews while giving this masterpiece of a show a rubbish rating."},{"id":"rw8571727","title":"Evan Peters Does a Phenomenal Job As Dahmer","starRating":"8/10","datePosted":"27 September 2022","text":"This is a tale of two cities in many regards. It is a grisly, detailed account of the life and killings of Jeffrey Dahmer. Dahmer is one of the most notorious serial killers of the 20th Century. His capture, his killings, his trial, and death are pretty public so this account does a great job at reacting this aspects, but takes the viewer deeper and further. The downside is, perhaps, it is much longer than it needs to be. 10 episodes could have been reduced to 6, easily, and it would have been better. There is no question Evan Peters' performance is nothing short of brilliant. He embodies the almost catatonic and conscienceless of the man himself in his performance. Niecy Nash and Richard Jenkins are very compelling in this. With Ryan Murphy at the helm you know this is filled with graphic sexual perversion and violence, but it does feed the story. The Direction, supporting cast's acting, and cinematography are very good. The story pays great attention to details, especially of the time period. As always music is vital to Murphy's story."},{"id":"rw8571744","title":"Only a 4 for Peters","starRating":"4/10","datePosted":"27 September 2022","text":"I only could get to EP3 but the question is...why?Why did this need to be made? Look, I love true crime and I get the entertainment in indulging in something like this, but considering other reviews I've read and what I saw so far, why even make something like this when it's not 100% accurate to the story and it's basically like you're glamorizing him? Do we really need to sit and watch 10 hours of this horrible individual? Having the families re-live this trauma? Which apparently the victims families weren't even notified of this series being created. Sad and gross.All that to make a buck tho, huh?"},{"id":"rw8571755","title":"Outstanding acting","starRating":"10/10","datePosted":"27 September 2022","text":"Whatever the wrongs and rights about this film being put out there .It's a compelling watch and incredibly well acted .From start to finish, it tells the true story of a madman .Surely one of the most vile men ever to have been born and left to commit his reign of terror .Thankfully some kind of justice was served on him in jail .Electric chair or something more inhuman would have been more fitting for this monster .The heinous crimes did happen though and deserves to be told in my opinion .And a story like this,is only valid if it's told with accuracy .For example \" Once in a lifetime in Hollywood \" is just a silly film for me and makes a mockery of the Tate killings .This sticks to much of what happened and that's what makes it compelling viewing."},{"id":"rw8571791","title":"Chilling and emotional","starRating":"10/10","datePosted":"27 September 2022","text":"Evan Peters plays the notorious serial killer unbelievably well.This series is not only chilling and shocking but also makes you feel extreme emotions for Jeffreys victims.I felt extremely emotional just having a glimpse into how all the victims and family's must have felt as a result of this monstrous crime. This series also allows you to build a relationship with Dahmers parents. Especially his father Lionel who obviously loved his son unconditionally and feels maximal guilt for the way his son has turned out. Honestly one of the best series I have watched! If you're interested in true crime this is a must watch !"},{"id":"rw8571941","title":"per usual","starRating":"4/10","datePosted":"27 September 2022","text":"Take a monster story (that EVERYBODY already knows) and make all the white people bad and all people of color either righteous or victims...wash rinse repeat Netflix. One of the best scary scenes when Dahmer went next door to try and intimidate his neighbor with a sandwich never happened as that woman was NOT his neighbor...Make sure ALL the cops are either incompetent, evil or both...Make another murderer (the black inmate that that kills Dahmer) into a tortured soul of righteousness and religiosity (and who, snarf...DID NOT KNOW who Jeffrey Dahmer was) instead of the insane killer he was and you get a sense of how this series plays out. Watch true crime docs on Dahmer if you want the truth.The acting is good, Dahmer played like he appeared in newsreels as was his Dad."},{"id":"rw8571948","title":"Doesn't get any better than this for a docudrama","starRating":"10/10","datePosted":"27 September 2022","text":"I'll start out saying I've researched / followed this case, and updates, for several years due to its complexities that impacte so many people...and wow, I was surprised by how it affected me.First off, the casting was brilliant and coupled with amazing writing its a disturbing gem that conveys how dark a person's mind can become over several years. It begs the question is it \"nature vs nurture\"? I don't think there will be a definitive answer but at least this gives a perspective for all the victims, living or deceased, and the damage left in the aftermath.It's a heartbreaking story that highlights horrific and deplorable behavior exacted by people who should be trusted.Whether it's parents, friends or the judicial system so many times those individuals failed to listen and accept it at for what it clearly was. A disturbed predator taking advantage of the situation simply because he could.I don't get overly emotional watching or listening to documentaries but this one had me bawling from E6 till the end.A hard watch but so worth it."},{"id":"rw8572003","title":"Pretty soft for the genre","starRating":"6/10","datePosted":"27 September 2022","text":"If one makes a lengthy series about Jeffrey Dahmer, one of the most infamous and sick -he was necrophile, cannibal and relentless - person in the world, a raw and more intense approach would have sufficed. An Ari Aster or Gus Van Sant type of rawness and realness could have been much better. There were very few intimacy, always in shorts, while in reality as we know, that was not the case that they remained in clothes for a long time.Richard Jenkins is amazing as the father as he has been ever since Six feet under.I really do not get when there is such a compelling real life story as is, why the unnecessary changes. Kinda expected way more, got a huge potential."},{"id":"rw8572086","title":"Dahmer to the last level of horror","starRating":"9/10","datePosted":"27 September 2022","text":"Impressive series, which not only seeks to portray how a human being becomes a monster, but how the ineptitude and racism of the police allowed Dahmer to continue committing aberrant crimes. It's full of messages about family relationships and is grotesquely disgusting at times. It is understandable why Netflix did not promote it, those who like the genre will arrive on their own to this brutual piece. You can't empathize with the character when Netflix blows your mind with Jeffrey's atrocities, so you quickly get out of there. Dahmer manages to reach the last level of horror, disgusto. Brutal."},{"id":"rw8572139","title":"Netflix has no reason making this mess","starRating":"3/10","datePosted":"27 September 2022","text":"Directing ,styling cinematography all on point ,but we're not gonna sit here and act like telling this story (the way Netflix ended up with anyways) was anywhere near ethical nor right ..this was disrespectful ,to the victims ,families ,and dare I say ,to the audience as well.Netflix wanted to make a show to get us to try and understand why he was the way he was ,but in the same breath wanted us to sympathize with him ,F Netflix, and everyone involved in this.All that being said ,6 ep wrecked my heart ,his victim in this one was handicapped, he didn't deserve this ,I hope his soul is resting well!"},{"id":"rw8572160","title":"Slow and inaccurate","starRating":"6/10","datePosted":"27 September 2022","text":"Evan Peters was fantastic, but the story was slow and was full or inaccuracies. It was watchable, and some of the scenes accurately portrayed, but just not what I was expecting knowing the case quite well.The real story is much more sister, but I guess they could not really portray all of the details.The casting was great and the settings great, but I think it would have done the victims more justice if they had all had a mention so to speak. And maybe use of more of the information from his interviews would have been an added aspect.I'm not sure why deviations from the facts were included, perhaps for storytelling, but overall I was quite disappointed."},{"id":"rw8572237","title":"It's disturbing but its quite a good one","starRating":"9/10","datePosted":"27 September 2022","text":"This is quite disturbing series considering how shock scared out of words i was seeing this whole series.Its sad people had to face such henious things its well explained that how can we stop such thinking or how can we get alarmed if anything is happening suspicious around us coming to the series excellent work done by peter from direction to acting to creating that kind of shivering in the audience is remarkable\nPls do watch but dont take any negative serial killing aspect from this\nI would say all the characters dis their job quite well\nLastly god do forgives but sometimes take vengeance too\nDo watch out on your actions!!"},{"id":"rw8572241","title":"Disappointment","starRating":"4/10","datePosted":"27 September 2022","text":"I like the genre. I watch series of this type. So i was really looking forward to this one bcs it got generally great reviews. Already after first part i could not believe it has so high ratings. Actor is good - of course. But it is so extremely slow-paced and one part is in fact not showing a lot. The point of series could be good - to show people how the police behaved, or what was his parents like, or the perspective of victims etc... but this was so boring! It seems it took me ages to finish this series. In fact it was one week. Real disappointment for me. I recommend to read more details on internet for those who are interested in Dahmers life. Much better with more information."},{"id":"rw8572311","title":"Hard watch","starRating":"","datePosted":"27 September 2022","text":"Evan Peters was very creepy, his coldness was thrilling. The show is taxing to watch so I can't imagine how it was for Peters. I think they did a great job of making it hard to watch.It works very well as a documentary, it was captivating I especially liked how they characterized the people, the Dahmer's are complete losers and the victims and their family were respectfully portrayed. Glenda was great, she was a relatable personality, she was needed to ease the watch.The police plotline was very frustrating because it's just like the real life. Policeman can be very incompetent and not be held accountable.The show is very slow paced, it works for most of the show but some part felt useless. Showing Jeffrey's childhood at school wasn't needed, the very end and many more moments could've been edited out. I believe the show could've been a hour shorter.The amount of time jump was too high, it made the story a bit confusing."},{"id":"rw8572585","title":"So gross and creepy but you cannot look away","starRating":"10/10","datePosted":"27 September 2022","text":"Anything Dahmer-related conjures feelings of horror, shock, repulsion. The less you think about it, the better it is for your well-being. I am one of many who roll their eyes with a big sigh, \"Why another TV show on this subject? No one needs to see that!\" And then I learn that this new series is another creation of Ryan Murphy starring Evan Peters. Immediately my interest is piqued as I am a huge fan of both. I decide to watch the show for Murphy and Peters' talents, not for partaking in the glorification of a non-fiction deranged cannibal.\"Dahmer - Monster\" is so well-made that you can smell the stench oozing off the screen. The pace is purposely slow to instill dread in you as if you are one of the victims, and it is highly effective at that. Props go to the production team (especially the writers, directors, editors) for creating such an eerie ambience. And the top kudos goes to Evan Peters himself. His portrayal is what makes this series. I expect him to be good, but not this good. It is quite mind-blowing. On par with Peters' esteemed acting performance is Richard Jenkins' depiction of the father. Jenkins is the perfect casting choice. Every awkward and uncomfortable nuance is spot on yet unpredictable. It is as if you are watching Jenkins' genuine discomfort about the show, period.While the first half of the series showcases the creators' knack for turning gross and creepy into something that you cannot look away from, the second half delves into the educational, which offers some redeeming value and justification for developing this series. We learn and remember the names of the victims. We feel the pain of the families. And we learn that being a serial killer is not a white thing (as 82% of American serial killers are white), but rather that brown or black would-be serial killers typically are not afforded the chance to serial-kill as they would just get caught!"},{"id":"rw8572789","title":"Honestly scary?","starRating":"9/10","datePosted":"28 September 2022","text":"This film made me feel a \"suspense\" pressure every second for the first time watching a movie. It was as if each episode a catastrophic event was going to happen. But, despite this, it's a wonderful work.Something that has caught my attention is that... I cried in the end. I felt sad to see what happened, as if it were someone close to me. That feeling... frightening.But it gets worse, it's similar to how this film \"A dangerous method\" portrayed Keira Knightley as she makes introspection of the past and finds memories that causes her \"hysteria.\" Wow, it did remind me of things similar to how the father described himself when he was young.A very strong emotional feeling.Anyways, brilliant."},{"id":"rw8572821","title":"Incredible","starRating":"10/10","datePosted":"28 September 2022","text":"This is one of my favourite netflix series I think I've ever watched. Absolutely incredible, with phenomenal acting! I watched the entire series back to back.It's played out quite similarly to the Assassination of Gianni Versace, (Andrew Cunanan) which I'm also a huge fan of. However, this series is far more compelling, accurate, intricate and unique to anything I've ever seen in relation to a serial killer.I actually found myself becoming quite emotional and empathic throughout; toward both victim and perpetrator. This situation was seemingly inevitable. And I believe that it was a combination of both nature and nurture.And to see that both Gregg Araki (one of my favourite directors) and Jennifer Lynch directed some the episodes! Amazing work."}]
