[{"id":"rw8577646","title":"Exciting Thriller!","starRating":"8/10","datePosted":"30 September 2022","text":"You was so much better than I thought it was going to be. I know it's been hyped up ever since the first season and has gotten good ratings and reviews from nearly everyone but I still didn't think I was going to like it. I was made to watch the first season and loved it. After that I binged the rest of the seasons on my own in record time. I'm not saying it's my favorite show or even close to that but it's one of the most surprising shows I've seen. It was originally suppose to be a miniseries but is such a popular show they keep renewing it. Season 4 drops early 2023. Penn Badgley does such a great job with this character, he's very believable in being a lovable psychopath."},{"id":"rw7839134","title":"Better than expected!","starRating":"8/10","datePosted":"6 February 2022","text":"You is every bit as good as people have said it is and is pretty addicting once you start it. I've been putting off watching this since it first came out but finally found the time and now I'm mad I waited so long. For some reason I thought this was a show who's key demo was women. I was wrong. The thing that surprised me the most was how much humor is in it. It made me laugh a life more than I expected. Now, people saying that this isn't as good as Dexter are absolutely right (not much is), it isn't, but it definitely holds up on its own and thought it was overall a pretty good show. Penn Badgley does a fantastic job as the lead and Elizabeth Lail and Victoria Pedretti are both great in their roles as well. Now that I started it I can't wait for more seasons to come!"},{"id":"rw4677330","title":"\"Should I?\" or \"Shouldn't I?\"","starRating":"8/10","datePosted":"21 February 2019","text":"This is a \"Should I?\" or \"Should I not?\" kind of a series. From the pilot, we know the protagonist is definitely sociopathic, maybe even psychopathic. Is this an anti-hero we can get behind? But, there is just something about it that makes you want to watch one more episode... and then you find the first season is over! This is well written, well performed, addictive and, well, disturbing. I give the series an 8 (addictive) out of 10. {Dramatic Crime Thriller}"},{"id":"rw4593476","title":"What would you do for love?","starRating":"8/10","datePosted":"19 January 2019","text":"The Lifetime series, adapted from Caroline Kepnes's book of the same name, came to Netflix on November 26 and was liked by the users. The series attracted my attention thanks to Netflix. I started watching the series without much anticipation. It was very immersive and fluent. The monologues were fine. It's nice to be told the events through Joe's eyes. I think that's what keeps the series going.The series tells the story of an obsessed perverted man falling in love with a woman. When Joe first sees Beck in the bookstore, he falls in love. We are going to see Joe's interaction with Beck, which starts with a book offering, and turns into a relationship. Joe proceeds to stalk Beck on every available social media site, quickly determining that she's the one for him. In the process, Joe is doing some amazing things. He's watching Beck's house, following every step. He goes into her house and steals her stuff, her clothes and her phone. He kills her lover, researching her friends. In doing so, he remains so calm that everything he does looks normal to the viewer. You realize you're wrong, but you don't hate Joe. Joe's problem is actually his background. His past experiences make him obsessed. Both Joe and Beck are two problematic people. \"How is the relationship between two problematic people?\" We find the answer to this question. Although it isn't true, Joe is doing everything for the woman he loves, Beck doing it for herself. You decide who's worse. Despite the bloody appearance, the series is not horrifying.I found acting performances in the series successful. The soundtracks of the series was good. Colors, sounds, frames - everything works correctly on the atmosphere. Although it is simple as subject, its immersiveness increases the traceability. If you don't watch with too much expectation, I think you'll have a good time.The series has a lot to say about our society's addiction to social media, and the dissonance between the curated images we project of ourselves online and our authentic selves. While You offers some suspense, it also offers a distorted way of looking at Joe's criminal behavior. This series is well worth watching and will make you think about your social media account. 8/10"},{"id":"rw5397937","title":"A surprisingly really good Thriller","starRating":"8/10","datePosted":"11 January 2020","text":"The synopsis and description does not do this show justice. I was captured by its darkness and intrigue from the start. So many reasons why this show worked well. In a bizarre and strange way the viewer can relate to Joe and his frustrations. We also see things from his point of view. Goes without saying his actions and behaviour is despicable but a crazy realisation is that Joe is in all of us. We all stalk other people's social media accounts behind the scenes. The only difference is Joe is prepared to go full throttle and act on his sociopathic tendencies. This is why he is such a fascinating character.Season 1 and Beck. Season 1 does a great job of showing how flawed, selfish and messed up the modern young girl can be. Benji despite being a flawed person himself understood what she really was and shared this truth with Joe. Joe was blinded by infatuation and his idea of the perfect soulmate. He was even willing to overlook her cheating because she 'loved' him. Nobody deserves to die but I didn't care much for Beck and did not miss her at all.Season 2 and Love. We saw a damaged and broken girl who was much better match for Joe (Will). A great season that sadly had its fair share of disaster because lets face it Joe attracts it like honey. Love totally surprised us.I don't see why they didn't end the show after season 2. It should be a mini-series. Season 1 and 2 flowed well and made sense but how to go on after this? Joe seems to have found a similar person that is as peculiar as him. Yes he can continue his usual habits with a new girl but it could have ended like that. He's not on the run anymore. Alas I will keenly watch season 3 when it comes out."},{"id":"rw8288366","title":"great series apart from some careless moves","starRating":"8/10","datePosted":"30 June 2022","text":"Great series, reminding me of the iconic \"Dexter\".Acting is top notch, specially from Penn Badgley, completely unknown to me, but capable of portraying the complex, lethal and sensitive character of Joe.Victoria Pedretti on seasons 2 and 3 was just perfect. Quite a rollercoaster of great acting here.All 3 seasons delivered, with enough twists and last episode chaotic situations, that left me thinking \"how the hell he's he going to come out of this\" on the last episodes.I was very sceptic at first, specially due to some avoidable and quite dumb out of place pseudo-erotic mb scenes, but I kept the faith and was not disappointed.Strong points: the twists, chaotic situations, unpredictable moves and pace, all with wonderful acting through and through.Weaker points: imbecile erotic out of place moments (thankfully not many), terrible soundtrack that does not amaze or stay in the head (sorry) and dumb moves from Joe (and not only): not using gloves, using the same hat to hide himself (ala Clark Kent with his eyeglasses) and less attention to detail when we know he could be caught by doing the same mistakes over and over again.But... it's a great series nonetheless. If you loved \"Dexter\", it's not on par, but delivers, in a more \"modern\", less careful way and sometimes even a bit more chaotic in the situations where Joe puts himself on.Season 1 great, Season 2 good, Season 3 great again (don't understand the hate, really)."},{"id":"rw5366647","title":"Season 2 lifted up the series!","starRating":"9/10","datePosted":"30 December 2019","text":"First of all, loads of congratulations to Penn Badgely's superior and creepy acting as the enigmatic and psycho lead character bearing dark secrets of his past leading to the dangerous person he is shown in the present in the show.\nHe was perfectly cast, catapulted the whole series upward and is an actor full of specific talents as fans remember him well in Gossip Girl.That being said, the difference and superiority of season 2 over the first one, IMO, was the casting and presence of Victoria Pedretti who shone and almost singlehandedly lifted the season 2 all by herself.\nShe deserves nomination after nomination and ultimately awards as does Penn Badgely as the lead actors, together with various nominations for the show itself starting at the prestigious Emmy 2020.On a side note, please don't forget and underestimate the performances of Elizabeth Lail and Shay Mitchell in season 1, who very brightly acted and are among the reasons, which makes this show unique.\"You\" will stand the test of time due to its freshness, subject, superior acting and unique approach, very well fed by the suspenseful novel by Caroline Kepnes.Highly recommended series to watch, enjoy and ponder upon as most reviews and ratings do it justice."},{"id":"rw7468759","title":"3 is irritating","starRating":"6/10","datePosted":"22 October 2021","text":"Season 1 and 2 were fantastic. I'd say it's like 9/10 for those but the 3rd season was just so irritating. Like Joe wants to find someone who will accept everything that he is and Love is LITERALLY made for him, but he's pissed because she kills too?! Like wtf you do the same thing man! How can he be so hypocritical?!"},{"id":"rw4537238","title":"What exactly is this?","starRating":"10/10","datePosted":"27 December 2018","text":"It's perverted in so many ways. You find this poor, lost female student struggling to find her way through life. She's not doing well and she doesn't have any trustworthy person she can lean on or ask for help.Then she meets a charming, intellectual and well mannered guy, who makes her life better in every aspect. Ohh yeah, he also murders every parasite in her life.Here's where it gets perverted. You find yourself puzzled because you won't be able to determine, if you root against her sicko knight in shining armor or hope he gets away with more than he deserves.It's intense and there's never a dull moment. I loved every part. I only have 10 minutes left, which I'm going to watch now :)"},{"id":"rw4394329","title":"Made for Penn Badgley","starRating":"10/10","datePosted":"13 October 2018","text":"I love this! It's dark but yet sexy at the same time. Penn does an amazing job narrating and he makes creepy seem alluring. I can't think of any other actor who'd do a better job."},{"id":"rw8865404","title":"Struggling through season 4","starRating":"7/10","datePosted":"11 February 2023","text":"Seasons one and two were an 8. Season three was a 7. Being generous, season four is a 5. This is another one of those Netflix shows that they stretched out and tried to get an additional season when they should've let it go on a high note. The whole dynamics and pace of the show has changed in this season. Instead of being about a serial killer, the serial killer has become an armchair detective, trying to figure out who is trying to frame him for a murder, and also knows about his past. This season has a bunch of pretty people , all narcissists and almost has a comedic feel to it. If I were you, I'd watch the first three seasons, and leave it at that."},{"id":"rw7472236","title":"Two Seasons would have been Great!","starRating":"4/10","datePosted":"23 October 2021","text":"The finality to Season Two felt like a great open-ended conclusion to a series. But alas, Netflix will inevitably continue to Netflix.But instead with Season Three, let's continue the fixation people have with psychopathic characters and degrade any goodwill conjured up by the first two seasons. I mean stalking people in recognisable cars while wearing a baseball cap while having a child strapped to your chest, seems redundant. No? Not to mention a murdering psychopaths are framed in a better light than some who has a gathering during COVID. Oh great like we need another reminder of the pandemic.I've attempted to persevere past the first episode of the third season, but I'm struggling to find anything redeemable about this series."},{"id":"rw8865764","title":"Having a hard time to finish the first part season 4","starRating":"3/10","datePosted":"11 February 2023","text":"Penn does a great performance as always, a joy to watch him. And I liked that they went with a different direction in season 4, so far because only the first 5 episodes has come out. I had a hard time tough getting trough the episodes tough, the narcissistic friend group are suddenly just there and Jonathan (Joe) becomes a quick 'friend' that gets to go away with them on a weekend. It all just seems a bit hasty and therefor unbelievable for me. It just didn't has that same wow factor it had the first three seasons. Also the first seasons were more relationship focused and they took the time to develop it, this time it's more rushed and flat, also lacking a little in the intimacy scenes and I find it hard to believe something is there when everything is more platonic and flat. Really had to push myself to watch trough the end of episode 5 that maybe it reveals something to keep me watching, but no there wasn't a big cliffhanger and I do not care for any of the characters so I'll just keep the first 3 seasons in mind and leave it at that."},{"id":"rw4332775","title":"Oddly Uncomfortable","starRating":"8/10","datePosted":"11 September 2018","text":"I watched this without expectation. I hadn't heard of the book. I hadn't seen any previews or descriptions. What i found was a pleasantly dark show. It's uncomfortable and unpredictable and has what is hopefully an amazing story to tell from a unique perspective.We're put into the head of a stalker who seems to be a hair's width away from violence. The tension is held well.But what REALLY made it feel uncomfortable for me was a rather odd choice from the network. Swearing is censored out. There are these conspicuous blanks in the dialogue. It had me obsessing. When you've got a show this dark, who the hell do they think they're going to offend with a little swearing? Are they expecting kids to be up watching it? It's content is far more offensive than swearing could ever be.Apart from that one VERY annoying point, it's a brilliantly put together show. I'm looking forward to watching more (though I'll probably find myself swearing at the TV about the missing dialogue)."},{"id":"rw7071161","title":"FIRST SEASON THOUGHTS.","starRating":"8/10","datePosted":"28 June 2021","text":"I really enjoyed this. I'm not going to criticize any technical points, because it was really crafted well. However, I will criticize how I felt about the characters. While it is universally accepted that Joe is a homicidal psychopath... Beck wasn't a good person here. I don't put any character on the same level of evil as Joe, but I didn't feel anything for the people he killed. They were all unsympathetic. Maybe that was the intent..."},{"id":"rw8878492","title":"Oof... The reviews aren't wrong.","starRating":"5/10","datePosted":"18 February 2023","text":"I absolutely loved the first 3 seasons of this show. Season 3 especially was really well done. So when I saw all of the reviews saying season 4 was bad...I brushed it off. But oh my god. Those reviews aren't wrong. Season 4 is so bad. I can't get through episode 5. The dialogue is terrrrrible. The whole plot is silly and uninteresting. Someone called it far fetched and I laughed, considering the entire premise of the show. But it really is far fetched. The characters are so over the top and annoying. Everyone doesn't have to be likable but you still need to create characters that people actually want to watch but they missed the mark. Watch the first 3 seasons. They really are great. Skip this one."},{"id":"rw8917166","title":"YOU SS4 Part 2, twisting corners, telling new stories but ends up destroying the whole story","starRating":"3/10","datePosted":"10 March 2023","text":"Review of YOU SS4 Part 2, twisting corners, telling new stories but ends up destroying the whole storyYOU, part 2 that twists and tells a new story, different from the first part, like a different movie. But it's a twist that takes the direction of the story well laid out. At first, all of a sudden it collapsed from episode 7. The story was very random and sloppy. Plus protracted with the same stories in many episodes. In addition, they are also trying to tie a new knot to continue SS5, but say that when the script takes the direction of the story down like this, it shouldn't be followed together anymore. This should be the end of the last series that I ask Netflix to not do it again."},{"id":"rw7461133","title":"Lost its spark","starRating":"1/10","datePosted":"19 October 2021","text":"First season was intriguing, surprising and kept\nYou wanting more. There was a real story being told with a background to match. Second season was also great with lots of twists and turns and further developments in the story.The third season however is a big let down. It feels like they didnt know how to continue the story so just turned it into watching 2 psychopaths randomly kill people and then try to cover it up. The voiceover was also tiring by this point and all the weird sex stuff was just typical pointless nonsense to try to make a dieing series more appealing but it just came off as tawdry and boring."},{"id":"rw7460753","title":"Season 3 disappoints","starRating":"5/10","datePosted":"19 October 2021","text":"Both the leading characters are so confused in this season. They don't want their spouses to be have affair but themselves have affairs. Love and Joe both are have affairs. They kill so many people but it's easy for them to escape Police. And as ususal when someone finds out the truth about Joe and love, they are captured. The ending didn't had any logic. Police just ignored missing body just like that? Who commits suicide by injecting poison on legs?"},{"id":"rw7455726","title":"Totally ruined by Season 3","starRating":"9/10","datePosted":"18 October 2021","text":"Why did they have to go ahead and make a third season? The \"crime and punishment\" ending in season 2 was just fine. Why did they have to turn Love into a bloodthirsty beast who doesn't stop for a single second to think about the consequences of her actions? I understand it's all part of the \"psychopath\" agenda they were trying to sell, but most of her actions were utterly unjustified and uncalled for even if we take her being a psychopath into account. Also, did she have to go and have an affair with a teenager? And don't even get me started on the ending. Joe gets away with it. AGAIN. I guess that should've been predictable given that they were trying to paint him as the \"better guy\" in that preposterous relationship they had.I honestly was a huge fan of seasons 1 and 2, but I'm very disappointed and I wish this season was never made. That's just embarrassing.Update:\nSeason 4 was a WIN. I changed back my rating to 9. I'm glad they made another season because it totally saved the show!!"},{"id":"rw7456794","title":"to hate YOU is to LOVE it","starRating":"9/10","datePosted":"18 October 2021","text":"YOU - Outstanding (A)I always try to judge the show on it's source material and story they are trying tell it's audience. A show about psychopath is not something new, recently Dexter successfully captured everyone's eye with some brilliant seasons and performances. What makes YOU so different from shows before is it's social commentary to our generation. Even in the first season usually the girl is portrayed as damsel in distress, a naive rom-com heroin qualities to it but here Guinevere Beck was flawed, troubled like many of us in today's times. Noone is perfect and the show judges its audiences too if they root for the psychopath.This is one of the very few shows, which changes it's setup adds new cast and all three seasons can stand on their own thanks to brilliant performances from the Leads from Penn Badgley, Elizabeth Lail and Victoria Pedretti.I had great time watching all three season, and will always recommend to people looking for something refreshing, bold and throughly entertaining. Sometimes we need to judge a show for it's entertainment level, not every show has to win Emmy one day."},{"id":"rw7450716","title":"Season 3 is an absolute bore","starRating":"1/10","datePosted":"17 October 2021","text":"Season 3 is so bad I actually fell asleep into the 3rd episode. It doesn't have the same kick 1 and 2 had. I waited for ages for season 3 for nothing. Definitely skip."},{"id":"rw7475671","title":"Season 3 is just ridiculous","starRating":"1/10","datePosted":"24 October 2021","text":"I thoroughly enjoyed seasons 1&2 but 3 well that's a bit of a train wreck as far as I'm concerned. The getting married was a very bad idea. I just found it boring."},{"id":"rw8954624","title":"Used to love it","starRating":"7/10","datePosted":"27 March 2023","text":"First 3 seasons were amazing. I loved it. S4 is just so boring. I really want to like it but all the characters are so unlikeable and the storyline is awful. Kate as the love interest?? . I just didn't get it. To go from the other women he was obsessed with to her makes no sense what so ever!. She had no redeeming qualities at all and had the personality of a mop.Im Only on episode 6 and and would really love to finish what I started but I find myself drifting off or looking at my Phone and that's when I know it's lost on me.I hope there is a s5 and it's back in the USA and has more interesting characters because this is utter gash!."},{"id":"rw7451213","title":"Pointless.","starRating":"5/10","datePosted":"17 October 2021","text":"The first two seasons were very good. I don't know what happened with this season. I'm not a fan of Love in this one, she's annoying and childish. I wish Natalie could have more episodes. For them to end season 2 with a mysterious lady she sure didn't have many episodes. I'm very disappointed, I hope this is the last season. It's just the same thing repeating over and over. Some series aren't meant for sequels."},{"id":"rw7876711","title":"Season 3 Dumb and Dumber","starRating":"4/10","datePosted":"18 February 2022","text":"Season one was entertaining and almost believable. \"Season 2 was bordering on 'oh come on territory'. But 3 is just garbage. The couple end up killing or attempting to kill more people than a half decent serial killer and the storylines get more and more ludicrous. And yet half way through the ten episodes it remarkably gets totally boring. It does pick up a bit in the final twenty minutes but by then it had gone from the realms of far fetched to totally ludicrous. They are now advertising a season 4 but that i will definitely body swerve."},{"id":"rw8945648","title":"Season 4 is a Bust","starRating":"7/10","datePosted":"23 March 2023","text":"The first two seasons of this show are strong. Season 3 is up and down. Season 4 is almost ridiculous. The problem with this shows is that it takes the story sideways to extend its natural length. Season one and two are fresh and interesting. From then on, you can almost see the writers scratching out ideas and crossing them out to make the show live on. By season 4, the show is a parody of itself, recycling plot points, going into soap opera territory. Terribly disappointing by the end. It's really hard to stop watching a show after you've invested so much time into it. Naturally, you want to see how it ends. This show ended long before it died a dismal death."},{"id":"rw7446348","title":"Third season is rubbish.","starRating":"3/10","datePosted":"16 October 2021","text":"The first season was great, couldn't stop watching. But in the third...Netflix is desperately pushing their political agenda. Pathetic. Why to ruin a perfectly good series by constantly having a go on people with different views?! I stopped watching at episode 3. Do they think the viewers have really so low IQ?"},{"id":"rw5358475","title":"Second season couldn't get any better","starRating":"10/10","datePosted":"27 December 2019","text":"No spoilers here so I'll just discuss the concepts of this season. Love attracts and seeks the same type of love. We always think that our actions are justifiable because they're \"out of love\" but when someone does the same things back for us, we can finally see what is wrong with us. The female characters of this season are so powerful. We have more access to Joe's psyche. I watched this season in one day. I wouldn't have it any other way. Just WOW."},{"id":"rw8880253","title":"A fall from grace - Season 4","starRating":"1/10","datePosted":"19 February 2023","text":"Firstly seasons 1-3 I loved, especially when Love Quinn was in it - score at the time was 9/10. BUT, season 4 is dreadful. The characters are weak, Joe has basically become pathetic and the leading role opposite (Karen) is dreadful (although she was good in Ghosts). The plot struggles to settle, with very little cohesion and awkward moments where the writers tried to tie things off in a bow for the hard of thinking. Characters are introduced that are a waste of time, adding no more value than a piece of furniture. Location wise Royal Holloway looks fantastic as ever, but the location is totally wasted as we shift between there, Joe's London flat and the a country retreat - the whole point of Joe's new life as a Uni Lecturer is pointless and only allows Joe to meet Nadia (a rather cliche troubled student character). The final episode in drop 1 of the season is farcical- for instance it sees Joe pushed out of a 2nd floor window, landing on is back in a shallow bush, yet moments later he is up an moving around freely. The pointless basement scene where the 'oh no I never guessed it was them (yawn)' killer has Joe chained up with a character I can't even be bothered to talk about, is boring. Sadly drop 2 looks like Joe's quest to hunt down the real killer (yawn). Only saving grace is that Love Quinn looks to be back (probably only in one scene as Joe hallucinates). Have read some great twist theories online, one where Joe is actually still in the US drugged and held captive by Love and this whole season 4 is a dream (badly acted nightmare) - hoping that is true as the reality of what it actually is could see this rubbish being nothing more than an insult to the first 3 seasons. Tut tut writers - lazy."},{"id":"rw8743988","title":"Terrible 3rd season","starRating":"3/10","datePosted":"18 December 2022","text":"First two seasons were good. It was nice to find a show with hardly any PC crap involved. It was a decent show with a quirky, messed up premise that was addictive and served as a fun bit of escapism. Then season three happens...It was as if different writers took over for season 3 (maybe they did, I haven't checked?). It became super PC and really bland and dragged out: no excitement going on, no likeable characters - just a big pile of manure basically.They really should have thought of the phrase \"quality not quantity\" before they decided on another season.My advice? Watch the first two seasons and then stop."},{"id":"rw4556397","title":"Don't believe the ridiculously positive review","starRating":"6/10","datePosted":"2 January 2019","text":"You is a moderately decent show about a psychopath who will go to any length to win his girl over, and succeeds, but not without cost. For him, her, and everyone around them.The decent part is mainly about the acting and directing. The show has a creepy atmosphere and the lead actors and actresses are very convincing to a point where they even win the audience over and you might even temporarily care for them. You'll get a view inside a psychopath's acting, feeling and thinking and reasoning. This works for a few episodes, let's say 5 or 6.Unfortunately, after that, the show goes downhill. First of all, how the psychopath keeps getting away with non stop stalking is ridiculous. 2nd: him, his girl, as well as her girlfriends, get more annoying by the minute. Dialogue, actions, motivation become less and less credible, and become borderline stupidity. Characters become hollow, 2-dimensional and repetitive in their behavior.And to kill it off, in the end of the show, the stupidity is all that remains. Unless this is your first show ever, you may look in a constant state of surprise at how much stupidity two people can portray, just to keep a situation going on. This seems to hit various series that drag on after all originality has dried up."},{"id":"rw4554004","title":"Do you love him or hate him?","starRating":"10/10","datePosted":"1 January 2019","text":"This is probably one of the only shows that has made me feel confused as to whether I love or hate the main character Joe Goldberg. While he is a stalker, very creepy, and a murderer, he also has this charm about him that is just so alluring! It also gives me a bit of Dexter vibe, especially since you know everything he's thinking. Penn Badgely does such a great job at portraying Joe! It can have some very uncomfortable parts but I would recommend this show to anyone!"},{"id":"rw8880596","title":"Sleeping pill","starRating":"1/10","datePosted":"19 February 2023","text":"First season wasn't bad, with some forgivable annoyances. Then it started going downhill, with season 4 being the abominable rock bottom. The characters, millennial rich kids, are absolutely uninteresting and boring. There's no chemistry between Joe and anyone. The dialogues are either dull or cringe. I kept falling asleep - in fact that's what it's good for, works like a sleeping pill. I didn't see all of it because I slept so much and because some bits were so cringe I had to forward them. Really, really bad.The main reason I watched such a fair bit of season 4 was to justify my writing this review. Conclusion: it doesn't get better."},{"id":"rw8929192","title":"Weak and getting weaker","starRating":"4/10","datePosted":"15 March 2023","text":"First three seasons were weak but palatable. Fourth season was absolute BS. Totally unbelievable. Absolutely could not have happened. Don't waste any more time. Hopefully this over. Acting was mediocre at best throughout, not now writing has become hack level at best. I guess Greg Kinnear has hit rock bottom to take part in something written at this level. The show needs to be killed before any more characters are killed. Netflix is almost always hit or miss. More misses lately though. Starved for content I know, but needs a better effort than this. Should have really ended this after the originaliy written first two seasons based on the books."},{"id":"rw7478317","title":"I am the only one who hates this?","starRating":"1/10","datePosted":"24 October 2021","text":"Ok so the first season was good but they had to make more... second season was ok but the third one? OMG... cringe worthy, unbelieveble... why? Just end it please... How many more seasons are you going to make?"},{"id":"rw7478857","title":"Season 3 is a Waste of time","starRating":"2/10","datePosted":"25 October 2021","text":"Season 3 is a Waste of time! Don't watch this. They dropped the entire premise of this show to make a bloody nonsense of a season 3.Please avoid this for sure."},{"id":"rw5473993","title":"A little like Dexter, less predictable","starRating":"8/10","datePosted":"10 February 2020","text":"Anti-hero shows such as Dexter preceded You. I could compare Killing Eve as well, though there are less parallels than Dexter. In a way You is Dexter updated to a modern age (2020). However, I should be clear, many would find my comparisons silly, because You is about a man whom does anything, literally anything, for his love, whilst Dexter was about a psychopathic vigilante, and Killing Eve is about a flustered spy and a sexy assassin. You seems to be part of an increasingly worthy bevy of TV series coming from Netflix. It's a new idea and fresh, and highly watchable, both for lovers of modern romance and for lovers of psychological thrillers. Mind you, if your preference is toward the latter then bear in mind that although the first 3 episodes are solidly entertaining in that regard, after that there is a tendency for the love question to dominate over the next few episodes, returning back to full on thriller in the last two (I've only seen the first season). That's where it lost points for me. That's just me though, and for anyone else I could easily and definitely recommend You. Fantastic acting, realistic look at modern phones, and a subdued yet perfect modern soundtrack. Delicious modern entertainment."},{"id":"rw8940483","title":"Season 1 was great / Season 4 was disappointing","starRating":"5/10","datePosted":"20 March 2023","text":"Season 1 was great 8.5/10 👍 👍\nSeason 2 was good 7/10 👍\nSeason 3 was OK-ish 6/10\nSeason 4 is just weird and completely over the top. 3/10\nIt feels like a different show with crazy eccentric characters and some strange attempt to copy fight club.It honestly seems like the writers didn't know where to take the story so every episode was just them winging it and making things up as they filmed.Thats too bad because it had so much potential. Seriously disappointing.Joe was an interesting character when he has was just an ordinary looking guy with a twisted mind. In the recent episodes he is like a superhuman hit man capable of anything - it's just ridiculous."},{"id":"rw7469142","title":"Irresponsible","starRating":"1/10","datePosted":"22 October 2021","text":"It encourages political violence in the third season. Using popularity to encourage such things makes for replacing creativity with cheap shock value, poor writing and hate. This stuff shouldn't be released in public."},{"id":"rw8650648","title":"Can't stand shows like this.","starRating":"3/10","datePosted":"2 November 2022","text":"My wife and I tried watching a few episodes but we just can't get into it. The concept and setup is great and there are a ton of directions that they can take it.One of the biggest issue here is being over-reliant on shock value. Shock value needs a strong motive for it to work. Without it everything feels fake and forced and random.The biggest issue with the whole series overall, something many movies and shows rely, the excessive attempt at dumbing down everyone in the world to make the story work or to make the protagonist, or antagonist if you prefer, be perceived as a genius.Some form of dumbing down of characters is required because it's a movie but we're talking extremes here.The main guy in this show can literally stroll out in public, stab someone in the face, drag his body a mile, cut it up and dispose of it and no one will have seen, smell, or heard anything. No evidence. No dogs. Cameras pick up nothing. He'll just conveniently do what he wants and get away with it just because it's written that way.It's absurd."},{"id":"rw4414605","title":"Should Have Quit While They Were Ahead","starRating":"5/10","datePosted":"23 October 2018","text":"I wish they had made this a miniseries, instead of an ongoing series (it's been renewed for a second season already). As a miniseries, it would have had a satisfying beginning, middle, and end. As it is, it's just going to go on and on forever, with no resolution.It started off strong, and I enjoyed it, wondering where it was going to lead. Now I see it's not going to lead anywhere. The writers are just going to keep writing the same types of plots over and over again, teasing the viewer, but never giving viewers any resolution. That had already become evident to me, even before I saw it was renewed for at least one more season.I would guess my opinion is going to be in the minority here, but I don't care. I'm bored with the show already, especially knowing that the premise, which is a good one, is just going to be beat to death until it loses all originality. That has already become evident."},{"id":"rw7609030","title":"Season 3 has killed it.","starRating":"5/10","datePosted":"2 December 2021","text":"Season 1 and 2 were dark and interesting but season 3 is a slow and painfully dull. I truly believe they used different writers who had not watched the previous seasons. The main characters have become empty and without any real menace. Each episode meanders along much like the previous. It fails to grip you and keep you interested in both plot or character. In fact I couldn't find any high points in the whole 3rd series."},{"id":"rw8873621","title":"WTH happened to Season 4? HORRIBLE","starRating":"4/10","datePosted":"16 February 2023","text":"I really enjoyed season 1, season 2, and season 3 was decent. But season 4 is absolutely horrible. If I had wanted to watch a British series I would have started out watching a British series. Why switch it in the middle after 3 seasons of a non British series? Not to mention the accents are horrible, the British in this movie are horrible actors, their characters are horrible, and they take pride in insulting Americans over and over and over. The only reason I am still watching season 4 is because I do like Joe as an actor but I feel I need to get through it in case there's a season 5 I'll know what's going on. Whoever the creator was of season 4? You really messed up."},{"id":"rw5362597","title":"Season 2 is even stronger than the first one.","starRating":"9/10","datePosted":"28 December 2019","text":"Main characters were much more convincing than the ones in the first season. Thrilling again and hoping for a next season."},{"id":"rw8437336","title":"You: Not perfect, but not far off.","starRating":"7/10","datePosted":"12 August 2022","text":"You is a psychological drama that feels politically correct. It follows the life of a serial killer and ex bookkeeper \"Joe Goldberg\".Penn Badgley was casted as Joe which I think was a perfect casting decision. Badgley makes Joe seem Sinister and imperfect, which is exactly what makes the show so intriguing.The way the show alters by Joe's thoughts is what keeps it so raw, if it was narrated from a third person perspective, I think the show would be boring but since we are in the eyes of a serial killer, we gain interest in it.The show also has the correct amount of violence and narration. Action isn't always occurring, which is perfect due to suspense being key in a thriller like this.The writing is also formed in a way which makes you sometimes side with Joe, which is why Joe is such an important and interesting character.The show isn't perfect though, there's a lot of \"cheesy\" aspects to the show which make it seem unrealistic despite realism being the intention.The directors make Joe seem like the sane one throughout the seasons, which especially with his role, is not what should happen.A lot of the cast don't get as much air time as they deserve, which is a bummer since many of them are talented actors."},{"id":"rw8887018","title":"Is it me?","starRating":"1/10","datePosted":"22 February 2023","text":"This is the most vapid, boring, jaw dropping stupid show that I have ever been tortured with.Beck, even when she's not reciting lines, may be the worst bleached blonde actress. She does nail the shallow/ I think I'm a poet utter bore shtick. She must have some powerful parents in the buisness.Now let's get to the story, or lack thereof. More holes in this plot than a screen door.The dialogue is enough to make me want to swallow a bottle of lye.When is she getting killed off, along with her insufferable friends. And what part of New York is this? There is zero NY vibe going on. And why can't anyone smell the corpse in the unlikely rare book vault?I wish they could slip Dexter into the story. He'd know what to do about these inhuman characters...."},{"id":"rw8876214","title":"Spectacular first season, S2 is okay, S3 is woke garbage, S4 is a disaster","starRating":"5/10","datePosted":"17 February 2023","text":"S1 of \"You\" is adapted from \"hidden bodies\", a brilliant book that stands on its own two legs.It's perfectly put to the silver screen, and the acting is on point, the production value vastly sufficient and the tension is maintained throughout each arc.Watch it.S2 is good, but not fantastic, as they had to 'evolve' the story from the first book and back then the writers did a decent job at this.Feel free to watch that, too.S3 is basically woke garbage, written and filmed seemingly to upset as many people as possible. If you are in the slightest offended by the woke mind virus as Elon Musk once put it, avoid like the plague.Avoid like plague.S4 is mid-cycle, and the critics seem unanimous: it's not even woke anymore, it's just plain bad. There's no redemption to the Agatha Christiesque shift, which is actually turned meta because the writers at least had the decency to be self-aware they were plagiarizing themselves.Still, didn't stop them from turning a brilliant show into pure trash, regardless of your political views S4 is bad TV, poor acting, staging is lame and feels like a bad copy of the Bridget Jones Diaries.Another TV series bites the dust."},{"id":"rw7599548","title":"Season 3 is repetitive and predictable","starRating":"6/10","datePosted":"29 November 2021","text":"I've been watching this show since season 1 and quality of the content, storyline has gone down considerably since 1 season when I got totally hooked immediately. Funny how Joe and his partner in crime Lovr keep killing people throughout the neighborhood and keep getting away in season 3. Story gotten dull , repetitive and predictable."},{"id":"rw7475698","title":"Thank god that's over","starRating":"1/10","datePosted":"24 October 2021","text":"Season 3 has to be the worst show I've watched all year it's absolutely nonsensical. Despite all the murders and the reveals nobody actually calls the police. It's descended into a Miss Marple farce. This needs to end now.I wax wrong Season 4 was complete 'jump the shark' utterly bonkers. I was hoping they would bump him off but alas no.So glad it's finally gone for good or has it?"},{"id":"rw5357120","title":"Season 2","starRating":"8/10","datePosted":"27 December 2019","text":"Sometimes writers choose to have one or two big twists in a season/plot line that shocks us and changes things entirely, and sometimes they choose to have a bunch of minor twists that go off like small bombs throughout the story. The writers of You have clearly chosen to do both of these things. In some aspects maybe less could have been more for us but in others I was pleasantly surprised by it.\nOne thing I do know though is that there were at least one too many characters involved this season."},{"id":"rw8920809","title":"Season 4 is trash","starRating":"1/10","datePosted":"11 March 2023","text":"Season 4 just ruined everything this show had before. How can you possible kill so many people in 21st century and not get caught, LOL. I think Netflix just creates this superhero character for Joe to keep him alive and in freedom to create more rubbish seasons. The other new characters very also very boring and without any charisma too. How can we go from Season 3 Love to Season 4 Kate who for me is absolutely cold character without any interesting features. I know they will create more seasons but I also know I will not watch them for sure. I really liked the first 3 seasons but season 4 just took my interest out of this Tv series."},{"id":"rw5404943","title":"Season Two Update","starRating":"8/10","datePosted":"13 January 2020","text":"This is a \"Should I?\" or \"Should I not?\" kind of a series. From the pilot, we know the protagonist is definitely sociopathic, maybe even psychopathic. Is this an anti-hero we can get behind? But, there is just something about it that makes you want to watch one more episode... and then you find the first season is over! This is well written, well performed, addictive and, well, disturbing. I give the first season an 8 (addictive) out of 10.For the second season, I was curious about how they could reinvent themselves, feeling pretty sure we had seen all of the tools in Joe's bag of tricks. By this season we are desensitized to Joes' menace, and the drama has a more pedestrian feel, however, it ends with a delicious twist upon a twist. Not quite as good as the first season but still good viewing, I give this season a 7 (good) out of 10 and the series a 7.5. {Dramatic Crime Thriller}"},{"id":"rw8623112","title":"Glorified stalker show","starRating":"1/10","datePosted":"20 October 2022","text":"I'm sorry, but at the end of the day, this show seems to make the main character, who incidentally, stalks women, thru social media and in person, stands outside their homes and looks thru their windows until he actually breaks into their homes to gather Intel before he initiates a relationship with them, ultimately killing them, usual after holding them prisoner inside a room built of either glass or some kind of hard plexiglass...the hero. I know it's supposed to be entertainment but seriously, is this where we are? Glorifying serial killer stalkers of women? While trying to make it funny? At least with Dexter he was actually killing people who did heinous things and deserved to die. I find this in poor taste. And apparently he gets away with killing the women he stalks so he can find a new victim in the next season. I just don't think this was a good idea for a show."},{"id":"rw4332877","title":"Freaking. Excellent.","starRating":"10/10","datePosted":"11 September 2018","text":"Great acting. Inventive storytelling. Truly unsettling and underlyinglg creepy. I can't wait to see where this show goes."},{"id":"rw8873280","title":"*THIS RATING IS SPECIFICALLY FOR SZN 4!*","starRating":"3/10","datePosted":"15 February 2023","text":"'You' seasons 1-3 are amazing! Don't get me wrong, I love the show szn's 1-3, 10/10.However...Season 4 part 1 absolutely sucks. I'm giving it a 3 instead of a 1 simply because the acting is still stellar and the cinematography is still very good. Outside of that though, the story is trash. They've shied so far away from what seasons 1-3 brought to the table that it feels like a totally different show.Idk if it's just the setting in general or what but it's not good. Everything about season 4 feels very forced and like they're just trying to grind out another season. It feels very thoughtless and doesn't really bring seasons 1-3 background with it, at least not very well. If you've never watched seasons 1-3 you could probably start watching season 4 and not really have many questions about what's going on, and that's a serious problem.I'm not sure how another half of a season is going to make me feel any differently but so far, so *not* good. Oof."},{"id":"rw7465423","title":"Help! S03 sucks!","starRating":"1/10","datePosted":"21 October 2021","text":"YOU had me at 20mins... I stopped watching.. Boring!!! Send this overdrawn psychosis of psychopaths to the Squid Game and let's all just get a refund and call it even; in view of Season 1&2 we're good. S03 is a poor remix with no new musical arrangement. Sorry, YOU ain't no Gloria Gaynor, YOU won't survive!"},{"id":"rw8920793","title":"Last Season Took a Dive","starRating":"1/10","datePosted":"11 March 2023","text":"Whomever wrote season 4 must've not wanted for this show to survive another. What a bunch of garbage, you somehow (through terrible writing) managed to evolve a character into this bipolar schizoid maniac whom has no redeeming qualities, \"Joe\" is COMPLETELY unlikeable to the point of where any viewer, with a shred of intelligence, would not waste another nanosecond on this drivel. You made the character hateful and cruel towards the innocent instead of society's detritus. Hated every episode and I hope that viewers will see the same. Never watching this series again, you should of let him drown in the Thames and be done with it! We as society are tired of bad people getting away in real life, we don't need to see it in our fantasy world as well....we need to walk away from a series finale feeling clean, not dirty. You failed.....MISERABLY."},{"id":"rw8931268","title":"Season 4 has ended it for me","starRating":"3/10","datePosted":"16 March 2023","text":"Sadly, I feel each season was not quite as good as the one before with this series. Season one - absolutely LOVED it. The story; the characters; the acting.Season two was very good as well. For me, not quite up to the first, but still incredibly enjoyable to watch.I feel that I sort of forced my way through season three because at that point I felt pretty committed to the show. I certainly didn't hate it, but it was not even close to season one as far as enjoyability.So then comes season four. I couldn't even make it through the first episode!I'm not saying I expect total believability from a series such as this, but when I saw that Joe was working as a college professor at a UK university, I totally lost it. I mean, really? Wasn't there any other profession they could have chosen for him? The idea that he would be able to get a job at that level is absolutely ridiculous and downright impossible. Impossible.And from what I've read, the writers did it purposefully, which makes it even worse. This is from an article I read while researching to make sure I didn't miss the episode where Joe got his PhD, or even his college degree for that matter:\"It turns out that You author Caroline Kepnes and showrunner Sera Gamble have been hoping to put Joe in this setting for quite some time. \"We've known for years that we wanted to eventually put him in a university,\" Gamble told Entertainment Weekly.\"I get that Joe got himself a new identity for season four, but again, I can literally guarantee that he would not be able to land a job such as this. Even with a brand new identity.It's fiction, so of course they can do what they want, but I think this is just plain dumb. And annoying.I know it probably sounds trivial to some, but it's freaking lazy on the part of the writers. And if that's how lazy they want to be with something so simple, I just don't feel compelled to invest any further time here.It was good while it lasted for me..."},{"id":"rw5356624","title":"Second season even better!","starRating":"10/10","datePosted":"26 December 2019","text":"I can't believe I just binge-watched the whole season, with barely any pauses between episodes. I have to recover now from all day watching, but I'm also going to be mourning the end of this amazing series. Second season blew my mind. Gone Girl meets Amercan Psycho."},{"id":"rw8875354","title":"SImply horrible. Unbelievable","starRating":"1/10","datePosted":"17 February 2023","text":"I won't waste a bunch of time mentioning every single instance of terrible writing in this show. But there is one series of events that sums the unbelievability of this entire show. It happens in season 1. After disposing of Beck's cartoonishly horrible boyfriend by triggering his deathly allergy to peanuts, Joe leaves the body in the basement of the bookstore until simply entering the basement exposes him to the smell of decomposition, which has been accelerated by the power outage shutting off the AC. Not only does that smell not simply go away by removing the body, it would also permeate all the old books kept down there.But no worry, there is a solution. Joe wraps the body in a a tarp and dumps it into the trunk of his car, where, instead of disposing of it immediately, he goes to help Beck assemble a new bed, leaving a rotting corpse in the trunk of his car while it sits parked on the street. To make matters worse, he then gives Beck and Peach a ride in the car with the body still in the trunk.This show is absolute garbage, and it didn't take three seasons to figure it out.The characters are all either incredibly naive or incredibly stupid. Or both.Absolute garbage."},{"id":"rw8916485","title":"Something is wrong with the season 4","starRating":"7/10","datePosted":"9 March 2023","text":"I think that this show started pretty good and it is watchable until the season 4. I mean, I just finished season 4, the second part, and I barely watched it. It was hard to keep me interested so I watched the last three episodes with jumping throughout the each episodes and scenes so I can finish it as soon as I can. It was so hard to watch it. Pretty boring.To he honest, season 1 and 2 are great. Season 3 is watchable but there was no reason to do season 4 that ruined literally the whole series, as far as I'm concerned.Penn did a great job and all the other actors but the script vas obviously bad.In some point I would give it an 8 but after season 4 I will stick to 7."},{"id":"rw7445961","title":"Gone woke","starRating":"5/10","datePosted":"15 October 2021","text":"Season one and two are very good. The writing and acting was great. But OMG season 3 sucks. Why can't Hollywood just stay away from being woke and cramming binary gender crap down our throats. This one is going a bit further and sticking the anti vaxx to you every chance it gets. Because we are only allowed to think one way. Sorry writers you got this one way wrong. We watch shows to get away from politics and how the left is destroying this country and others around the world. I did make it until episode 3 than I was out. The story line was lame. It's like they got new writers that came right out of democratic party. See ya. I will be very surprised if this review makes it past their board and allow it to be published. We all know how that is going these days."},{"id":"rw7475024","title":"Really, season 3???","starRating":"1/10","datePosted":"23 October 2021","text":"The first two seasons were great. Season 3 almost makes this kind of psychopathic behavior, what, funny? Maybe even justified? I found this season so incredibly disturbing and just flat out dangerous. Wow."},{"id":"rw8921135","title":"Season 4 Ending Sucked","starRating":"3/10","datePosted":"12 March 2023","text":"I was excited to finish season 4 but it nosedived at the end.Season one is by far the best, season 2 & 3, while predictable are fun to watch.I was excited to see a plot twist half way through season 4, but then they killed it with the same ole boring formula.The lack of detail and sloppy character development at the end turned the entire season into a b movie style script with rushed plot development that didn't align with the rest of the show.They could've done so much more with the Rhys character but failed to do so.In the end, the show left me feeling annoyed with the ending and not in a good, suspenseful way."},{"id":"rw7451286","title":"Dear Netflix, must you fu£k every show I start to like??","starRating":"3/10","datePosted":"17 October 2021","text":"This is my second review. Just for se03. Seriously wtf Netflix!!?? What is all this political correctness and why the hell do I have to constantly hear about so called \"anti-vaxers\" in a supposedly psychological thriller??? Your subtle message in this show is ridiculously \"what you call (anti-vaxers) deserve to be killed\"????? Seriously?? Also, This season was so boring and so many episodes were just long with no thrilling events at all!! Went downhill from quoting Dostoyevsky in Se02 and being deeply psychological to this boring woke shenanigans!"},{"id":"rw7450575","title":"At first I was hooked but... season 3 is hands down AWFUL","starRating":"7/10","datePosted":"17 October 2021","text":"I'm so disappointed at season 3, it's so bad that it's almost unwatchable. So many plot holes, and stupid character actions, it's just idiotic. I'm almost ashamed to be watching it. Can't wait to finish watching it. It's so hard to watch something THIS BAD after finishing Squid game and The fall.EDIT: Ok, I jumped to conclusion, I admit. After episode 5 it gets a lot better. First 4 episodes Love what the F?! Like a bad drama gone worse, Love goes around killing, she's beyond irritating. And woke? You're kidding me. F... off already. But after you tough through the first 4 episodes it gets better, I promise."},{"id":"rw8916577","title":"Rate 9 for Season 1-3, Season 4 is the absolute worst and a 3.","starRating":"","datePosted":"9 March 2023","text":"Sad they decided to ruin the show by completely changing everything good about it. The writers really watched Glass Onion and said, \"Put Joe in the most unrealistic circumstance in London and give him an entirely different motivation and personality.\"Joe meets the richest people in London and after five seconds, they are kissing his ass. He's a complete stranger, a lame English professor with no money, connections, social media or noble background. All of the rich people accept him IMMEDIATELY and he's invited to the best parties, shows and clubs, hell even their homes and business meetings!This was written for no other reason than to frame the plot conveniently so Joe can get close enough to investigate a murder. Nothing about this feels real and because of this, all dialogue and contrived relationships seem stale and hollow.What made You seasons 1 through 3 so amazing was the through line of Joe's development and how far he will go to fuel his obsession for a woman. Each season focused on a girl who consumes Joe's entire mind. Joe would risk getting caught A LOT to stalk and carry out all his inappropriate compulsions. An addiction which led him to kill and do horrible things. In Season 4, that entire neurosis goes away as he ignores beautiful women throwing themselves on him in order to follow up on leads and be a hipster Sherlock Holmes. The audience doesn't care about Joe's satirical opinions on the monarchy, fashion and upper society. We already know he thinks everything's pretentious."},{"id":"rw7471731","title":"Every season is getting worse!","starRating":"1/10","datePosted":"22 October 2021","text":"So bad, I don't know where to start. The acting and writing is cringe at the fullest. I wasted my time with this. Netflix is getting ridiculous with these kind of series."},{"id":"rw7457817","title":"We waited almost 2 years for this??","starRating":"2/10","datePosted":"18 October 2021","text":"Season 3 was such a disappointment. As much as I anticipated this season, I even cleared my weekend because I knew I wanted to binge watch, it was such a letdown. Episode 1 and 2 were ok. Not the best but it was getting somewhere and then around episode 4 through 8, it was a complete bore and nothing really happened. The suspense didn't really kick in until like the very last episode.Season 2 left off on a great cliffhanger. We all wanted to know who was the new girl behind the fence that Joe will now be obsessing over.. Only for her to be impulsively killed so quickly in like episode 1. How anticlimactic! They could have done so much more with her storyline. I mean we only waited damn near 2 years to see who she was.I'm just going to go down the line and nitpick honestly because I'm so upset that the season just was not what I thought it would be.Waayyyy too many flashbacks. It's like they used flashbacks to take up most of the episodes because they couldn't come up anything. We already knew Joe was bullied and didn't have the best upbringing. That was already established in season 1 and 2.Maybe this is a real nick pic but I couldn't help but notice the baby was a different baby every single scene lolI couldn't connect with Joe all of a sudden being obsessed with the library girl. It didn't make sense. It just seemed like they needed him to be obsessed with someone so they chose her. They focused way too much on her backstory. I really didn't care that she and her ex were going through a custody battle but I guess they needed that story line in order for Joe to feel like he needed to save someone.Love was completely insufferable. I couldn't stand her last season but she was tolerable. This season I really hated her. She took no accountability for anything and everything was always Joe's fault.Why on earth did Love carelessly yell and admit she killed Sherry while the other couple was upstairs. Like really?? I seriously wanted to throw my phone at the tv.Joe just wasn't the same Joe. He used to be calculated and premeditated but this season he was just sloppy and all over the place. I know it was mainly because of him having to clean up Love's impulsive acts but it just didn't seem like him.Why on earth did they have Love's mom take the damn baby with her to burn down the Vineyard... like why. What was the point?Also what was the point of Love getting pregnant and having a miscarriage. Was it only so that they could write in Love having a dream about seeing 40? I thought maybe Joe would get a hold of her phone and see the text messages about her not knowing who the baby's father was. Imagine the rage and havoc Joe would have caused when he found out that the teenage neighbor was a possibility would have been a great potential storyline to explore but instead they just threw it away.The scene when Joe went into the woods with the guys reminded me of the scene from Season 2 when Joe did acupuncture with Love's gay friend and let out a ton of emotions... ugh just so many recycled scenes.The library girl was really annoying. She complained about her ex being white, having white privilege, etc etc.. but girl, you chose to have a baby with him.....This season was tooo woke for me. Every single couple was mixed or gay. Vaccination, anti-vax, feminism, all themes I wish I could escape for just a second.. but nope, on full display every single episode.Joe caught the measles from the baby.. but when the baby came home from the hospital he was holding him with measles scares all over this body.... Um doesn't seem smart.one positive.. I shed a tear or two when Joe dropped off the baby to the gay couple. Such a heartbreaking scene.I really could go on all day because I have a bunch of questions and just things I couldn't believe they actually wrote in but overall, I was disappointed. This season didn't seem to leave off on any cliff hangers. Most if not all of the loose ends were tied and Joe seemed to have gotten away and is now in Paris living his life.Thanks again Netflix for butchering a great show. I think it's ran its course."},{"id":"rw4749693","title":"Season #1: She Loves Him, She Loves Him Not. She Loves Him. She Loves Him Not.","starRating":"4/10","datePosted":"29 March 2019","text":"The following review was first submitted while watching the first 5 episodes of Season #1 of 'You' in 2019. Since then I have returned to the series a second time, giving it 'A Second Chance'.First, here is 2019's review:I wanted to like this, but I didn't. And here's why. It is a bad, very bad, knockoff of Showtime's 'Dexter'. Dexter's 'hero' murders people who are, themselves, murderers. Other than that, he's an OK guy. He is a blood-splatter specialist with the Miami Police and his work helps identify killers. On the other hand 'You(s)' Joe Goldberg is not really an Ok guy. His reasons for killing are purely selfish. And the objects of his wrath, though not the nicest of people, in no way deserve their fate. So then, what or who's left for the viewer to root for?The answer, Elizabeth Lail who plays 'Beck', the young woman with whom the obsessive Joe Goldberg falls in love. And FOR whose love, he kills. She grows more alluring with each episode. Physically alluring. And this is almost enough for me to recommend 'You'. But not quiteBut now that I have revisited and completed the series:1. I added a star; changing the rating from '3' to '4'. There are some twists, some new characters, in the season's final episodes. They added to the suspense.2. Episode #10, the Season's Final Episode, proved to be excellent.3. Of course we did not need all of the earlier nine episodes for the final episode to be great. There were many repeated plot twists and turns; Joe and Beck are in love, then they're not, then they are, then they're not. Truly, those episodes could have been compacted into one or perhaps two one-hour segments.4. There's a short scene at the very close of Season #1 that will surprise the viewer. And set us up for, hopefully, a better Season #2."},{"id":"rw7292195","title":"Oh my God!","starRating":"10/10","datePosted":"31 August 2021","text":"Such a great show! Loved every part of the plot, great performances!"},{"id":"rw5358602","title":"Season 2 is quite good","starRating":"8/10","datePosted":"27 December 2019","text":"Season 1 was okay, entertainable. Didn't like Beck at all though.Season 2 is more mature and Love is a great character (great actress). The season is more thrilling and the story isn't that cheesy. Really enjoyed it!"},{"id":"rw4582897","title":"CREEPY BUT EXCELLENT","starRating":"10/10","datePosted":"14 January 2019","text":"Wow.. I loved this! Had no idea what I was getting myself into as I never read the book or heard anything of it. I finished it in 2 sittings. Penn played this part BRILLIANTLY! He convinced me to love him at times yet hate him at others. Honestly couldn't recommend it enough. Each episode something more creepy and messed up happens yet you just need to keep watching!"},{"id":"rw8925792","title":"It was a 10 that turned to 4 in season 4","starRating":"4/10","datePosted":"13 March 2023","text":"My gosh... what an unstable unlikely trainwreck the last season was... its like vanilla sky on wannabe dark web drugs... i just forced myself to watch untill the end just to watch someone smack mayo on icecream... just so i could write this stupid review. And i still need to write 316 nore letters... no way any insane sick man like that could get away with it and live a normal life after that... he cant see whats real and whats not, and that alone makes it easy to mess up and leave dna and evidence for the police to find... and not calling cops when marianne was found?!! Please.... Now im only down to 0 more letters."},{"id":"rw4331735","title":"Whoa.","starRating":"9/10","datePosted":"10 September 2018","text":"I read the novel a year ago. When I heard that they were making a tv show produced by lifetime I was skeptical. But yesterday I saw the pilot of You. All I can say is that the show has my attention. I'm a fan of the book. I loved it. The book is dark and has a comedic shade to it. The TV show is dark but the darkly comedy shade of the book is still missing. Thats just a knit pick though. The show is great. The actors are faithful in portraying the charecters. Pen Bagely as Joe (maybe I mispelles his name lol) but he does a great job. The show requires a lot of monologues and narration as the novel is in first person. But this doesn't bog down the show. Its done pretty nicely. I hope that the show sticks to this level of superb and gets better. I'm amazed and happy."},{"id":"rw7481457","title":"Long drawn out and in the main, incredibly boring","starRating":"2/10","datePosted":"25 October 2021","text":"I had high hopes for this as it sounded interesting with a lot of potential. A book seller with a keen interest in a girl he will go as far as to murder for.Perhaps its the script writers, and not the actor/ress. I'm on episode 7 of Season 1 and I've had enough.My stages of watching this have gone as:1. Watching with interest, paying attention to it2. Playing on my cell phone (mobile phone) while watching it3. Leaving it playing in the background while I did other things4. Sitting there and fast forwarding through most of an episode5. Skipping through much of episode 6 (season 1) with the skip button6. Starting episode 7 and turning it off with the words \"I've had enough of this\"Its mind numbingly boring. Avoid."},{"id":"rw8942597","title":"What part of this supposed to be entertaining?","starRating":"3/10","datePosted":"21 March 2023","text":"What makes this show unique is that every character in this show turns out to be a certifiable lunatic and in some cases, even more sick and twisted than the main character - a pervy NY jewish guy named Joe Goldberg, who, turns out, has also serious mommy issues.So, this pervy guy gets obsessed by a female character and as you can expect, ends up killing her in one way or another.As I mentioned before, what makes this show really weird is that his victims are also mentally ill pervs. Actually, not just victims but their parents, \"friends\", bosses, co-workers, neighbors, librarians... yes, every single person you come across in this show turns out to be mentally ill. Wow!PS! Mr. Goldberg also likes to have a wank in public places. This is what modern TV has become."},{"id":"rw4481142","title":"It's like Dexter...","starRating":"1/10","datePosted":"27 November 2018","text":"...If Dexter were a pu**y surrounded by obnoxious tweens. It probably could have gone places, but instead it dwells on tired stereotypical \"valley girls\" and a pathetic romantic stalker plot. The only thing that kept me mildly entertained after the first episode is the monologues, but it doesn't make up for all the other annoyances that plague the show."},{"id":"rw8938981","title":"YOU outsmarted me.","starRating":"","datePosted":"19 March 2023","text":"I was ready to be disappointed after one or two episode. First, actors of Kate's friends group are terrible. I hate when a new season of any tv series adds a bunch of cheap mediocre-talented cast to make it refreshing, but it never really works. Second, 'whodunit is the lowest form of literature.' Gosh, I've watched Elite, One of Us Is Lying, and countless other high teen series, figuring out a killer throughtout a season.What we love about 'YOU' is tight and raging storyline and Joe's psychological roller coaster process. The Killer has to be Joe. I was worried that season four gears into different direction but loses original purpose instead. However, it exceeds my expectation. It was easy for me to figure out Rhys is the killer for the first half. I got to admit that I did not see the second big reveal coming. Even though there are many holes in the plot, the pace of the story and the amount of information complement disadvantages.Season 5 will be a greater challenge for writers. Joe is not just average Joe anymore. Audience does not see him as a victim of domestic violence and harsh world after redemption from the public and stepping up to the top of the ladder. Each killing will need more and more effort and justification not to appall audience to the level of them leaving the show completely."},{"id":"rw7481385","title":"Gross on every level","starRating":"2/10","datePosted":"25 October 2021","text":"Stalking and murder sexualized and glorified and then you get to season three and they have propaganda on steroids with anti-vax crap, political comments and over blown sexual situations that are so inappropriate it is just over the top. Completely valueless and gross."},{"id":"rw7450141","title":"Another one ruined by the woke.","starRating":"1/10","datePosted":"16 October 2021","text":"This show started out OK even though they tried putting a twist on murderous stalkers. At least Dexter's writers tried getting us on his side by going after criminals that slipped through the justice system's cracks. Netflix prefers to justify the behaviors of two psychopaths instead. Then by the third season they clearly try turning the show into another woke message against the anti vaxxers by kidnapping one and justifying his murder. Another desperate attempt from Netflix to segregate and push people apart rather than together."},{"id":"rw7479079","title":"Third time not so lucky","starRating":"5/10","datePosted":"25 October 2021","text":"I've enjoyed this series but it's time to shake things right up or call it a day. Penn is back as Joe, the handsome but deranged serial killer who has now married an equally deranged woman, had a baby and moved to the suburbs. It definitely has more politically correct overtones than before. I didn't mind the vax stuff so much but was annoyed by the saintly portrayal of Joe's new obsession, the world's hottest librarian and former addict Marianne. She is a talented actress but looks straight off the cover of Vogue which makes her character more than just a bit unbelievable.Now, I'm not an American so I have to wonder if all American middle-class suburbs are hotbeds of sex, deception, murder and mayhem. Are all the teenagers all well-spoken, articulate and wise? Does everyone live in an under-lit house straight out of Architectural Digest? In the world of You they certainly do and that's on one of the issues I have with many other Americans productions - will you guys lay off the over-styling? Not everyone has to look amazing all the time - even the blind guy at the library looked as if he'd stepped off the pages of GQ. It's just getting out of control.This season of You offers nothing new but does build on the many talents of Victoria Pedretti as Love, Joe's murderous wife with a mother that looks like her older sister. She's just GREAT and magnetic on screen, easily slipping between logic and twisted logic with ease. In fact, I was hoping that Joe would get killed off and she would take over as the lead of the show. That doesn't happen, BTW.All in all, a little too familiar, a little too tired, a little too political and a little too over-styled to be must-see TV. Worth a watch, though."},{"id":"rw7466156","title":"S1/S2 was great! S3 is bizarre","starRating":"1/10","datePosted":"21 October 2021","text":"Season 1 and 2 is in fact quite good, you get to put yourself in the shoes of a creepy stalker turned killer who tries to excuse his behavior, we can tell it's not an innocent story and all his actions are not acceptable. However Season 3 takes a bizarre turn, first episode of Season 3 was good, then 2 and 3 just went off the rails...The writers for Season 3 just didn't have the motivation to create a compelling story so they went to what Hollywood does best, jump onto political issues."},{"id":"rw4586800","title":"Would not work if she'd bought curtains!","starRating":"1/10","datePosted":"16 January 2019","text":"Honestly stop comparing this to Dexter. Terrible clichéd show. The masturbation on the steps section made my wife and I laugh out loud!"},{"id":"rw6582917","title":"Unique series","starRating":"9/10","datePosted":"10 February 2021","text":"I personally liked season 1 much better than season 2, because in season 1, Joe's character was just so new and unique, I was just so invested in finishing the season. I'm not saying I didn't enjoy season 2, however I was able to expect some of Joe's actions, and I was just able to see some sort of pattern in his actions. But I still would like to watch season 3, and I am very excited for it!!"},{"id":"rw7610360","title":"3rd Season ruined it","starRating":"2/10","datePosted":"3 December 2021","text":"I liked the first 2 seasons of this show, and I was excited about the 3rd, cause the writers would have a lot to explore. Alas, they chose to blow it all up with a boring season, with an exhaustive character (Love). What could be a Dexter 2.0 became a Desperate Housewives 2.0. I will not even try the 4th one. Go for Dexter New Blood or watch the 1st and 2nd seasons of this one, but trust me, the 3rd will destroy it for you."},{"id":"rw8842984","title":"Great first two seasons","starRating":"8/10","datePosted":"1 February 2023","text":"I have to agree with that many other reviewer's. Seasons one and two were surprisingly good and I ended up watching them in two days The acting was great and the lead guy , Penn Bagdley, was really good. I've never seen him before or heard of him. The story was very interesting and I binge watched it in two days . The third season was really bad and Took me a lot longer to finish. The story line changed quite a bit and not for the better. I found it really dumb that she starts killing people unnecessarily. They do focus a lot on his childhood which gives you an understanding of why he is so disturbed. She was getting very annoying by season 3. Getting married and having a baby did not add to the story at all. I just saw that a season four will be coming out next week. I will probably pass on that."},{"id":"rw4700203","title":"Engaging 'Creeper'-Style Series.","starRating":"4/10","datePosted":"5 March 2019","text":"Didn't much like the premise of this series due to the creepy psychopathic nature portrayed by the trailer, but gave the first episode a shot. It is a little reminiscent of the 'Dexter' series and was engaging enough to watch the first season in entirety. Was a little predictable for me, but very watchable nevertheless. This just one man's humble opinion, watch for yourself."},{"id":"rw8868267","title":"S4 is so boring!!!","starRating":"4/10","datePosted":"12 February 2023","text":"First thing first, i must admit, i wasn't a huge fan from the beginning on, took me like 2-3 tries to get into it. I actually enjoyed watching all 3 seasons, as weird as this show is, it is entertaining. Or better - it was. Season 4 is so incredibly boring. I keep on falling asleep to Joes neverending monologues in his good-night-story-voice. God, it's awful.the storyline is totally not making any sense. Is Joe falling for that girl? There is absolutely no chemistry between them. How does he even happen to be accepted by this bunch of rich kids? There is not one likeable character in this season.Season 4 is a huge disappointment."},{"id":"rw7469092","title":"Dont bother","starRating":"1/10","datePosted":"22 October 2021","text":"What I enjoyed about You season 1 and to a lesser extent season 2 was its creativity. But season 3 is just a cobbled together mess.Not only is it clearly pushing several and not particularly well thought through agendas. From vaccinations to white bashing, it can be an uncomfortable watch. Netflix has a history of ruining shows in a similar way and this is no exception.The character's are hard to connect with, Love's acting is terrible and the whole plot is simply unbelievable.Give it a miss."},{"id":"rw8878979","title":"Season 4 is bleh","starRating":"5/10","datePosted":"18 February 2023","text":"As a major fan of psychological thrillers, I must say that the show was also extremely intriguingly written, and perfectly casted. Season 1 and 2 are beautiful. Season 3 is okay.However, in season 4, the show's entire dynamic and tempo have shifted. As opposed to being about just a regular serial killer, it is now about a serial killer who has transformed into an amateur sleuth who is attempting to determine who is trying to frame him for a murder and is also aware of his background..... not to be a spoiler but season 4 is a no-brainer!!No doubt Penn Badgley did an amazing job as always, but...I forgot to add how flat and boring the Season 4 is!!No cliffhanger nor suspense!!Lost its original flavor of psychopathy...sloping down the drain of just another Agatha Christie's detective storyline."},{"id":"rw8959241","title":"Season 4 was trash.","starRating":"7/10","datePosted":"29 March 2023","text":"The first season is by far still the best. The newest season I don't even know where to start. Why add so many characters, it gets too convoluted and no one cares about any of them. Just go back to Joe + 1 girl. We don't need 10 sub plot lines with characters that don't matter. Also don't release the season in two parts again. I forgot the entirety of the plot(s) or who anyone was. I barely pushed through to finish it. Just release the whole season next time. So ya, too many plots in the latest season, too many characters. Just go back to the roots, season 1, 2, 3 were great. No idea who messed up season 4 so bad but they should do some self reflecting on their writing skills."},{"id":"rw9147602","title":"Season 4 completely jump the shark!","starRating":"1/10","datePosted":"26 June 2023","text":"Please for the love of God do not make a season 5! Season 4 completely jumped the shark! What the hell was this season anyway? I was on board with the campy whodunit plot line, even though Joe's character would absolutely never be accepted into the elitist socialite circle that we are supposed to believe he is now a part of. But I went with it. Then there's a plot twist (that I won't give away). It turned into a completely different show altogether. A show that, honestly I completely lost interest in. Writers have made it impossible to continue rooting for Joe! Season 1, even season 2 the audience is rooting for him! But the writers have lost that sense of direction. It's almost like they didn't quite know what to do with Joe, maybe feeling that they had to switch it up in order to keep being renewed for multiple seasons. Well that's not working for me, personally anymore. Not to mention that Joe's character is completely 100% creepy! Creepier than he was in the first couple of seasons. Yeah, I know he's supposed to be creepy. But he's really just down right gross! I hung with season 4 pretty well until around episode 7 or 8 when the show just became laughable and I became frustratingly bored and skeeved out. At that point I went online and read the summaries for the remaining episodes. I left the show on in the background as I scrolled social media and just waited for it to end."},{"id":"rw7455132","title":"Just when you thought the show couldn't get worse...","starRating":"1/10","datePosted":"18 October 2021","text":"Season 1 impression - This show is interesting, but feels like a basic teen less-gory version of Dexter. But at least the story got better as the season went along.Season 2 impression - The show was decent and funny at times, and annoying at other times. They played on a lot of topics but in an ironic way that makes fun of it. The love story was cute and interesting.Season 3 impression - Garbage. It started with potential but then (as with lots of shows these days) got ruined by pushing 'woke' narratives. I'm not even white, but pushing things like \"missing white girl syndrome\" and grossly pushing an anti-vaxxer story by comparing Measles vaccines to COVID vaccines (when one actually prevents measles and the other doesn't prevent COVID - and this is from someone who has known multiple vaccinated people in ICU). Both actors for Joe & Love seemed to have forgotten how to play their characters. They're all over the place and their personalities are not consistent anymore. Also the constant whining and bickering is really annoying. I get that couples do that, but still just get to the point of the story."},{"id":"rw8865996","title":"A disappointing start to Joe's new adventure -","starRating":"5/10","datePosted":"11 February 2023","text":"I was excited for You when I saw the trailers ; turning the show around into a new direction after the same formulaic 3 seasons with different details seemed like an ambitious move that would bring forth a new story to Joe's life but all it has brought is disappointment.The show reads something like a Lollywood soap opera ; the characters involved in this \"whodunit\" are entirely uninteresting and it seems as the show has sinked into mediocrity with it's writing. Watching the first / second season of You filled you with a sort of dread and excitement as to what would happen next but now , I just wait for the boring dialogue to finish as fast as possible.The \"whodunit\" in itself is also entirely uninteresting ; no effort went into placing any clues around to intrigue the viewer or any sort of brainstorm as to what the motives and obsessions the \"Eat The Rich\" killer might have.It seems as if Netflix had their boot down the production of \"You\" and what emerged as of Season 4 was an unfinished , uninteresting and wholly boring season which seemed rushed with very unrealistic scenarios and characters that you could literally not give a care about. I didn't hate any of the characters and I didn't love them and when they eventually got murdered , the most I could muster up was a \"hmm\".This is just the review for Part 1 of Season 4 but this show would need a miracle to become anything more than what it actually is ; a time killer with sex scenes sprinkled in between."},{"id":"rw4664101","title":"Overhyped","starRating":"4/10","datePosted":"17 February 2019","text":"Typical word of mouth \"you have to watch this\" bumpf - but with weak Dexter-like storylines, repartee and absolutely no real suspense...the ending was almost flagged from the start. When will American tv shows lose interest in the 'single white crazy' trope? Never."},{"id":"rw7454260","title":"Season 1&2, awesome, 9 out of 10. Season 3...political garbage","starRating":"2/10","datePosted":"17 October 2021","text":"All I have to say is wow...can't believe the writer actually had the audacity to pull a vaccine agenda, and shame on everyone involved who went along with It. Won't be watching further."},{"id":"rw7453532","title":"Season 3 not as good as the first 2","starRating":"4/10","datePosted":"17 October 2021","text":"What a downer season 3 is. It does have some good twists and writing and is worth watching but it definitely is a bit all over the place. The amazing suspense and originality from the first two season seems to have largely gone. And then Netflix goes and does the usual - adds a bit of wokeness into the mix with the anti-white agenda.Sadly I think it time to draw this series to a close before it's milked no end."},{"id":"rw8873942","title":"Season 4 has ruined this show for us.","starRating":"1/10","datePosted":"16 February 2023","text":"TERRIBLE! Season 4 is so bad. What happened to our beloved, cunning and charismatic show?!This season is the poorest writing and mostly thanks to incredibly uncharismatic characters! Such a bore and disappointment. Penn Badgley is outstanding as always but even he is lost amongst these terrible boring characters that just don't belong on this show. Bad bad bad direction decision.Season 3. Incredible! Joe and Love = incredible, electric, exciting, creepy, funny, shocking...allll of the things! We didn't love merienne as his love interest, they could cast someone so much better for him. They have zero chemistry, but nothing could have prepared us for even worse characters in season 4! Blah! Bring back the show we knew and loved!"},{"id":"rw8885051","title":"Season 4 is hideous......Ruined by the Brits!","starRating":"8/10","datePosted":"21 February 2023","text":"I'm British and I absolutely detest season 4. If anyone none-British is reading this; nobody outside of London is like this. Horrid people.What did they do? Why? My word, what a mess.I adored seasons 1 and 2. Victoria Pedretti is sorely missed in season 4. Without her, this show is nothing.I'm so offended by the depiction of British people. We're nothing like this. Why spoil the show with awful characters? Why bring a good show to the UK? British TV has nothing on American series.I won't be continuing with it. It's just so shockingly painful to watch.I'm sorry Penn. They let you down."},{"id":"rw8894831","title":"They should have stopped at S3","starRating":"7/10","datePosted":"26 February 2023","text":"I loved the first 3 seasons so much that I wanted to watch it all in a day. (Season 3 was my favourite).The fourth (what is released so far) is garbage. Unlike the other seasons, none of the episodes leave me wanting more. I wont hurry to watch part 2.I rate 7/10 as a whole but if I rated the newest season separately, it would be 5/10. I only continue watching because I am really hoping for a turnaround.But the way it seems right now, 'You' would have been golden if they just stopped at the end of three.But instead, dragging out another season or two is ruining what was a great show. If the writers have an interesting idea for a murder mystery, go ahead and write it for a separate show. Don't ruin a perfectly good show by turning it into something completely different."},{"id":"rw7458253","title":"Season 3 not as good","starRating":"5/10","datePosted":"19 October 2021","text":"Open a bakery with expensive 3 year lease but where are the customers and who is making the bake goods. No other employee to manage and do the work, what gives here. The owner/ worker doesn't bother being there herself. Guess munchkins are doing the baking.Another situation is this silly cast from another planet."},{"id":"rw5491726","title":"Love Hate Relationship","starRating":"8/10","datePosted":"17 February 2020","text":"It's hard to figure out what exactly to say about this series. I can't seem to figure out if I like this show or if I hate it.The series is very cleverly written along with Joe's point of view to everything, it's beyond twisted that it becomes intriguing. The way Joe thinks and how he reacts to things, is quite fascinating, but the real thing that catches your attention, is that you get to hear his thoughts. Yes, I've seen characters like him before in other movies, but I've never heard their thinking explaining, why they do what they do.The first season defiantly caught my attention. The way it ended infuriated me and made me loose complete interest in the show. But, I decided to give season two a chance. The beginning was hard to watch as I was still upset about the last season. But as the second season progressed It got much better, making me admit that it was in fact better then season one.The acting of the cast in the series was top notch. Penn Badgley made this series through and through. The way he can look so innocent with his eyes and facial expressions made you saying \"wow, this guy is good\". He is a great actor with lots of talent that he really pours into his character Joe.One of the biggest things that was extremely annoying was the way the show was filmed. The camera is clear in the middle, but blurry around the edges to almost make it look like an eyes view. It's very weird and I find distracting. It really makes you focus on the center of the shot and not the edges.All in all, the storyline, plot and especially the character of Joe is all extremely twisted and messed up. As events unfold it's very hard to figure out if this is a likable series or way too twisted for me."},{"id":"rw4582595","title":"You watched the first few episodes and think \"You\" seems like a good series?","starRating":"4/10","datePosted":"14 January 2019","text":"To anyone who watched the first few episodes, thinks they were pretty good and is wondering whether he/she should invest more hours of their time watching this series, this review is exactly for you.From the get-go, \"You\" has a relatively conventional premise: Joe, some bookstore manager, falls in love at first sight and becomes obsessed with some aspiring female writer, Beck. Despite this, the first few episodes are somewhat interesting: Joe has his own ironic way of articulating his thoughts through narration, with just the right amount of disdain for all these boldly clichéd, despicable characters that surround Beck. I am talking about Benji, some archetypical, douchey fortunate son, who's (obviously!) vegan and gluten-free, has his own soda company and plays with Beck's easily fooled heart. Yeah, you read that right, that's how stereotypical the writers went with this one. But buckle up, he's not the only one: I'm also talking about Peach, and Beck's entourage of shallow, Instagram-obsessed type friends, who are as snobby and as self-absorbed as they come.At first, these stereotypical characters all seem like a big joke, a bunch of idiots who the audience will delightfully watch Joe outsmart and probably eliminate one by one. You'd think there will be some social commentary with plenty of bite in there, as Joe stalks and disses the social media profiles of different characters. If you watched the first few episodes, you're probably thinking that a sardonic tone is being set, as it seems unconceivable that any writer in the world would create such characters with any intent, at some point, to make anyone like or even tolerate them. You're probably thinking that you're in for a show where you'll be brought to the morally ambiguous dilemma of whether you should be \"rooting\" for Joe. But don't get lured in just yet...Because after a few episodes, the deceit becomes obvious and everything is a complete mess, thanks to poor writing.The core of the mess, actually, lies mainly within the character of Beck. While, at first, she seems like a nice, emotionally vulnerable girl caught up in the middle of a circle of fake people, every time you are about to feel sympathy for her, she does something devaluating. It literally becomes a gimmick mid-way through the season. After a relatively short while, it becomes absolutely annoying, and you actually don't care for her anymore.When it comes to Joe, while he has a few good lines here and there, his obsessive behavior ends up nullifying any of his earlier displayed smarts, and he becomes amazingly pathetic. In this regard, the writers made Beck so unlikeable that it's barely believable that even the most desperate fool in this world would still have the slightest bit of interest towards her. As they show flashbacks of him in a previous relationship, you get to understand that he's just a psychopathic, hopeless romantic who's also a magnet for slutty and confused ladies, which makes him even more pathetic.As the series goes on, the interactions between the two main characters become annoyingly gimmicky, and you'd just wish they'd both get hit by a truck, seriously. Through midway of the season, the story becomes quite a drag of the same gimmicks and every twist and turn is highly predictable. You find yourself thinking this should have been a film or a miniseries.There is also plenty of nonsense throughout the season: Joe keeps stalking Beck and her friends and follows them everywhere they go, always staying close enough so he can hear what they say in public places like bars and restaurants. Obviously, they never notice him...he's wearing a cap! Of course they won't! But hey, they'll notice a private investigator following them in the blink of an eye, though. And Beck's apartment, what a great view it gives to anyone passing on that New York City street, right at RC level! On the other hand, she's portrayed as such a dumb and naive gal, it's almost believable that it never crossed her mind that she'd probably need curtains. And what about these people who suddenly disappear, but Joe sends a tweet or two from their stolen phone, so everyone thinks they're alive and well.There is one subplot that fostered a hint of interest, and that's Joe's relationship with Paco, the boy who lives in the apartment next to his. Unfortunately, this relationship remains underdeveloped, and the whole purpose of that subplot ends up being minimal.All in all, the boldness of the stereotypes at the core of almost each character made me believe there would be plenty of sardonic humour aimed at millennial bourgeois hipsters, but no, these are the characters populating the entire show, and none are likeable. NONE, besides Paco.Whatever trace of an ambiguous dilemma it successfully achieved to create during the first few episodes is barely a flash in the pan, and fades away about as quickly as Beck and Joe's senselessness gets unveiled. Then, you are left wishing the worse for both characters, or simply wishing you hadn't been baited into watching this poorly written show."},{"id":"rw7450690","title":"Sick of politics in shows","starRating":"1/10","datePosted":"17 October 2021","text":"Can any show now a days just not bring in all the crazy political crud we have to hear everyday???? I watch shows to get away from it and this show brought it in. Vaccine pushing and white woman syndrome? Like just stop. Create an actual issue. Done watching this show I guess, just hops on the bandwagon instead of being original like it originally was!"},{"id":"rw8024563","title":"Season1 is excellent, the rest is a mess","starRating":"","datePosted":"1 April 2022","text":"I just finished watching season1 for the second time, and it's indeed excellent. Great acting, perfect cast, the story flows beautifully, and the suspense never lets up.Season 2 is a hodgepodge, unsuccessfully trying to build a coherent story from tiny pieces stolen from season 1.In season 2, the story moves from NY to LA, and the new characters are caricatures of ditzy Angelenos, and they really grated on my nerves. What's worse, it keeps going back to the past spent in NY with new parts, messing the story even further.I haven't watched Season 3 yet, and apparently there's even a season 4 on its way, but I can't imagine getting anything from this spaghetti."},{"id":"rw7464101","title":"Season 3 is repetitive. Just kill this series","starRating":"4/10","datePosted":"20 October 2021","text":"Season 1 was great. Season 2 ok but this one?? Sorry but how come nobody stops these two from killing ? Nobody finds out? Police or any kind of investigations do not exist in the YOU world.Clearly the writers didn't know what New to bring. Killing, hiding bodies without leaving any trace. Locking people up in the cage.... Got tired of it."},{"id":"rw5362523","title":"I hate this show so much","starRating":"1/10","datePosted":"28 December 2019","text":"I hate everything about the show. The cliched characters, the predictable plot, the nonstop soliloquy, the lack of soul. They made every character SO RETARDED and UNLIKABLE it's INFURIATING. It honestly is INFURIATING. It's enraging. This is the only emotion I feel regardless of which timestamp I'm on. This show is SO STUPID."},{"id":"rw7490512","title":"Had to change my rating from a 10 to a 1","starRating":"1/10","datePosted":"29 October 2021","text":"Like all good shows .... They all end up getting PC and liberal undertones... killing an unvaccinated person? Calling an episode white almanac syndrome? I mean come on ... you ruined a good show that we watched to escape from reality from and turned it into trash."},{"id":"rw8874576","title":"Laughable and unrealistic scenes of London!","starRating":"1/10","datePosted":"16 February 2023","text":"I am a born and bred Londoner and I can tell you American viewers who don't know but London does NOT have a university like the one in S4 of You! I was so incensed with anger whilst watching Joe walking from his place of work in the university to his London flat (with a roaring fire that an unseen Victorian servant must have made for him in the Victorian fireplace!!!) via trendy East London hipster areas all the way to west Or central London on foot!!!!Let me put you all straight:\napart from the fact that London flats are heated by gas central heating and would be way out of his budget to rent, the university looked like Oxford or Cambridge which certainly is NOT within walking distance of London. It would have taken him weeks to get home on foot unless he thumbed a lift on the motorway!! Oh and it would've rained most days!!Utterly ridiculous!!!It spoiled the whole season!! 😡"},{"id":"rw8871337","title":"Went from being interesting to a complete mess.","starRating":"3/10","datePosted":"14 February 2023","text":"I started liking the show because it was drama and intriguing how the kind of a sociopath worked . But after Beth was gone it was kind of meaningless. How can this guy not get caught so much evidence it's ridiculous. Where are Benjis and Beth's parents. Make it more realistic and it would have been interesting. Jenna Ortega enter the show and I was like nice but not even she could save this. Focus more on actual crime shows like forensic files and you will find out how many things could get you caught easily like a hair, even a fiber . The third season don't even bother as pitiful as GOT final season."},{"id":"rw7447386","title":"Stop With The Preaching Already","starRating":"2/10","datePosted":"16 October 2021","text":"Season 1 was best, 2 was tolerable and 3 I couldn't even finish with the constant preaching about anti-vaxx and black victim mentality and some character doing a gender degree that has zero use in society. Damn. Where do one go to get entertained without being lectured to?"},{"id":"rw5748801","title":"My eyes 😑","starRating":"1/10","datePosted":"18 May 2020","text":"Seriously why is the rating of this show so high?! I don't get it!\nActing of the cast is terrible and and women in this show are so dumb and idiot and needy and simply I don't like it, sick shows like this should be banned"},{"id":"rw8868461","title":"Entertaining First 3 Seasons, 4th Season is a stretch","starRating":"6/10","datePosted":"12 February 2023","text":"I really liked the first three seasons and was super excited for the 4th one. I can say I actually lost my excitement after the first two episodes. The show didn't stick the landing this time around and it's because of the new setting and the way they decided to go this time around. It takes inspiration from all kinds of murder mysteries like \"glass onion\" which was just released on Netflix and portraits it in a badder boring lower budget way. I didn't feel to care for characters or who the killer was, nor did I invest into the whole story. It's a sad 4th season for a fun show. It rarely connects to the previous seasons, kind of plays down the explosive topics and turns of the previous season in a very boring way, without any consequences and just continues like the last 3 seasons didn't really affect the character or his life, other than him not wanting to be that way anymore. It's just handled and written poorly and non suspenseful and this show had so many cool ways to go but safely picked the most boring one. I'll watch the second part as it comes out but I'm not excited nor am I expecting anything big."},{"id":"rw8870747","title":"Wow just wow, season 4 is a good example on how to flop a series","starRating":"3/10","datePosted":"14 February 2023","text":"I did like the previous 3 seasons, but season 4... there is so many things wrong with it. I do like serial killer shows, I did like this show as its almost comical how he gets away with murder and the way he goes on about it. The protagonist represents a good reflection of the craze of a serial killer and lapses in reasoning. It is a fiction regardless. During the previous seasons the characters had depths to them, there was variety and a good balance of content, characteristic to the YOU series. Season 4 overdone parts they shouldn't had to, and underdone parts they should had to keep or improve on. The characters are dumb, all of them, there is noone to root for anymore, the acting is subpar- it almost feels like it was a conscious choice to recruit bad actors for this season. Just bad overacting all over the place. This season takes place in London, but it feels like whoever set up the script and the storyline had been to England once or did an hour Google search on London. Also, as the season progressing, not long into it, I felt like its a cheap knock off of an Agatha Christie novel... and it is, probably 5mins after it gets confirmed \"a whodoneit, the lowest form of literature\". Well, it was. It became a series with elements that you have seen a thousand times, but this time it feels like its done on an amateurish way because they tried to implement this whodoneit method into something that doesn't fit this schedule. It was an entertaining show, and it became a huge disappointment. I watched all 5 episodes, hoping sometime it gets better, and it didn't really. The other thing, the ending of episode 5 when Joe gets determined to do something at the end, assuming the content of the next 5 episodes. I won't make a spoiler on this. What the hell was that? Its so out of character for Joe, its so ridiculous that even in a show like this its just laughable on a really bad away. Who came up with this, they called season 4.... A major disappointment. The shows rewatch potential was big, this not got nulled, but went into minus. With an ending like this, there is no point investing time into it. I will wait for the reviews once the next 5 episodes come out rather than suffer through 5 episodes again, and if not much changes will just give it a rest. But again, I'm not sure there is any point bringing out the next 5 episodes at this point. They carved the tombstone and in a matter of moments this series is lowered well into the grave, simply there is nothing they can do to bring it back at this point."},{"id":"rw4370462","title":"Getting Old Real Fast","starRating":"5/10","datePosted":"1 October 2018","text":"I liked the first episode and kinda liked the second one but the third was barely holding my attention. By the fourth episode I was over it. It's so monotonous and i still don't care for any of the characters. I can't get invested in their lives or outcomes because they all suck. Beck is so reckless with her life and whenever you think she's showing growth she makes another self deprecating move. Not to mention that she and her friends are all blind as bats to never see Joe lurking in plain site, just so unbelievable that i have to turn my brain off. It does have a few entertaining moments here and there and the storyline isn't horrible but the characters are ridiculous and it got old very fast. So disappointing since it started out entertaining and very original, but it turns out it has nothing to say."},{"id":"rw7477790","title":"Mentions of COVID and vaccination in the 3rd season?!","starRating":"1/10","datePosted":"24 October 2021","text":"I enjoyed the first 2 seasons but when they makd the third season about politics and vaccination, and uses \"brain-dead antivaxxers\" type of words, this has become very weird."},{"id":"rw7843919","title":"Really really went downhill at Season 3","starRating":"5/10","datePosted":"7 February 2022","text":"Season 1 & 2 are the ONLY reasons I keep my rating at a 5/10 minimum.Season 3 is grossly woke as hell and the plotline is off the rails, especially by disregarding the buildup of the main characters' character development from the prior season (Love for example) with the final episode being abysmal! I'm probably one of the few out there, but I liked Joe and Love together as a couple (their characters had great, immersive chemistry no matter how toxic their love was). And, sadly the hack writers of Season 3 had to obliterate their relationship and have him chase after the librarian, Marienne.Furthermore, please do yourself a favor and don't waste your time watching catastrophic Season 3. I recommend you only watch Seasons 1 & 2."},{"id":"rw4542768","title":"How the hell is this show an 8??????","starRating":"1/10","datePosted":"29 December 2018","text":"Bad show. I'm writing this review for people like me who look at bad reviews to get the feel of shows.\nNot clever and really really trying to be. The writing is boring, trying to show how deep but screwed up the lead actress is just shows how vapid and one dimensional she is. She is an asshole to her asshole friends who are the only ones who like her. Joe is a dexter wannabe without the charisma or guts to actually do anything. He's boring and she's boring so they're a perfect match. I skipped ep 3 and endured ep 4 and half way through 5 and I think I may skip to the last 10 mins. This show sucks."},{"id":"rw7401109","title":"The best example of Netflix sabotage.","starRating":"4/10","datePosted":"2 October 2021","text":"Take this show. The first season was like a good book you can't put down. Granted characters didn't scream original, but they had interesting personalities. But it wasn't trendy enough. So it was canceled, and Netflix bought it. In a way people would forget it was on Lifetime first. I was fine with it being a mini series, but the temptation was too big after that season 1 finale twist. So there had to be a second season. Which it did, only from the wrong people. Season 2 is a bundle of clichés. Even the way it's going for ironic is. The new characters are ordinary, and very one dimensional, despite their sob stories and childhood traumas. Even the Joe character, who wasn't meant to be the good guy, was turned into a more acceptable version of him. Which is what I hated the most about these new episodes. And it is clear Netflix don't know what this show is, and is just using it to showcase their own personal agendas. Which, on top of making the series predictable, is killing it chance at future relevance, once the third-rate politics craze ends. It's already looking old and dated, when it's supposed to tackle current issues... And from the looks of season 3, they seem to be pushing this Dexter for « zoomers » aspect, another step too far."},{"id":"rw7463984","title":"Too much white-bashing for no reason","starRating":"4/10","datePosted":"20 October 2021","text":"Netflix has a long history of doing this, but the blatant, repeated demonizing of white people for zero reason as some weird propaganda is glaringly obvious in this series. It makes me cringe how basically every casting choice and plot point is made sure to make white people look evil lol. The premise and the acting would be nice, but this has turned me off and made me stop watching."},{"id":"rw4599465","title":"Excellent Thriller","starRating":"10/10","datePosted":"22 January 2019","text":"It moves fast and unexpectedly. There are a lot of plot twists and I found it very interesting. Penn Badgley expresses beautifully .His dialogues are written very smartly. I loved the Literature nods in almost all dialogue between Elizabeth lail and Peb Badgley. Elizabeth lail looks extremely Gorgeous and sexy .She looks every bit of that woman that YOU could kill for."},{"id":"rw5357400","title":"Binge Worthy","starRating":"10/10","datePosted":"27 December 2019","text":"So I just finished season two in one day. Let me just say that it is very much worth the watch. Season two gets better and shines more light into Joe's childhood. Things make more sense but let me tell you that this show definitely is not a light hearted show. It's dark in an alluring way. The story is so good.The twist at the ending shocked me. I was not ready for what happened but in a good way. I was also sad to find out about some way things ended for some characters and their deaths but like how things turned out.I am excited for the next season and where it goes. Hoping it comes sooner rather than later but here's to another Boxing Day release for 2020 ( fingers crossed)."},{"id":"rw7451171","title":"repetitive","starRating":"4/10","datePosted":"17 October 2021","text":"DAMN! Don't you want to see something different for once? Season one - too close to home:\nThe girl is stalked the girl dies\nseason two: a little more intriguing, girl gets stalked girl is also psycho\nseason three: what the hell! Like seriously? We are just doing the same stalking again that ends with a girl dying\nGET A MORE CREATIVE PLOT LINE!"},{"id":"rw8949842","title":"Stop watching before Season 4","starRating":"5/10","datePosted":"25 March 2023","text":"Season 4 was the end for me. Same story, different location. No additional creativity. No difference from the seasons before. Joe wants to change. Joe has to change. Nothing is Joe's fault. Joe finds new love that will change him forever. Whooooops! People die but Jow is never suspected as the killer, even though he is the common denominator in each of these situations. Probably also should've gotten a bigger, stronger character to play someone who can overpower any and everyone he has ever faced.The first few seasons were good, but this season was a \"2\" for me. Just continued nonsense, with no real flow to why things were happening."},{"id":"rw7458306","title":"Season 1 Best, Season 2 Good, Season 3 Boring","starRating":"4/10","datePosted":"19 October 2021","text":"They could have done Season 3 in 3 or 4 episodes. No suspense, too many pointless and boring plot lines, and too many lame sex scenes. Huge disappointment. Acting was good although the male vocal fry narrating was a bit annoying. Not looking forward to Season 4."},{"id":"rw5365682","title":"Season 1 was okay. Season 2 rocked.","starRating":"10/10","datePosted":"29 December 2019","text":"I found myself in amazement as characters became more and more evil. By end of season 2 all plot holes fixed while introducing a sort of ying yang."},{"id":"rw4643321","title":"Good suspense","starRating":"9/10","datePosted":"13 February 2019","text":"Good suspense show I binge watched in 2 days. It has a creepy main character that you should dislike because he's a stalker and murderer but yet I was rooting for him. Honestly I was happy he killed the annoying people he did. I'm rooting for the bad guy and I want more. He just a hopeless romantic who will do anything for the girl he loves"},{"id":"rw8747518","title":"Watch Dexter instead.","starRating":"4/10","datePosted":"20 December 2022","text":"Not that I'm comparing the series with Dexter, it's pretty vain itself.Our uncharismatic, unsympathetic killer Joe and the screenwriters will continue to lower your IQ in every episode. Joe will obstinately stick out like a sore thumb in front of the Beck's window every episode, will be able to walk around someone's house as if he's in a video game, and all the iq-lowering stuff.My expectations from this series was not that the main character surprises us with his great intelligence or makes superhuman plans, I just wanted to be able to watch it without leaving my brain aside, but with every episode I became more and more sure that the concept of logic was not in this series. Now I will go and watch some sensible series like True Detective or Mindhunter."},{"id":"rw5359730","title":"Season 2 review","starRating":"9/10","datePosted":"27 December 2019","text":"Season 2 was riveting to say the least and kept me on suspense till the very merry ending except for the last sentence. It doesn't make sense to the new joe/person that has become a father who knows the difference between right and wrong. Why would he think of jeopardising his/his daughters life with cheating on his neighbour. Hopefully they turn this show into a family full of psychos and not choke on season 3 by Joe throwing his family life away."},{"id":"rw9025667","title":"Ok hear me out!","starRating":"10/10","datePosted":"30 April 2023","text":"I am a huge fan of the show! I was hooked from the first episode. Beck is by far my favorite girl. Season one is the best. Season two is good. Season three started to get a little shaky for me, but I made it through. I started season four, I was bored out of my mind absolutely hated it, but if you get to season seven just about at the end, the show turns around and becomes the You I once loved. I was actually pleasantly surprised. I almost jumped ship, but I'm glad that I didn't.I think ending it next season is a good idea. But I'm a Joe fan- believe it or not.Kate is charming. I liked her."},{"id":"rw4560975","title":"I'm going to finish, but it's annoying.","starRating":"3/10","datePosted":"4 January 2019","text":"Is the girl drunk all the time, or just a airhead?"},{"id":"rw8953903","title":"Neither a detective story nor a thriller so what is this exactly??","starRating":"5/10","datePosted":"27 March 2023","text":"I gave it a 5 because the acting and the effort were decent I think but the whole plot is depressing many times or a little bit stupid. People are being murdered all the time and there is NO police anywhere. All the main characters are people with serious psychological issues and pathetic behaviors. Parents are abusive or want children just for their image. Being a serial killer or a stalker is faced as something usual etc. So we don't talk about a thriller but maybe about a social drama presented in a soap opera way??I am not sure about it the only thing I know is that this is not a thriller since it is completely predictable and there are no detectives or police or crime investigations. The only scary thing is that maybe people like this are around us...And excuse me this is not a picture of nowadays society we are not all of us so pathetic or addicted to social medias. We like social media as a way of enjoying ourselves however we have real friends,good parents and good husbands or wives. Moreover it is not so easy to commit so many murders and nobody realizes the truth or find so easily everything just by surfing the Net. It becomes unrealistic that is why seems silly many timesThis série has focused only on the mentally sick people so it becomes unbearable.1st season started interestingly so did the 4th but they ended ridiculously. Seasons 2 and 3 should have been only one! Many useless episodes,predictable plot and more mental issues again!I skipped many episodes I couldn't stand so many psycho people sorryyyyy."},{"id":"rw8410228","title":"Just stop after season 2","starRating":"6/10","datePosted":"7 August 2022","text":"Season one was slow but good and season 2 really picked up. Great writing and excellent secondary characters the first two seasons were classic Netflix drama. Then season 3 hit and the rails came off the story. Everything that made the first two seasons great is absent in the third including the heart of the show. If you watch and just stop after season 2 you get closure and the writing won't destroy the characters you love."},{"id":"rw8872269","title":"ridiculous","starRating":"1/10","datePosted":"15 February 2023","text":"Trying to be edgy but failing miserably, super cringe monologues and fake conversations.Truly a pathetic show, trying to raise eyebrows by mentioning anal and blowjobs. They're trying to be \"down with the kids\" but it's just so awkward and obvious.The main actor is decent, I don't understand why he accepted this role.I have never been bored so quickly by a show, it's the kind of basic nonsense like that show about a beach and a girl with sexy lips, the shores? Oh wait \"Outer Banks\" I think. Something like that, the girl from glass onion.Man what a dumb show. This is borderline unwatchable."},{"id":"rw5357810","title":"What happened with Season 2?!","starRating":"1/10","datePosted":"27 December 2019","text":"What happened to this show? Season 1 was fantastic! And I was so looking forward to Season 2, but it is absoloute crap. Save your time and don't bother"},{"id":"rw8878535","title":"First 3 seasons were great, but season 4?","starRating":"6/10","datePosted":"18 February 2023","text":"I found the first three seasons to be very captivating and I was really looking forward to Season 4.Unfortunately Season 4 (part 1) has been a challenge to get through. I just can't relate in anyway to this friend group he has gotten into so quickly, and not sure how anyone can get attached given their attitudes.Truthfully this 4th season part 1 is just plain boring as a result. If you end up not really caring for the characters or connecting with them, then what does a show leave you with?But let's not forget seasons 1-3 (particularly season 1!). That era demonstrated excellent writing, wild plot twists and just an all around excellent viewing experience. 6 out of 10 overall as a result.Ps. Update - oh boy part 2 of season 4 is even more unfortunate."},{"id":"rw4583110","title":"Fantasticccccccc","starRating":"10/10","datePosted":"14 January 2019","text":"It will sure keeps you hookedtill the end\nIts full of mysteries\n.\n.\n.\n."},{"id":"rw8937686","title":"Season 4 is terribly boring and ruins the reputation of the previous ones","starRating":"1/10","datePosted":"19 March 2023","text":"Season 4 is so terribly boring that it ruins the reputation of the previous ones. First season was great, second good, third okay(ish) but the fourth is so dumb and boring that there are no words. Every episode is a completely unrealistic one full with actions and events that would not at all happen in real life or even the dumbest people would resolve. People don't act so illogically. It really is a pain to watch. With this rapidly falling trend of quality I truly hope there would be no further seasons. An absolute disgrace what they have done with this series. Terrible acting, terrible script, monologues/narrations in the guy's head just extremely overdone, but the worst is the storyline. Very dumb."},{"id":"rw5380371","title":"Season 1 was fun...then Season 2 had to ruin it","starRating":"4/10","datePosted":"4 January 2020","text":"Season 1 was very intriguing and kept me interested! Binged it actually. Then season 2 took all the wind out of my interest.Potential spoilers below.The show turned into a poor Dexter copy and political propaganda. Like what happened with the writers? Constant use of \"male privilege\", \"white privilege\", \"white male privilege\", and blaming all them for everything. Even joe uses those phrases too often. I feel he is more unbiased to norms. But this is clearly altered to fit a narrative for viewers to like him more. And it feels like a lot of feminism and LGBTQ characters are thrown into our face. Making them the more accepting and good people. Any white male is nearly bad.And Love. She was badly named and written. The ending is so predictable. Her name alone is a give away. Even the \"Quinn\" part. Think Harely Quinn. You know how she loves Joker? The bad guy who kills? And you know Joe, who's a skinny dude who kills? So much unoriginality in this and easy to guess outcomes it's ridiculous.They lost sight of what made the first season so good. They instead went to make it a political campaign, throwing in already known themes from other shows, trendy words, and playing the typical cliches found in two killers as a couple already explored better in Dexter and Joker/Harely Quinn.If season 3 is to happen, drop the political force feeding every other scene and unoriginal copying. Just start from the roots again. Don't waste the talents of the wonderful actor and actresses.Thanks for reading. And PS, loved seeing the beautiful twin from Hill House on here. She's wonderful."},{"id":"rw7452573","title":"2nd half of season3 is so bad......","starRating":"5/10","datePosted":"17 October 2021","text":"It was like watching the writers' room trying to cobble together a product in haste.Add Diversity? Disabled working class gay man who wants to adopt another child. And some non-white women.Rant about woke culture, Rant about the conservatives, Rant about toxic masculinity, Rant about how pathetic women are... wait, we're feminists, whatever, we just need to make actors say those lines on how hard it is to be a good wife repetitively. What's really important is to make this thing look like a psychological thriller. 1.psychological? We can only imagine the mind of Ted Bundy, so we're going to do what we're good at, joe's inner voice, poor little boy, 50% of the work is done. 2.thriller? We try so hard to make the plot work, especially the last episode, it's so obvious that it's hilarious. Oh we need it to be bloody too so add that gore. And we'll have another season, the audiences are delighted.I support arts centered around the ugliness of human, but I'm one hundred percent not interested in another season of inner voices of a stereotypical deceitful male trial killer. One season was enough, the end of the 2nd season gave me hope that it would add more perspectives, and the end of season 3 is the opposite of that hope."},{"id":"rw8970608","title":"Season 4 Nadia is beyond belief","starRating":"3/10","datePosted":"4 April 2023","text":"This young college student seems to know what up and takes all of a few minutes to get into Joe's apt, then soon discovers the key, and her friend sends her phone pics of Joe holding a Indian restaurant bag and then she searches a dilapidated old building and then goes by herself in the creepy dungeon type basement and finds the door the ket fits. In a matter of about 3 minutes Nadia finds something Scotland Yard would take months to figure out. Hoping Joe disposes of Nadia soon.She's as obnoxious and bothersome as the 16yr high-school girl in LA who got in the middle of everything Joe was in."},{"id":"rw7485019","title":"The five stars for the first half of the first season","starRating":"5/10","datePosted":"27 October 2021","text":"With a highly unsatisfying and dragged out last few episodes.It started off well with the creepy stalker but then when his victim learns of some terrible behavior the plot does not reflect that, she's in grief and phones him up and bingo, on again, with no discussion about his awful deeds.It meanders on through these 10 episodes and there is absolutely no resolution, it all seems extremely childish as it's evident he kills his girlfriends when they \"misbehave\", etc.But he gets away with the murders and Series 2 opens with him carefree in California and if you're like me, you turn it off never to be seen again after 10 minutes of the first episode. He is now tiresome and predictable and just an awful violent controlling male you can't care about.It's a twisted ugly slant with the POV being the killer's and includes his voiceover and that wears very, very thin.Odd how these women don't have families/friends chasing him down relentlessly as they would in real life.5/10 but only for the intrigue of the first few episodes."},{"id":"rw5456664","title":"SEASON 2 DROPS MY GREAT RATING TO OK-ISH","starRating":"6/10","datePosted":"3 February 2020","text":"Sad that after a great first season the writers managed to create a overly slushy, unrealistic mess.Actually it is so ironic that the first series, set in NYC, was edgy, intelligent and stylish.The 2nd, set in LA, is vapid, melodramatic, vacuous, and very LA. 🙄"},{"id":"rw8916944","title":"Getting really contrived","starRating":"5/10","datePosted":"10 March 2023","text":"I enjoyed the plot twist of Season 4 part 2, especially considering how abysmal Part 1 was, but come on...it's ridiculous. Joe is just a killing machine now and somehow doesn't get caught.He killed Tom Lockwood who is supposed to be a mega billionaire and super important person like it was nothing. How can such a person not have some kind of security detail? And all these public murders in S4 and not one camera around or person captures it?He frames Nadia for all of it but how does that even work when she doesn't even have a motive. Really weird storyline in S4. I hope Season 5 is better but I don't have hopes."},{"id":"rw4519117","title":"Spotted: Lonely Boy has his eyes set on a blonde, sound familiar? XOXO....","starRating":"8/10","datePosted":"18 December 2018","text":"**SPOILERS**\nJoe (Penn Badgley): \"There you are, every account set to public. You want to be seen!.\"I mean this isn't 'Gossip Girl' this is darker, so much more darker.\n'YOU' is a brand new psychological thriller based on the novel with the same name written by Caroline Kepnes.\nMeet 'Lonely Boy' Joe Goldberg an ordinary New York book store manager who quickly falls in love with customer Guinevere Beck a wannabe writer.This works perfectly due to his knowledge of the literacy world and even helps him flirt more effectively with Beck as time goes on. From the get go he is obsessive, he want's Beck in his life, slowly making his way through her social media pages building up an immense knowledge of her profile. Kind of like 'Criminal Minds' but not for anything good.\nIt turns out Beck has another man in the picture, a man that only seems to use her for sex, Joe finds this out and tries to give her the respect she so definitely wants but she doesn't budge. Until, Joe kidnaps her eh, bed partner Benji and when Beck tries to get in touch with him Joe has his phone controlling the narrative.Then there's Peach who is also obsessed with Beck and totally in love with her, so when Joe comes along, this guy who will do anything for Beck makes Peach decide this guy is a threat to their future together so does everything in her power to destroy Joe and Becks connection even going to the extremes of trying to guilt trip Beck into staying in Paris with her.\nOverall the show is very well written, it begins as a slow burn and gets more and more exciting as it goes on. Penn Badgley and Elizabeth Lail both take turns at narrating this series and Lail also takes her turn at being the stalker which is a nice wee turnaround fitting with the overall narrative, it's as if Joe has subconsciously rubbed off on Beck making her unknowingly take on those creepy traits (For example Joe gets a new girlfriend and Beck keeps turning up infront of them)\nIn a show filled with murder, lies and stalking where none of the characters are actually good 'YOU' is a show that hooks you wanting more.\nLuckily it's been renewed for a second season so we get to see more of what Joe will get up to and after that rollercoaster season finale the audience deserves much more to get their teeth into. The trailer below shows you that they wanted to give it a love story feel but as it goes on the darkness becomes more evident in that world. I would highly recommend this show that will have you criminal profiling everyone in your life: A high 8.5/10 from me on this one!!"},{"id":"rw5417850","title":"Really good until the end of the last episode of season 2.","starRating":"7/10","datePosted":"18 January 2020","text":"The series should have just ended at the end of season 2. Joe had everything he wanted and spent all season trying to prove he could love someone and be good to them. Granted Love and Joe are twisted and damaged and had done some heinous things, but they had a chance to settle down and raise a child in a loving home. At the very end of season 2, it all seemed like the season was a waste, where Joe was back to square one and it was like he wasn't even the same person in all the previous episodes."},{"id":"rw7495366","title":"Spoiled by extremely clumsy and forced jab propaganda","starRating":"","datePosted":"30 October 2021","text":"The extremely clumsy and forced jab propaganda in Season 3 is pathetic. Guess what Netflix, Pfizer, Morderna, Johnson & Johnson etc. Have in common? Same majority stakeholders, Blackrock and Vanguard. Drawing parallels between being critical to mRNA-jabs and measles vaccinations? Are you kidding me? So desperate!"},{"id":"rw4735323","title":"YOU should watch","starRating":"8/10","datePosted":"21 March 2019","text":"The only bad thing about this is the fact that Beck is so dumb and sleeps around with anyone she touches. Overall a creepy good show to binge!"},{"id":"rw5357840","title":"I dropped rating from 10 to 3","starRating":"3/10","datePosted":"27 December 2019","text":"I thought it was just me but when I signed in and read the reviews for Season 2 I quickly realized...it just stinks. It is no where near as good as Season 1...it is dragged out, boring, silly, no longer keeps you on the edge of your seat wondering where the story will go next...it just goes all over the place. I had to watch some areas of each episode over. I am only half way through episode 3 and I am quitting. Is it because it switched from Lifetime to Netflix?...I really don't think that should matter. The writing should remain constant."},{"id":"rw7477469","title":"Season 3 killed it","starRating":"2/10","datePosted":"24 October 2021","text":"Every show or movie on Netflix is completely ruined by politics and their agenda. I just want to watch shows without being reminded of the real world. First season was good, second was ok, third sucks."},{"id":"rw7480493","title":"Season 3 I thought my TV is broken..","starRating":"3/10","datePosted":"25 October 2021","text":"... Because of weird focus on screen, like the one on mobile phones where just one point is in focus and the rest is weird.Also, seeing today that season 4 is in making, I lost the will to watch. Season one was good. Now it feels like milking the fame until there is nothing left. I mean, it's interesting to see how obsession is being born, but how many seasons will this be repeated?I was expecting to see Joe on the other side, trying to escape the grip, not this. Boring. And I agree with one review here who says that everything is so overdone in how it looks, totally unrealistic. Not that killing that many people without being caught is, but still..."},{"id":"rw7658637","title":"Why are y'all so negative?","starRating":"7/10","datePosted":"18 December 2021","text":"I actually think it's a good series. No, of course it's not the best thing ever, but it's very enjoyable.The series is about a man named Joe, who stalks women and does everything to protect them. He is also the narrator, so that way we understand why he does the things he does and what he thinks while doing it. We keep getting deeper and deeper into his mind, which is very interesting. That's my favorite part about it, because it becomes clear that he tries to justify every action by making himself believe that it was for a good reason and he really tries to get better. It does make you have sympathy for him, which is not good of course since he's the bad guy. His thoughts can also be funny and sometimes I even agree with him. I actually relate to him (not with the stalking and killing of course, but with personality and the way he sees things) and that's kinda scary, but aside from that it's really good.You also get flashbacks from his youth which slowly make clear why he gets so obsessed with certain women and what's his pattern. At first I thought the second season would be the exact same but with a different women, but that actually wasn't the case. There's a whole new storyline and a major plot twist!Sometimes the side characters are a little bit exaggerated, but they're still relatable and kinda funny.Most of the acting is not bad either, only Sherry is just too much.I'd definitely recommend it! It has murder and romance, what else do you want?"},{"id":"rw7448556","title":"I cannot stand Love","starRating":"5/10","datePosted":"16 October 2021","text":"I absolutely cannot stand Love Quinn. She ruins every episode with her drama. \"I KILLED NATALIE FOR YOU!!\" BOO HOO!! (WITH PEOPLE IN THEIR HOUSE.) So many other examples but I don't want too many spoilers. She is absolutely the worst part of this series."},{"id":"rw5768298","title":"Unexpected winner for me. Totally hooked.","starRating":"8/10","datePosted":"24 May 2020","text":"Haven't heard of this series until I found this online. Amazed at the storytelling and the plot and its execution. Initially I thought to just watch an episode or two random but guess what... I binge watched all the episodes.Its thrilling, romantic and sensuous at the same time. Watch this series for Penn Badgley. He is simply amazing and very convincing in entire series. Elizabeth Lail looks gorgeous throughout and did a great job..All in all a really impressive production."},{"id":"rw8877991","title":"FIrst two seasons - very good. Third season - meh. 4th Season - SUCKS","starRating":"5/10","datePosted":"18 February 2023","text":"This show has gone completely downhill. Fourth season is a joke. I don't want to give anything away, but let's just say it is completely unbelievable. And the transformation of some characters is ridiculous.Joe just rambles on and on with what is now boring self-conversation. The people around him in season 4 are all despicable. You don't care a lick for any of them. You pray throughout season 4 for Joe to get caught and put us out of this misery (I have not finished season 4 yet, so I don't know if he is caught or what happens).Just based on this season, I would rate it a 1 and tell you to run far away from this. However, the first two seasons are very good. So, stop after season 2."},{"id":"rw4465150","title":"Well...","starRating":"1/10","datePosted":"18 November 2018","text":"It's like Gossip Girl meets American Psycho had a baby and was disappointed by its life choices."},{"id":"rw8960176","title":"First season is great","starRating":"7/10","datePosted":"30 March 2023","text":"You is an intriguing blend of crime/romance/drama/comedy. The series follows a protagonist who is a stalker and provides frequent narration of his inner monologues, rationalising his actions as he goes as far as violence to get what he wants. Akin to shows like Dexter, the writers, actor and directors do a pretty impressive job of leading the viewer to develop sympathy for an anti-hero. He is essentially quite flawed, but there's some inherent redeeming and relatable qualities that lead us to forget how depraved he is. The series starts off well and personally I feel gets less moreish as the seasons pass."},{"id":"rw7450650","title":"Say It With Me: Get Woke, Go....","starRating":"1/10","datePosted":"17 October 2021","text":"Someone needs to tell this show's writers that a series about a psychopathic stalker/murderer venting his urges on a cast of morally bankrupt characters is not a good vehicle for social commentary.I'm actually angry about what they've done here. You began as a taut psychological thriller based on criminal psychology, giving the audience a peek into the mind of a man who is not above stalking, breaking and entering, or even murder, yet who is able to justify his crimes to himself to the extent that he believes himself a frustrated romantic hero still on the hunt for his soulmate. It was addictive, fascinating, and surprisingly humorous, poised to become one of my favorite binge-worthy series. Season 3 carried on this tradition....for about two episodes.This has got to be one of the most insulting attempts to weave political commentary into a show that I have ever had the displeasure of witnessing. Every situation and subplot is engineered as a vehicle for lectures on Important Social Issues. We need a scene where Joe's delirious wanderings lead him to accidentally chat with the target of his scheme? Let's give him measles and spend the next three episodes whining about anti-vaxxers! His latest obsession happens to be a black woman? Let's use that as a platform from which to preach about intersectional feminism and also never follow through on her earlier characterization as an obnoxious, self-righteous busybody once we decide to turn her into a martyr. I swear to god, the subplot about Love's mom losing her mind and burning down a vineyard was only added so Joe could make a snide remark about how rich white women get off easy in the penal system. Seriously, the scene happens and then it's dropped. By the time Joe was being treated as a struggling but good-hearted antihero for trying to ruin Marienne's Evil White Ex, I wanted to throw a boot through the TV. He has no conscience and a body count that would place him comfortably within serial killer territory, but sure, he deserves a pass for all that because he's helping a poor oppressed black woman.Why do so many shows do this nowadays? Do the writers honestly believe that people will change their minds if their favorite shows are hijacked by woke preaching? Do they think that two seasons of good storytelling somehow entitles them to preach and whine when they should be moving the plot along? Do they think driving away most of their fanbase is somehow a badge of honor?I don't know the answers to these questions, and honestly, I probably never will. I do know I'll be skipping the next season."},{"id":"rw7466025","title":"Woke culture strikes again","starRating":"2/10","datePosted":"21 October 2021","text":"Really a suicide warning? Is this where we are in cinema where we need trigger warnings beforehand? It's a fake movie, based on fake characters in a fake setting.But ignore all the gore like slashing and butchering people with knifes, and beating people with bats but oh no! Someone hangs themselves and there's a trigger warning for the sensitive weak ppl out there. Jesus christ."},{"id":"rw6585127","title":"Love it.","starRating":"10/10","datePosted":"11 February 2021","text":"Very well casted and I'm looking forward to see what see 3 will bring."},{"id":"rw9024777","title":"Season 4 has completely ruined this great show!","starRating":"6/10","datePosted":"30 April 2023","text":"Loved seasons 1, 2 & 3. Season 4 we were so excited for, not knowing what to expect....we are at episode 3 and we cannot watch any further. It is DREADFUL. I don't know if it is the British inclusion or the whole rich people arrogance that is everywhere, but we just cannot watch this another minute. There is no excitement in what is happening, the pursuit of his love interest completely is a train wreck after wher that was left in season 3....this season could have been something brilliant, but for whatever reason they decided to completely butcher it. It truly is sad they chose to destroy this show with season 4 after how good the first 3 seasons were. Tragic really!"},{"id":"rw7491016","title":"Season 3 got political","starRating":"6/10","datePosted":"29 October 2021","text":"The producers want to demonize anti vaxxers because of their opposition to one particular type of vaccine but they end up portraying pro vaxxers as psychopaths in this season.Netflix needs to stay out of politics. We don't need it in escapism."},{"id":"rw7456153","title":"Season 3 is Rubbish","starRating":"1/10","datePosted":"18 October 2021","text":"Everything is so repetitive, the writers laziness is appalling.Solution for all the problems is just to kill the actors. Example Theo, finds Sherry and Cary in the basement and in a complete stupid moment he doesn't free the couple and get hit in the had by Love. C'mon seriously?!The show is about pshicopats but that doesnt mean that they always have strenght and opportunity by their side.Its boring, its predictable, its dull... its a waste of time. I even feel that im not watching the same quality that i watched in previous seasons!"},{"id":"rw8972918","title":"Charming... but Messy...","starRating":"7/10","datePosted":"5 April 2023","text":"You is about a man and the women who become the object of his obsessions. It is charming. The main protagonist narrates his frame of mind, and you find his madness understandable, and even endearing. However, several plot choices become questionable, even cringey at times.Season One: the first half is great! It's an exciting thriller. The second half descends into a little bit of a mess.Season Two: the acting is elevated, and you enjoy some wonderful performances bringing unique characters into the series. However, there are some plot arrangements that really asks you for suspension of reality.Season Three: this was my favorite season. Good actors are complemented with tension between the two main characters through their dangerous relationship. I have little criticism for Season Three.Season Four: the first half was fun! A murder mystery wraps you into the series and keeps you guessing. The latter half descends into a mess that makes little sense.All in all, the charm of the actors, the characters they bring to life, the narration by the villainous protagonist are wonderful elements... but it's not perfect due to some dubious plot choices and arrangements."},{"id":"rw4544187","title":"Terrible teens series","starRating":"1/10","datePosted":"29 December 2018","text":"Badly written by amateur teenager like writers and seriously badly acted. Jokes are so bad and almost annoying. There is absolutely no quality to this at all."},{"id":"rw7446371","title":"Great series......... BUT!","starRating":"8/10","datePosted":"16 October 2021","text":"YOU is a marvellous series, no doubt. It is questionable in a way that it makes a borderline psychopath relatable, but it has enough backstory to pity the guy.Well shot, great acting, great plot twists.Season 2 was also good, with more social commentary on vapid people.Now there's Season 3.While the story is still good, I can't but cringe and even be angry at the political propaganda that is so blatantly inserted that it borders on involuntary satire.And the blind gay guy who is with black gay guy is the least of the problem.We are getting lectured about how the system is always against the Black woman in general, and you must vaccinate your kids, or get killed.The vaccination arc is crude and, honestly, I don't think people will take it kindly to being lectured about health by a psychopathic couple.No, Netflix, we don't want your propaganda. Just stick to the basics:\nCast diverse people where appropriate, so no one feels left out, and concentrate on producing good and original content, like \"Brand New Cherry Flavor\", where the feminist agenda is at least subtly put into proper context and doesn't bother you while you watch.Now you have been warned. It takes a couple of cringe exercises to get through those parts, but if you do, you still get a good series that has a lasting impression.Damn, but I'm still angry."},{"id":"rw7487051","title":"Last season helped me sleep","starRating":"6/10","datePosted":"27 October 2021","text":"Last season was pretty bad,i didn t care if everyone died. I tried hard to finish it. I am stil trying actually. And the casting should be better. If they release another season,i won't watch it."},{"id":"rw8983998","title":"Skip the 4th season","starRating":"8/10","datePosted":"10 April 2023","text":"YOU is the story of Joe Goldberg, a neglected child who found comfort in the world of books and later becomes your neighborhood stalker. Who cares, we still love him.Hands down, I absolutely loved the first season. Guinevere Beck is lovely and the whole NY vibe works perfectly. The soundtrack was just a perfect fit and attention was payed to the details and person gallery.Then came the 2nd and 3rd season, which introduced a new female main character, Love Quinn (Victoria Pedretti), who in my opinion is even more intriguing. Well, maybe the story goes in circles, but the scene is still nice and the LA-stupidity kind of entertaining.I can't even describe who terrible the 4th season is. Joe, so I won't bother. Nothing is worth your time here. And everything basically one big ridiculous cliche."},{"id":"rw5360528","title":"You & You 2","starRating":"9/10","datePosted":"28 December 2019","text":"First Season was intriguing and spend some time on development hence a bit slow. Second Season is amazing takes the show to a new level. Penn Badgley the lead actor is good in both seasons but in season 2 his character is completely overtaken by Victoria Pedretti. Her character is just amazing, she's is a great actress, and she did full justice to Love Quinn. If at all season 3 comes i would want to watch it for Victoria Pedretti. Go watch it"},{"id":"rw7469649","title":"Awful Writing.","starRating":"2/10","datePosted":"22 October 2021","text":"Why do I hate everyone in this show? What was the writer trying to do? Is this supposed to be satire? Is this a poke at White America? A poke at Millennials? Gen Z? The characters are just vile, boring, fake and unrealistic.Overall, the writing is awful. Especially the voiceovers. No one speaks like this. Also, Joe thinks he's God's gift to women but why?? He's not particularly masculine or attractive, so don't get it.Season One was okay, the rest are just terrible.I have no empathy with any of the characters at all. That is not good if you're supposed to be invested in watching a series. That can't be the writer's intention, which leads me to believe that they're just not very talented writers.Watch the first season. Avoid the rest especially the 3rd series."},{"id":"rw4483385","title":"Wannabe Dexter series for teenagers","starRating":"6/10","datePosted":"28 November 2018","text":"The fact that You is on Lifetime almost makes you expect that it's going to be a teenager thing, which at certain points it is. It's a Dexter for teenagers. There is just too much drama between all the characters. Drama isn't bad, but teenage drama is something else, it's something annoying to watch when past a certain age. The concept is about the same as the success series Dexter, following a sociopath that is convinced he's doing great things, and this with the narrating voice of the sociopath, in this case played by Penn Badgley, that narrates you everything he does and thinks. It worked better with Dexter than with You, but that's just something about quality. For the rest the story isn't that bad, but it could have been much better. I guess there will be a second season, one that I probably will watch in the hope it gets better, but I have my doubts about that."},{"id":"rw8921460","title":"What happened to season 4?","starRating":"5/10","datePosted":"12 March 2023","text":"For3 seasons they make us believe Joel is a sexual predator and the word 'You' associated with his female prey. Then in season 4, the word You lost its meaning as it just mean another person, Joel also changed completely.The tension in previous seasons built from Joel uncontrollable desire to stalk, desire, attack his female prey and nothing in the world could stop him. This seasons suddenly all of those desire can easily put on hold. It only used as random references to try and connect to previous seasons but Joel now suddenly interested in something else.I'm watching this series as a cat and mouse chase, to see which mouse will get the cat destroyed. But suddenly in season 4, the cat doesn't want the mouse anymore, Joel becomes someone else and I'm here scratching my head."},{"id":"rw5358741","title":"2 great seasons!","starRating":"8/10","datePosted":"27 December 2019","text":"Funny, dark, honest. Great characters.\nIt's not for everyone but if it is for you,\nYou will enjoy it! I highly recommend it."},{"id":"rw6561544","title":"Penn Badgley","starRating":"9/10","datePosted":"4 February 2021","text":"Penn is great in this role and really brings the show to life. The other characters are good as well but penn really steals the show. Good writing and Fun romance makes for a good show !"},{"id":"rw7491113","title":"Season 3 is a waste of time","starRating":"6/10","datePosted":"29 October 2021","text":"I enjoyed the first two seasons but season 3 is crap. It's dragged out, stuffed with political messages and just a boring storyline.The voice-over does almost half of every episode. And I get why; nothing interesting happens.I'm out. No fourth season for me."},{"id":"rw7460559","title":"Is season 2 didnt finish it for me... 3 certainly did","starRating":"1/10","datePosted":"19 October 2021","text":"Ok so what has 'You' taught me in season 3? Well... The creators and hollywood alike have told me that we should root for the people killing a relatively innocent (albeit dumb and ignorant) religious antivaxxer because of the choices he makes. The best part is, they want us to feel bad for the serial killing couple who kills because the man is obssessed with certain women. They try to say 'they tried to kill my son'... Well you actively have killed many peoples sons, and daughters and mothers and fathers. Sooo religious personal choice, bad, like REEEEEALLY BAD. Serial killing randoms, good.... Gotcha hollywood."},{"id":"rw7448591","title":"Was amazing from season 1 to 2, but got woke in season 3","starRating":"1/10","datePosted":"16 October 2021","text":"I loved this show. It was amazing. Great concept, well casted, well written, and great book. This had a really great future until it got woke. I could tolerate a bit of wokeness, but I just had to stop at season 3 episode 4. The wokeness was too forced. If politics were kept out of this show, it would have been one of the most successful series the past decade. But the audience is definitely going to drop after this season."},{"id":"rw8873891","title":"Netflix disappoints again!","starRating":"4/10","datePosted":"16 February 2023","text":"I loved the first two series of You, I was hooked! Series 3 I was 'iffy' and suspected it would start to decline. Series 4, wow...I was hugely disappointed. I enjoyed the concept but how they portrayed it was awful.First off, I don't know why, but I had second hand embarrassment for Joe's narrated scenes...which in some episodes was around 80% of his PoV.....yawn! In the last 3 series, this never use to bother me. I found the text messages he received cringeworthy.I didn't connect to the characters, in fact, I didn't really care for Joe either. The killer was obvious from episode 2 and how it came to light was weak. I have a theory that potential the killer is Joe's alter ego. I'm not even interested in how part 2 will play out. I watched the preview and even Love didn't interest me. I wasn't surprised they'd throw her in the mix somewhere to keep viewers interested.Typical Netflix, a show that is trending, they just continue to churn out more series rather than end them on a high."},{"id":"rw7732551","title":"It's fun to watch but the wow factor is gone","starRating":"7/10","datePosted":"8 January 2022","text":"First season was really interesting to see because the spectator knows that the main character is a strange guy but then they start to know how dangerous he can be to get what he wants . The finale was shocking but rewarding at the saber time. After the first season the story wasn't less interesting but we had to face kind of a deja vu, with all those twists and turns that lead to murders again. Ok, had fun nevertheless, and the finale was also nice. Third season had too much of everything and trying to turn him into almost a victim was the way to make things interesting but well, it wasn't . It has some nice characters, many fun moments but it was a \"part 2\" of season 2 which had another fine ending but without any wow factor . I've heard there's a season 4 coming but I fear that there's no way the quality will get to season's 1 or even 2 levels..."},{"id":"rw8883436","title":"Officially Jumped the Shark","starRating":"5/10","datePosted":"20 February 2023","text":"Let me start by saying that I used to like this show. Almost loved it. I loved the early Dexter meets Mr Rodgers vibe this show put off the first 3 Seasons. But getting to season 4 was a bit of a reach for me. I would have loved to have seen how he escaped America and ended up in England. I think that was a big miss by the writing team. I also liked that the show seemingly changed scenery by ending up in London. The cinematography was fantastic as they really captured London's beautiful sites and cityscapes. This is where it loses me... The writing has a ton of holes in, and I mean a ton. Joe standing outside the building surrounded by police but conveniently and easily snuck past them and investigated the murder scene. There are a ton of scenes like this... Hiding bodies from authorities even though London has one of the biggest CCTV nets in the world. Not to mention the over the top Rich elitist just being more annoying than anything. Like literally zero substance, all while I have a Murderer narrating to the audience on life lessons and values. Stick to your game Netflix, the audience doesn't want to be preached to by a fictional psychopath. But the real kicker for me was when they were pheasant hunting. First off, No one especially the rich use side by side shotguns to hunt pheasants. Nor do they make a pump shotgun sound as they're reloading them. While there are in fact some great directions the show has gone, they seem to have gotten a little lazy when it comes to details. Common guys, you're better than that."},{"id":"rw7448538","title":"Season 3 is so meh","starRating":"4/10","datePosted":"16 October 2021","text":"As I love this series from season 1 and season 2 but season 3 is really mediocre not only the characters are so shallow this time around love is so unbearable and unlikeable for this season I dont mind a baby storyline but its so weak its hard to work with it would have been better if they didn't add it. I'm not hyped for season 4 its becoming like stranger things only with 2 good seasons."},{"id":"rw8873933","title":"Engaging psychological thriller turns into a horrible Knives Out murder mystery","starRating":"2/10","datePosted":"16 February 2023","text":"Season 1-2 were enjoyable, season 3 already mediocre and farfetched but it kept me coming.Season 4 though... my oh my what have they done? This is just so annoying to watch even and Joe being the narrator for like every episode is so stupid and boring. Character build-up is non-existent and definitely not interesting. Season 2 made me fall in love with Jenna Ortega, but season 4 made me just hate everyone lol.It's like they wanted to try something else but still keep the original stalker Joe in the loop with his social media thingy, but no its just so so bad. The only person that was somewhat interesting was his pupil in class, they should have done more with that storyline and maybe put Joe up with having an affair with her."},{"id":"rw7447576","title":"5/10 for the good season 1/2....","starRating":"5/10","datePosted":"16 October 2021","text":"I'm so disappointed by season 3 :(, don't get me wrong season 3 had it's good moments, but ultimately the ending just didn't feel quite right. Either way watch it and decide for yourself."},{"id":"rw7450620","title":"Terrible","starRating":"1/10","datePosted":"17 October 2021","text":"Watched ep 1 season 3 which was terrible enough but gave it a chance and watched ep 2. That was a mistake. Can't watch it anymore. Save yourself and find something else to watch. It bored me to death. Just terrible."},{"id":"rw7451273","title":"Just binge watch the first season, and forget the rest.","starRating":"7/10","datePosted":"17 October 2021","text":"I really love the first season, the plot and characters really get me hooked. But I can say the story is getting boring and average after the first season, especially the third one. After all, it's a thriller, so it should make you thrilled when watching it. I find the story is getting lame with no more surprise.I think this is time for Netflix to end this show with a good ending, unless it will be too long and boring with a similar rhytm from one to another season."},{"id":"rw8916930","title":"Not as good as it used to be","starRating":"5/10","datePosted":"10 March 2023","text":"I just finished season 4 and I don't know if I will be watching season 5. I used to love the show but it's not the same anymore. Don't get me wrong the performances are still great but it's not as fun as it used to be. In my opinion the show should have ended by now and he should have been caught. I mean come on...he has killed at least 20 people,nothing happens to him and the same story continues..You just know what to expect. It's better to end the series at the right time rather than keeping it going and ruining the plot. I watched the last episode of the season and it was quite unfulfilling because nothing new happened. He got away with everything and he \"started\" a new life,just like the previous seasons."},{"id":"rw4331061","title":"You Are Being Watched","starRating":"8/10","datePosted":"10 September 2018","text":"Dan Humphrey turns into a psycho. Penn Badgley shows he is not just the nice guy in this series made from a novel. I have not read the novel, so I cannot say anything about it.The rest of the characters in You are all portrayed as idiots or in need of a savior as in the case of Beck the girl he is \"in love\" with and follows. We are viewing it through Joe's eyes, so he might not be a reliable source. Time will tell.As a television series, I am wondering how American television will milk this for more than one season. Hopefully, they will do as the British television makers and do it as a mini-series.I am looking forward to see where this go next week. Hopefully, it will stay on the track it has started on."},{"id":"rw5366552","title":"Season two way better.","starRating":"9/10","datePosted":"30 December 2019","text":"Season one was just annoying, between Beck, Peach, and Benji. Glad their fate was sealed. This one is nothing like the first. Joe and Love had way more chemistry together. I liked the fact the writers gave props to Dexter too. It was like addressing the elephant in the room, because it definitely had the whole vibe going at some points."},{"id":"rw7449106","title":"Netflix Ruins Another Show","starRating":"4/10","datePosted":"16 October 2021","text":"Its pretty demoralizing watching a great show just get consumed by wokeness. Why can't these showrunners help themselves? There is nothing gained from shoving awkward political stances into an unpolitical show. Its just off putting, like they are subtly trying to change my opinion on life and politics while I am trying to be entertained. Just add it to the list of a show that has promise taken over by people with anterior motives."},{"id":"rw7668666","title":"Loved season 1, following seasons feel a little bit more generic.","starRating":"8/10","datePosted":"21 December 2021","text":"I really liked the first season, so much so that I watched all 10 episodes in a couple of days (for context, I'm not someone who usually binge watches shows). The storyline was dark and creepy yet it was done in a way that makes it seem more light-hearted than it's actual content. I loved the artistic style of being able to hear the main characters thoughts it was really effective at making you understand the characters motivations. The introduction and resolution of conflict is well developed and manages to build jeopardy whilst keeping you guessing as to what is coming next.I personally found the second season a lot worse, largely as it felt like a transitional season. It started off with similar vibes to the first as the main character takes a similar job, uses the 'cage' same as in the first season and a lot of the characters felt copy and pasted from the first season with some details changed (the troubled neighbour, the conflicted love interest, the murder conflict and resolution) It also felt toned down from the first season (Joe is undoubtedly less of a stalker and his troubled upbringing is introduced maybe to help soften feeling towards him).The third season acts as a continuation of the second with the same key characters in a new location. It takes a further step back from the first season in style and feels much more like a conventional drama (with murder, cover-ups and adultery).I would probably give the first season a 9 but later seasons bring that rating down slightly. The main issue for me is that the first season didn't feel like it was written to be a multi-series show and as such it's a little disconnected from the other seasons and there is definitely a change in Joe's character, he becomes less obsessed with knowing everything about people and a lot of his inner monologue is about his feelings rather than justifying his actions. Those changes make the show feel more generic and although the story is still compelling it doesn't feel as fresh or different as the first season did."},{"id":"rw7472881","title":"An excellent thriller... for the simple-minded","starRating":"1/10","datePosted":"23 October 2021","text":"Updated for 4th season.There were so many stupid things about this show, but now they took it even further.Gosh, this never shutting up voice over, commenting everything, to the most paltry detail... That man loves listening to himself, he's criticizing everyone around him, like he's the universal moral compass.And this chapter about \"rich people are all mean, dismissive and superficial\", how pathetic and demagogic is that? Talk about subtlety...But what really took the cake was when he's \"feeling bad\" for street thugs who attacked a woman because they're \"so desperate that they need to do that\"! Come on! Made me wanna puke, that is disgusting plain and simple. How low are you going to stoop, Netflix???I kinda liked the 1st season, in a \"guilty pleasure\" kind of way.Everything is first degree, artificial, impossible to relate to, and I personally find Penn Badgley annoying and charmless. Even his Dexter-like voice-over gets boring real quick. The guy tries so hard to sound mysterious and dangerous, yet oh so sexy-in-his-own-wicked-way...But somehow it worked in the beginning, the pace of the show makes it up for its countless flaws.I can't say the same about the 3rd season, where they're taking the far-fetched factor to a whole new level. I don't buy the plot for a second, that Marienne thing is so fake, you can almost smell the writing team's sweat all over it.It gets from meeeh to plain ridiculous."},{"id":"rw8423946","title":"Stop at season 1","starRating":"5/10","datePosted":"11 August 2022","text":"As a wannabe Dexter season 1 gets 7/10th the way there, but season 2 seams to have been written by a couple of teenagers that have absolutely no concept of reality or believability. Did not want to suffer more by watching season 3."},{"id":"rw4613581","title":"Creepy","starRating":"8/10","datePosted":"29 January 2019","text":"Penn Badgley does and outstanding job taking creepy stalker to the next level.It took me until episode 4 to really get into the show, after that it was a rollercoaster ride that had me holding my breath at times and on the edge of my seat others. This show has some truly evil characters besides the obvious one and very few innocents.There were a few unbelievable moments, but it is rare for a TV show or movie not to have those.Excellent show that I was lucky enough to be able to bing watch from start to finish."},{"id":"rw7456664","title":"Season 3 Review","starRating":"8/10","datePosted":"18 October 2021","text":"Season 3 of You was overall a pretty solid season. I disliked that there was less of the classic Joe in this season, he was still present, but not as much. I guess it's a good thing that his character is evolving, but I like creepy Joe. Love as an additional psychotic character this season is really cool and worked well. The dynamic between Love and Joe is really well written.Compared to previous seasons it felt more tame throughout the middle part. Of course it ended with a lot of stuff happening, but the middle was a little slow at times, but mostly pretty good.I wasn't a big fan of the ending. Everyone just seemed to get out of it fine and have their happy ending. Besides Love, everyone ended out fine in the end, which I think is just poor writing. Of course some characters need to survive, but others should die to make more impact. I think either Cary or Matthew should have died to add a bit more to it. They could have done it, it's not like they will be reoccurring characters, unless they will be which is dumb.I'm guessing there will be a season 4, it's a pretty popular show. I wonder where they will go from here on out, their is only so much they can do. Season 2 was great, but basically a repeat of Season 1 formula. This season changed it up drastically, but I wonder how far they can keep going. Can't wait till season 4."},{"id":"rw8391844","title":"Terrible 3rd Season","starRating":"4/10","datePosted":"1 August 2022","text":"It started as a well written, thought provoking show. The 1st season was a solid 8 out of 10, the 2nd season was decent too.Then the 3rd season, if I'm generous I'll give it 3 out of 10.Paper thin plot padded out with nonsensical sex scenes, none of characters were even remotely likeable.I shall be giving season 4 a wide berth."},{"id":"rw8900498","title":"Should have quit after season 2","starRating":"4/10","datePosted":"1 March 2023","text":"Not sure where to start. Series 1 was a little intriguing and bingeworthy. Seasons 2 and 3 were decent. Season 4 is beyond woeful. I've not seen a tv series nosedive this quickly since the latter seasons of Dexter. It's beyond parody. Every character is unbelievable and deplorable. Police are clueless. For the record we don't all speak and act like this in the UK, it's actually an insult. Actors are terrible. And we don't need to hear the word YOU in every single sentence. It's so so bad. Why take what was an interesting, is extremely far fetched, premise and then turn it into a really poor murder mystery? I doubt we'll finish this season, it's tough to watch it's that bad."},{"id":"rw8886319","title":"Meh","starRating":"4/10","datePosted":"22 February 2023","text":"Average writing, lots and lots of violence and gore. Boring Acting is average. Penn is not good at comedic efforts. So it falls flat there. Kind of a waste of time. Only watchable when absolutely nothing else to watch. Don't see this lasting much longer. It's infuriating that the writers seem morbidly interested in this sickos methods and execution. Just what our violent sick society needs MORE VIOLENCE AND SICKNESS! Trash this one ASAP. Give us more intelligent zero violence shows to watch. We don't need this extended view of a psychotic mind....again it's in the news DAILY. Our world needs inspiration to be better in every way."},{"id":"rw5098581","title":"Abused becomes the abuser as we look at the story from Joes perspective to the reasons why he does what he does for love and how far would you go for love too?","starRating":"10/10","datePosted":"3 September 2019","text":"This series is captivating really puts you on edge at first you think Joe is a psychopath stalker and killer, when he starts to follow Beck the woman that he meets in a bookstore and she immediately gives him her email address in a flirtatious way for herself while having a boyfriend already also known as Benji.\nJoe starts to become obsessive checking social media for Beck finding people that will get in the way, like Becks Boyfriend who is a drug user plus drug dealer that he is a bit psychotic too, as well as we later found out he murdered a few people in cold blood where he kept a video documentation of it. Anyway, Joes way of dealing with Becks Boyfriend Benji is to lock him in a bookstore basement with the soundproof glass prison type room that is claustrophobic. We later find out after Joe was abused as a child by his parents the owner of the bookstore takes him in then becomes Joes only father figure who he loves dearly.\nI start to feel sorry for Joe where we later find out that Joe got locked in the same basement when he was younger to teach him a lesson that just added onto his overall trauma thinking it is okay to lock people in basement for their own good that is obviously not, nevertheless the bookstore owner did it out of love for Joe. Cutting a long story short Joe kills Becks best friend Peach who is obsessed in love with Beck and would do nothing to single her out to have Beck to herself even booking flights to Paris, if you ask me, she reminds me of Joe in a way. They both keep documented evidence, Joe in a Box above his bathroom in the drop ceiling, where there is sentimental pieces like diaries, pictures, pieces of clothing, for example bra, underwear you get the picture, murder evidence like Benji's teeth that he could not burn as the body could be easily identified by the cops. Peach kept digital documentation on her laptop for blackmail, like pornographic images of people who she has been obsessed with especially a lot of pornographic images with Beck on, therefore we are dealing with two people who will do anything to get Beck to love them.\nWe find out that Beck has Daddy issues which everything is a mess her Dad has practically a separate family, also Beck cheats on her past partners a lot while she persists on lying about it for herself, she even cheated on Joe with the therapist that she lied about continually as well. Joe has love for people like Beck he just sees it as protecting her, in addition this one kid in his building called Paco where the mother is also in a abusive relationship with a her boyfriend who is a parole board officer, we later find out that he knocks her about and the reason why she haves him back is that he could use his contacts to take Paco away.\nJoe has a past relationship where Beck is determined to find out more details on a woman called Candace Stone, finding out that is not simple as she randomly leaves the country after having an affair behind Joes back with the record label producer to get signed up as a singer. Joe finds out confronts the record label producer killing him by pushing him of the roof years ago, where he learns how to cover it up and create a social media trail, so people think he committed suicide rather than just murdered linking it back to Joe. When it all comes to ahead Joe and Peach has a showdown of course Peach suspected Joe from the start especially after getting assaulted by her stalker in central park while out on a run, which eventually at Peach's house she sees Joe and shoots him grazing him on the leg Joe plays dead with very little blood. After Peach goes up to him to make sure that the job is done Joe gets her on the ground while killing her with Peaches gun in kind of a mercy killing. Before this Peach and Joe had a convosation about keeping it a secret, so they both disagreed mainly Peach it either being Joe or Peach that was going to die obviously Peach in the end. Peaches death ruled as a suicide obviously Beck and Joe try to make it work until Beck dumps Joe for being overprotective and paranoid as I said earlier Joe was right and Beck did cheat on him with her therapist. Middle of this Joe has a steady Girlfriend then cheats on her with Beck, therefore eventually dumping her.\nPrivate investigator turns up suspecting everyone thinking the death is a murder not a suicide of course he is right still trying to gather up evidence strongly suspecting Joe. After another forgiveness again Beck doing it all for herself with Daddy Issues, Beck finds the evidence after Paco said Joe said hiding objects in the drop ceiling above the bathroom is a great hiding spot for Paco's Book, which Beck goes in there finds the evidence, Joe finds out she knows knocks her out as well before she escapes, locks her in the basement down to love for days while she was on a writing retreat her friends thought as Joe posed as her on social media saying that. Joe lets Beck out eventually where she stabs Joe with a type writer keys that are very sharp after kissing him to try to escape, Beck locks Joe in the glass prison, Beck tries to escape and there is extra fence after the basement door not letting her, she sees Paco asking him to let her out he does not say anything and leaves, Joe gets Beck down after opening with hidden spare keys, Beck hits him with a mallet, Beck attempts to use the keys then Joe mercifully in his eyes kills Beck.\nThe reason Paco did not help Beck is that before this Paco tries to steal gun from the bookstore stored under the counter desk and gets caught by Joes friend, which Joe takes the gun off him and convinces him not to kill the abusive parole officer. Later on, in the events Paco uses a weapon to whack his mother's abusive boyfriend, he goes to lividly chase after Paco, where Joe sees this and stabs the Paco's Mothers abusive boyfriend in the throat. Paco and Joe cover it up leaving a social media trail where his body is never found. This is mainly because Paco views Joe as a father figure when joe loves him like his own son that really humanises this relationship.\nBecks Body gets planted by the Therapists work where the evidence is already written on a typewriter by Beck mentioning the therapist doing all of these horrific actions in place of Joe who actually did it more to appease Joe. The therapist gets arrested after the evidence is sent in anonymously, then goes down for it even though he is completely innocent, meanwhile no one suspects Joe. The whole trauma gets made into a book published with Becks name on by someone else to tell their story.\nIt just shows with past trauma people can think it is OK to do these horrific actions thinking they are justified like out of love; therefore, you cannot help but sympathise with Joe when he has been through a lot of abuse too when he was much younger age. Usually like with Joe the abused eventually becomes the abuser with reasons justified in his eyes some logical some illogical.\nIn conclusion I rate this a ten out of ten really leaves you on the edge of your seat, especially adding a twist on at the end where this female looking figure tuns up in the bookstore where Joe works, which it turns out to be the presumed dead girlfriend Candace Stoneeven. I wonder how that is going to play out, as I the reason she has visited after reading the news story on Beck I recon she knows about everything she does not look surprised at all, which suggest to me that she might even be a killer herself just knows you never know what is going through someone's mind where everyone is capable off killing for their own reasons justified or not.\nIn addition to this conclusion I highly recommend this ten out of ten mystery series where you will not be disappointed if you watch it in your spare time. I really hope there is a season two of YOU as I really want to see how this plays out maybe Joe seeks a path of redemption who knows we will just have to wait to find out."},{"id":"rw7487066","title":"Third season is such a waste of time","starRating":"2/10","datePosted":"27 October 2021","text":"This series is so unrealistic and the whole story is so dumb it doesn't make any sense. Do not waste your time on watching this. First season was interesting as it hasn't been done before, second season was okay but the third is so ridiculous."},{"id":"rw7455460","title":"Season 3","starRating":"4/10","datePosted":"18 October 2021","text":"Season 1 amazing...season 2 ok. Season 3...fuming!!! Using this season and pandemic for an attack on anti vaxxers is disgusting. It condoned violence (approved by producers obviously) against anyone who CHOOSES not to have covid jab. Pretty low blow and when bias politics enter a non political show...I'm outta there. Won't watch again."},{"id":"rw5355052","title":"I was worried no TV series could do the book justice","starRating":"10/10","datePosted":"26 December 2019","text":"But it did, and then some. Reading the book I didn't get the same very creepy feeling of finding myself rooting for Joe and Beck's \"relationship\" to work out (in the book I found his character to be much more obvious of a narcissistic psychopath). Finding myself cheering inadvertently for a stalker/murderer really freaked me out, and I had to keep checking myself and questioning my own moral framework often. Maybe part of it was the association I have with the actor still from \"Gossip Girls\", but it really was much more difficult to remember who the good person and who the bad person was through this story, and what that says about me!I also looked back on some of the things I've done e.g. I once met a woman at a party, talked all night and she gave me her number and told me to call her, and, yes, I searched everything I could find about her online, looking for some clue as to what type of person she was I think in an impossible attempt to protect myself from getting my heart broken. I never considered how creepy that was of me to do, and I'm guessing I'm not the only viewer who may have had that experience.I didn't know there was going to be a second season until it popped up today. This is the first Christmas Day I've ever spent by myself, and I was feeling a bit sorry for myself, but seeing a season 2 has arrived really perked me up, as weird as that may sound (and as much as I liked the first book, I liked the second one even better and it's also been long enough since I read it to forget most of the finer points, so I'm going to be binging season 2 straight through I suspect). So glad this series found a home on Netflix (though I don't know why they censored so much as compared to the original broadcast), I recommend to anyone I know that's looking for something new to watch."},{"id":"rw7243422","title":"A good romantic crime series ...","starRating":"7/10","datePosted":"19 August 2021","text":"It was a good series, and I can not say that I did not like it. I am waiting for the third season, it is a really interesting series."},{"id":"rw7487745","title":"Relationships, defined.","starRating":"9/10","datePosted":"28 October 2021","text":"UPDATE: 4th season is absolutely worth the watch.This is an incredible show. Every season has kept me intrigued for what's to come. Season three got a bit trippy by the end but it was still worth the watch. I also believe Penn Badgley was MADE for this role.I remember hearing from other reviewers saying \"God help you if you use voiceover.\" It's true, because voiceover can be a cop out. This show however smashes that statement right in the face.The voiceover actually helps grip you into understanding his point of view... and helps carry the show extremely well. I was engaged the whole time. And the fact that his character loves books... well, the whole story comes full circle IMO!"},{"id":"rw7449790","title":"wtf is season 3","starRating":"","datePosted":"16 October 2021","text":"Season 3 ain't even no where near the same aesthetic as the first season . This love character is absolutely nuts . This season wasn't nothing but unnecessary killings and still getting away with it ."},{"id":"rw5478224","title":"So good","starRating":"9/10","datePosted":"12 February 2020","text":"I give 9 rating bcz of some plot holes\nI don't know why I can't decide to love Joe or hate him"},{"id":"rw7332217","title":"Ruined by too many \"wokeisms\"","starRating":"3/10","datePosted":"11 September 2021","text":"Enjoyed parts of it but some of the dialogue got unbearably tedious in the end. For some unfathomable reason, the misandrist \"woke\" (a term I dislike like bile in my throat) writers thought it'd be a good idea to insert rubbish notions like \"privileged white men\" and \"toxic masculinity\" into the script. Sadly, this reflects the twisted world we're creating where the majority have to pander to the tiny minority brigade of sickeningly PC, \"inclusive\" liberals that get their fragile egos and feelings hurt by absolutely everything and anything... Wish they'd just cut out the political nonsense that's completely misplaced! I'd like my entertainment to be free of the constant bombardment of the tiresome narrative that's being pushed down our gullets on a daily basis. Could've been so much better..."},{"id":"rw7446429","title":"Season 3 is rubbish","starRating":"1/10","datePosted":"16 October 2021","text":"Seasons 1 and 2 were good. Season 3 is total rubbish.I stopped watching it when they started pushing the themes of vaccination, anti vaxes etc. Totally ruined the movie."},{"id":"rw7586494","title":"Don't waste your time for the third season","starRating":"8/10","datePosted":"26 November 2021","text":"The first season was quite good, the second was acceptable and the third season should not have existed at all. The story only get worse by the time. I won't change my rate anyway. I sure won't recommend this third season to anyone, whom I love of course."},{"id":"rw4579872","title":"An interesting view of human connection","starRating":"8/10","datePosted":"13 January 2019","text":"This show is definitely one to binge. A lot of the negative reviews here pick at the show for being unrealistic and having unlikeable characters but that's exactly the premis of this show. Some of the characters are purposefully obnoxious to play on the notion of Beck being surrounded by toxic people which she totally is and that she needs to be saved. Joe sees himself as her night in shining armor ready to swoop in and save her from her pretentious friends/ex-lover. As for the show beind unrealistic; I don't believe it is to a drastic degree. Most if not all tv shows/films are unrealistic to some extent but isn't that why we watch them? To escape reality and watch something that's entertaining and thought provoking. This show does just that. It's a great binge that comments on the ease of stalking people and gathering information through social media in a completely realistic and accurate way. It becomes a slippery slope for Joe as he goes through great lengths to \"save\" Beck from herself. The scandal, murder, cover-ups, and plot twists are all just icing on the cake. This show is definitely worth watching till the end although I do feel it should've taken the anthology route and ended with episode 10 but we'll wait and see if the next season can deliver the same charisma."},{"id":"rw9387511","title":"Could do without season 4","starRating":"7/10","datePosted":"21 October 2023","text":"I loved this tv series, up until season 4 (more on that later).The series in itself is amazing and seems super unique, a man who believes in love but loves obsessively to an unhealthy degree is great. There's parts in the series that completely catch you off guard and that's what I love about it. It doesn't skip out on the little details either, I mean they really made the character Joe feel loveable yet threatening.Season 1 was a good introduction to show how far Joe with go for the one he's obsessively in love with. Season 2 was amazing and we finally see him in a relationship where he seems to have calmed down (but we all know that seasonal twist). Season 3 seemed very up and down for me, there's parts that I love and parts I hate. Season 4 however wasn't great at all and ruined the ending."},{"id":"rw7448077","title":"Another good show that has gone to s* because of wokeness","starRating":"1/10","datePosted":"16 October 2021","text":"I loved the first seasons and was so looking forward to this new season. But, of course, they couldn't resist themselves and turn activist/woke with white woman missing syndrome, blaming anti-vaxxers for a sick baby, someone feminist dude studying gender studies and what not."},{"id":"rw7482470","title":"First season great - the rest is clearly improvised soap opera with ridiculously intense woke agenda.","starRating":"4/10","datePosted":"26 October 2021","text":"It is pretty clear that an interesting and internally consistent story of an admittedly original concept of the first season was a product of a creative effort...which definitely fell apart in terrible seasons 2 and 3.It is a show that successfully finished the first season...only to take a ridiculous dive into the mediocre, improvised, illogical mess with a sole purpose of parroting pretty well known hyper 'woke' slogans with a subtlety of a wrecking ball, and acting just as sophisticated. Characters suddenly turn into cardboard cutouts (straight white males are really fun because they have only two types 1-sadistic a hole and 2-growling barbarian), the lead forgets what he is, and the story is all over the place.By the 72th time you hear about a female character who is by definition a domestic abuse victim (whose husband is always from the same race), 'white privilege' or hear the very female-feminist inner thoughts of a...male protagnoist...while the show is desperate to keep you interested with out of nowhere sexual fetishes (where straight husband is okay with swinging, and 'fooling around' with another husband but looses it when he's supposed to sleep with another wife!? ) and what not...you'll already be scrolling your Twitter feed, waiting it to be over, like a bad dream.What a waste..."},{"id":"rw7469253","title":"Bad show","starRating":"","datePosted":"22 October 2021","text":"Season 1 was great 2 was also good\nBut I wasn't even able to watch 3 bcoz its completely focused on the couple and love is so irritating I hate her 😡😡😡 their story isn't convincing at all season 1 9/10 the show as a whole ir bad."},{"id":"rw7454921","title":"Omg how many ways can we ruin a decent show","starRating":"1/10","datePosted":"18 October 2021","text":"Dude if I have to turn on another show to talk about anti vaxxers and missing white women syndrome...Did Joyless Reid write this episode? CNN give them tips? At least the measles vaccine did what it's supposed to do: KEEP PEOPLE FROM GETTING MEASLES."},{"id":"rw7457463","title":"It's goi g downhill.","starRating":"4/10","datePosted":"18 October 2021","text":"I really enjoyed season one and two. Ugh, so season three...what happened? Joe is barely Joe anymore. The character Love is absolutely painful. She damn near has bloodlust with her murderous needs. They have a kid that doesn't seem to factor into their lives much. Love being rich just makes the story more unbelievable. I am noticing they are regurgitating the story from previous seasons. Therefore, it's predictable and uninteresting. If another installment of this show is made, please do not bring Love back in some freaky way. She really ruined it for me."},{"id":"rw8338843","title":"Season 1 it's good, 2 ok, but 3...","starRating":"4/10","datePosted":"16 July 2022","text":"What a boring, tiring and repetitive season. Nothing happens to psychopaths, absolutely nothing. It's revolting. Not to mention the amount of senseless political correct they put in this season. Boring, boring, boring."},{"id":"rw6456181","title":"Really poor, -well, empty, to be precise.","starRating":"1/10","datePosted":"9 January 2021","text":"-Two people with despicable traits. Deserving of eachother? Who cares (Despicable across the line seems to be the go-to in many dramas now-a-days).\n-And/or a storyline with scenes full of plotholes & illogical happenings.\nOr is this supposed fantasy? -Some airheaded millennial/gen z'er fantasy, perhaps.\n18 minutes into ep 1 and I had to drag myself away from\nthis emotional TV black hole and its numbing vacuum..."},{"id":"rw7480623","title":"Absurdity at overwhelming levels.","starRating":"3/10","datePosted":"25 October 2021","text":"Im hooked with season 3... It's addictive to see how every new episode of this show surpass\nthe last in absurdity levels. Un-be-lie-va-ble (add a facepalm)"},{"id":"rw7586279","title":"Stop bringing politics into everything.","starRating":"3/10","datePosted":"26 November 2021","text":"This is a decent show but the amount of politics brought it down from a 7/10 to a 3/10. This is not a show that needs any sort of politics bringing into it but there's numerous bashings about Trump, being a Republican or being Anti-Vax. It's irrelevant what side you're on politically, you should be able to watch a show and enjoy it without being bombarded with what the writers and producers of the show's political views are."},{"id":"rw4575841","title":"Typical modern TV for teenagers and low IQ people - you can get away with anything if you are cute and mysterious","starRating":"1/10","datePosted":"11 January 2019","text":"This show is absolute crap. There is no storyline, other than stalking and stalking. The lead character is a pure evil piece of garbage who would go to any lengths to feed his obsession and is shown as some kind of a misunderstood hero. Why does modern TV justify criminals? Most American.American TV these days is all about 1.good looking people who are average actors, 2.ridiculous script, 3.technical and logical blunders, 4.sex/nudity/flirtation and 5. an evil but misunderstood lead and BHAM! From How to Get Away With Murder to You - that is all there is.You is a disappointment and would only appeal to people who don't think a TV show should at least not defy common sense."},{"id":"rw5411659","title":"What's the fuss all about?","starRating":"1/10","datePosted":"16 January 2020","text":"I heard so much talk about this show and read stellar reviews so I figured I would give it a go... what's the fuss all about!?This show reminds me of most of the garbage and outlandish TV shows you'd find on the CW Network, or something like Pretty Little Liars (which ironically Shay Mitchell appears in YOU as well and seemingly portrays the same role). It is clearly geared towards teenagers and very young adults, and maybe for that crowd the show works. If shallow, snobby characters, slow developing plot, social media overload, and nonsense situations is your cup of tea, then this is the show for you!Some of the things that bug me the most is how inaccurate a show like this can be for the location and setting. For example, the show is supposedly taking place in upper Manhattan where of course the main female character can parade around half naked in her massive apartment window and not be seen because there is no pedestrian or regular traffic around for miles (except the stalker) -- or when the lead female character goes down to the Subway after a night of drinking ONLY TO BE THE ONLY PERSON ON THE SUBWAY PLATFORM OTHER THAN THE STALKER AND ONE HOMELESS GUY. We also see our main characters who are so hooked on social media, and are millennials ride home in a taxi cab, rather than an Uber. Speaking about a NYC taxi... have you ever rode in one? Which personable driver would drive to your destination and then allow you to chit chat in the back seat for 10 minutes. Yes I'm overly analytical, but if you want to have a realistic show then you also must pay attention to detail and get it right!!Onwards... Then you have the typical financial scenarios that make no sense. You have Joe working at a forever empty bookstore where he can't possibly earn more than $10.00 an hour, yet he supports himself in a NYC apartment. Thankfully he has coworker that practically lives at the bookstore, as every time Joe has to leave work for another escapade, the co-worker is there to save the day. Okay.... Beck seemingly has no actual responsibility, neither do her snobby friends. Her \"position\" at the school is come and go as you please, no deadlines, a few poem sentences once every month or whatever she wants... Then there is the young man Paco, who is possibly the only likeable character on the show. His lousy mother and abusive boyfriend completely neglect him. He spends his entire day locked out of his apartment having to feed off of Joe's takeout dinners and be entertained by Joe's books. The kid walks the city as he pleases never is in school, but he is likeable!OH! Lastly the best part of the show hands down is the supersonic hearing that Joe has been blessed with. Or perhaps Joe purchased one of those infomercial earbud sets that can amplify your hearing from across the room. In scenes where the Beck and her friends are at a busy bar or restaurant, Joe can be stalking from 50 feet away yet pickup on the subject of the conversation and intimate details. It's fascinating! Another thing I learned is that if I simply buy a hat and dip my head low, no one will ever recognize me."},{"id":"rw6510648","title":"A gloriously stylized and twisted psychological thriller series","starRating":"8/10","datePosted":"21 January 2021","text":"You is a psychological thriller series on Netflix, centering on obsessive stalker and bookstore manager Joe Goldberg (Penn Badgley) and his attempts to manipulate the people around him in order to \"win\" the affections of someone he is currently stalking and obsessed with. In Season 1, his target was literary graduate student and aspiring writer Guinevere Beck (Elizabeth Lail), while in Season 2 he focused on chef Love Quinn (Victoria Pedretti).The plots of each season revolve around the relationships between Joe, his target, and their various friends and acquaintances. While Joe is undeniably an obsessive creep and stalker stopping at nothing to make his targets fall in love with him, his nice and good-looking facade and sardonic voiceover narration creates a lot of sympathy for him as he accurately takes apart the flaws of those around him, even as he shows himself to be as horrible as the others he despises. Almost every major character is greatly flawed, and the way those flaws play off of each other as the people interact is magnificent. Following on from that, there are few clear cut \"good\" or \"evil\" characters. Everyone is mostly just varying shades of grey, though Joe and some others are more overtly villainous or unscrupulous in their actions.The series has a lot of twists, with each revealing more and more about the inner psychological workings of every major character. It is made clear that while trauma can have a huge impact on people, it does not provide an excuse for their heinous acts. The plot line regarding Beck and her childhood retroactively explains a lot of her issues with attention, being affluent, and having a fear of abandonment. These traits lead her to make various decisions that hurt her friends, and she can be a little callous with lying and being irresponsible. Joe is an obsessive stalker who has a deep need to be loved, but the only way he goes about doing that is to stalk women and manipulate them into a relationship, no matter what obstacles stand in the way of that. He also does not recognize that his behavior is creepy and terrifying. Love has similar issues with her wealthy parents, desiring more affection from them and seeking to close the distance between them. Everyone has a mess of personal issues, and seeing all of that through the eyes of a stalker, someone who would know all there is to know about the personal lives of others, makes for an incredibly entertaining experience.The series is also very well-shot, every scene is filmed in a surreal way that seems rather dreamlike, giving the series a unique aesthetic. Every scene is well-lit and framed in a way that gives a sense that the viewer is watching the events unfold as if they were a stalker themselves.In summary, You is a psychological thriller with intriguing plot lines, engaging and believably flawed characters, interesting twists, and has a unique visual look. It is definitely entertaining and worth the watch."},{"id":"rw5360468","title":"Season 2 is pretty awful","starRating":"2/10","datePosted":"28 December 2019","text":"It started off strong..but quickly got very dull and predictable. The main characters are weak and the acting is annoying. It feels like everyone is throwing a tantrum. The second book was terrible too but I thought I'd give the show a shot. Horrible. Such a waste."},{"id":"rw4655580","title":"Just Terrible I can't describe the cheeze","starRating":"1/10","datePosted":"13 February 2019","text":"I give this A 1 Star because of all the positive false reviews. It really deserves it.\nAfter watching the first season of this Soapopera. You\" plays on all the typical\nSocial Media problems, the downsides of most girls searching for daily confirmation, vlogg, blogs, twitter, insta you name it. So Cought up by the phones that they lost every trace of humble beginnings. Just like in reality. )The lead girl gets then stalked by a psychopath that uses every Internet method to spy on her. But lets not blame him there, cause thats what most of the guys today have to go through to get any response from todays girls.( Eventually succeeding tricking her to fall inlove with the dude. Guenewere 'lead girl in the show Is what i believe 27 something or Older and its mindblowing how naive and easily fooled she Is. Its not realistic in anyway but its a tvshow so bring on the teen drama.. i have no problem with junkfood if it has a personal trait and visual style that doesnt look like all the other 700 Netflix shows. The show wants to be clever but the realism is so far gone. I can with confidence say This show Is so millenial. Angsty young adults and drama filtered through the usual crappy twilight, 50shadesofgrey plot.\nThese shows are hits cause of the millenials that feeds on this kinda clickbait twilight crap."},{"id":"rw9096471","title":"Review 4 season","starRating":"8/10","datePosted":"2 June 2023","text":"The season was really better than I expected, since I felt that they had already lengthened the story a lot. This season is set in London, which I liked because of the images of the city. In this season we see how Joe (who changed his name and started a new life again) tries to leave the murderous, manipulative, obsessive, stalker Joe in the past, we see how he tries hard to be a better person, however we see in the second part how he dissociates having another personality (his bad psychopathic personality, which at the end of the season we see is stronger than his desire to improve (because he really is a psychopath-psychopath), since he dissociates into the murderer of the famous which takes the appearance of a politician-writer who follows and with which he identifies. It is a season with a lot of psychological-psychiatric component, in other seasons we have been seeing how Joe's childhood traumas made him what he is today, Since not having received adequate help caused everything that he is, Joe Psychology In this season we can see a Joe who is afraid, who is more vulnerable, who wants to be a normal person but cannot achieve it. At first I liked that he was not It was based only on a relationship or on someone liking it, however it is not hard, the season manages to maintain its essence. In the end, the truth is, I didn't expect him to do that to his student. The bad thing about the season: Kate's character was not my favorite, she seemed very flattened to me, she is also a bit crazy since she accepted Joe with his \"truths\" and I developed a very fast relationship with him, I feel that she can become a Love, the characters of the millionaires (with the exception of Lady Phoebe who was really my favorite of them because she was not bad, just that they used her and took advantage of her), I would have liked to know a little more about Malcolm's history and nadia."},{"id":"rw6503271","title":"A Great Ride","starRating":"8/10","datePosted":"19 January 2021","text":"I hadn't watched this yet and was surprised how engrossing it is. Penn B is excellent and the whole cast is very good. I love Victoria P from Hill House so I loved what they did with her in this show. As others have mentioned, Penn B would've made a great Ted Bundy. He's a very good actor. I've not seen him in anything before. I love how it's written and the narrating. Very chatty and funny reminded me of Downey Jr's Narration in Kiss Kiss Bang Bang. Entertaining. This is easy to binge. I couldn't wait for each new episode. Season 2 is better, but season 1 is really good as well. Can't wait for the next one."},{"id":"rw4817844","title":"Something New!","starRating":"9/10","datePosted":"30 April 2019","text":"We often hear about boyfriends who are maniac or very voilent but this TV series show a perfect mixture of psychopath but still a very loving boyfriend."},{"id":"rw7447682","title":"Season 3 took a plunge in Episode 3","starRating":"6/10","datePosted":"16 October 2021","text":"I wish not every Netflix Show had to be pushing wokeness, politics and now even vaccines ...\nSo these stars are for season 1 and 2, which I really enjoyed."},{"id":"rw7467045","title":"S3 Ruined the Series, just poor writing","starRating":"1/10","datePosted":"21 October 2021","text":"It's funny how writing nowadays manage to destroy entire series with nonsense and retcons. They made the entire second season to develop Love and her family and all her development as a character to just kill her off this season? Oh come on!! The first 3 episodes of the third season are great, showing that Joe and Love are trying to work on their marriage, they in fact have chemistry, on the contrary Joe and Maryenne (or whatever her name is) have absolute 0 chemistry and the writers try to force it to the audience because...? Joe said he wanted to work on his marriage, and then right after he goes 'Nah, nevermind, I will stalk this woman and I want a divorce'. Love was a great character, they didn't need to kill her that way, I mean, all of S2 was for nothing now to think of it. Sad, it's so pathetic how they handled Joe and Love's relationship, it could've been one of the most intriguing couples on television, there was so much more potential on this couple, the comic relief parts with both of them are actually funny, there was so much to explore with their teamwork. It's sooo sad that they went the lazy way.OMG, Theo's father was the ENTIRE season watching camera's records and then Theo after 10 seconds watching one of the records finds out the crime proof. What a stupid writing. I won't even bother to explain all the nonsense that happened, what I can say is that this series had potential, mainly Joe and Love's teamwork as a couple of murderers, but the writers ruined it.TL;DR Love was destroyed as a character so they could kill her off, Joe is back to S1 stalker style as nothing ever happened, and the series is ruined. How sad."},{"id":"rw7475814","title":"Mixed Bag","starRating":"4/10","datePosted":"24 October 2021","text":"I hate to sound like Gene Siskel when reviewing this show. It is entertaining in a train wreck kind of way. I think this show confuses being a deep and complex character with being an unsympathetic/unlikable one. It's just horrible people doing horrible things to each other. The first 2 seasons were at least engaging with the story but hitting season 3 it just feels like they hit a roadblock of ideas and just repeat what they did before but just plug in different characters in their place. I wouldn't expect any less from Greg Berlanti of all people to derail it."},{"id":"rw5753208","title":"Meh.. pretty much sums it up","starRating":"6/10","datePosted":"19 May 2020","text":"So I'm going to do this review without including details about the show because if you want those you can just watch it. Here's the long and short of it, this series had massive potential on paper, and the male lead is pretty good, but the female lead is just awful. There isn't a single appealing thing about her and with a series like this you NEED everyone who should be likable to be likable and everyone who has to be terrible to be terrible.Here's the breakdown, on a scale of 1 to 10, joe is an 8, beck is a 4 and all of her friends are somewhere between 2-4. The reality of the situation is that it's frustrating when you have a pretty decent script and plot but it gets ruined by the character being so badly played that you just don't care whether they live or die. And in some cases really hope they die and get replaced with someone who isn't as awful as them. Sadly that never happened as this isn't one of those twist and turn series where a character who you think of as a main dies in the first 2 seconds and then gets replaced with a character who is actually the main.6/10, had so much potential, woefully under performed."},{"id":"rw7532398","title":"Well too bad there was a season 3 from Netflix","starRating":"","datePosted":"10 November 2021","text":"Season one of this show was fun and interesting, we watched it and enjoyed it a lot. It got a little old with the main female character and her friends and the way Joe just sat around with all the bi**he's all the time. Beck was extremely hard to like and her secrets and lies made her more unlikeable. We already knew Joe was a psychopath so there is really no liking him but he was charming and charismatic and the unfolding of his childhood trauma was interesting. Season two was good except for freaking crazy Forty causing problem after problem, so that got old also. PLUS Joe/Will being in Lalaland opened the door for a lot of really unrealistic people and situations (major eye roller). We saw how people (Love) get beat down into doing things they didn't mean to but did and how family pretty much screws everyone up, it was interesting enough but not as good as the first season. Season three, sux, plain and simple. Joe is always going to fall for someone else who will make him feel like they are the only one, it's REALLY old now. Add in crazy hormonal, impulsive Love and the crap she pulls, the crazy freaky neighbors of madre whatever by San Francisco and how weird Joe starts \"acting\" and I mean it's no longer the charming Joe, he doesn't even seem the same anymore so who cares what he does. We only finished watching because there was nothing else, but then just had to see how it ended. There is absolutely not one person in season three that you like, everyone is a loony caricature of what you imagine in your mind what Californians are and it ain't pretty. Just glad it's over...but you know that Joe will just keep being Joe. Saw there is a 4th season coming, but we will not be watching it, if season three got as woke as it did, poopooing people not getting vaccines or having guns and being all judgmental then season four is a big fat NO. The best line of the show was when Joe said in season one of millennials that he \"hates that generation\", that about sums up how Netflix ruins everything it takes over. If you like all that, you will be fine."},{"id":"rw4655576","title":"Entertaining","starRating":"8/10","datePosted":"13 February 2019","text":"I agree that it is too cliché at times, that some of the characters are annoying, and some plot twists are highly imaginative. However, I have greatly enjoyed watching this show.\nPenn Badgley is 10/10..."},{"id":"rw4554489","title":"I wish Netflix would say their teen angst series were that","starRating":"2/10","datePosted":"2 January 2019","text":"For us, the people with 3 digit IQ and/or anyone over the age of 27 this is a no-op. It's a waste of time but apparently Netflix spends a fortune on marketing in the media telling us how they're going to smash Hollywood"},{"id":"rw8867095","title":"Season 4 is disappointing","starRating":"7/10","datePosted":"12 February 2023","text":"Season 4 (part 1) is riddled with strange dialogue choices, poorly thought out plot lines, and an uninteresting and lazy mystery filled with non sequiturs.It feels somewhat lazy and rushed, and like it's lacking the more particular voice that it once had. Joe isn't as vile, the side characters aren't as interesting, and I find it hard to care about anything in this season. The characters are either fine, or stupidly cartoonish, and Joe's characterization has been watered down.He has a new love interest this season, and it's so unclear why he even likes her in the first place. While he tries to solve the mystery he makes conclusions (more like assumptions) that come out of nowhere and are clearly slapped in for the sake of moving the plot along, whether or not they actually make any sense.Who is Joe? I'm not sure I know anymore. He supposedly has a distain for anti-intellectual modern culture, but he seems to know just as much about it as the average person. He's not out of touch at all like I would expect him to be. His only friends are a bunch of classist socialites who he doesn't even like, or even talk to often it seems, and yet he seems to be a member of their friend group rather quickly even though hardly any of them like him. Why he hangs around in the first place is established far too late. I could be misremembering, but that's what I think.Characters explain their backstories and motivations in long winded exposition dumps that are done with virtually zero finesse, and are oftentimes just straight boring.I still liked it, I guess. I really like the show and I like Joe. Without Joe there'd be no reason for me to watch really. But If you're looking for good writing, stay away from season four :(. Was really rooting for You."},{"id":"rw8869208","title":"By Far The Most Ridiculous Waste of Money","starRating":"1/10","datePosted":"13 February 2023","text":"This is obviously a generational matter to be considered.This is neither funny nor entertaining.The acting is stale, the scripts demented, the entire premise is exhausting by the end of episode one season one.Who pays for these pieces of unadulterated bad taste, senseless scripts, bad acting, bad directing, horrible dialogues, and the once again going into the Darkness of Man's Mind.....How much money did this cost to produce?Who would finance this? And the bigger question is why?Netflix seems to love to through money around just for the sheer joy of seeing if they can 'net' a winner. How do they recoup their financial investment - by researching statistics and demographics and looking for just the right combination to seduce a group of young people who obviously are poorly educated, have no sense of culture nor do they care.Shamefully wasting money for nothing - it will be long forgotten with all too many Netflix original series and films..."},{"id":"rw8881409","title":"Unrealistic and highly frustrating","starRating":"1/10","datePosted":"19 February 2023","text":"I don't often post reviews but after watching season 1 I just have to. Although the story hooks you up from the start, I just can't believe the makers let Joe get away with everything he did. Not only is that highly unrealistic but it also does not provide a sense of fairness to viewers. Of course, the show has to continue for seasons, so the main character has to stay in it, but the fact that Joe can kill, drag bodies, fool everyone, and not even a single camera catching him just bogs my mind. What is even the point of portraying a villain like he is and seeing him enjoy it and get away with it? I just feel like I wasted my time and would not recommend this series to anyone!"},{"id":"rw4765483","title":"Extremely intense but good","starRating":"10/10","datePosted":"6 April 2019","text":"I binged watched this on Netflix in ONE day. The suspense is thrilling and the darkness, wow is it black dark!There were times I had to pause it because it was really dark and disturbing, but it is very well done."},{"id":"rw6367637","title":"INSANE!","starRating":"","datePosted":"15 December 2020","text":"At first I was hesitant to watch this, as I'm not a fan of romance. I watched the trailer, thought it might be dark based on some comments I saw, so why not see it? This series is CRAZIER than what I expected it to be. A LOT CRAZIER.Season 1 was average, but got better in the later episodes. I did almost get bored, but thank God I didn't stop watching it. Because Season 2 is insanely good.I don't want to say more things that might spoil this great series."},{"id":"rw5358900","title":"Tailor made for sociopaths","starRating":"5/10","datePosted":"27 December 2019","text":"S01: 5stars\nS02: 6stars\nAnd this is coming from a person who thrives on slasher and horror genre movies.\nOnly can say S02 is better than 1st season. The episodes pick up in intensity as season progresses and can't help but binge watch it.\nBut every non sociopath (like me) will end up with same same question in mind after finishing the series - WHAT THE HELL DID I WATCH?!\n6th star is for convincing actors who play their part aptly and keep the series engaging with the storyline."},{"id":"rw7461185","title":"Don't watch season 3 👎🏻","starRating":"1/10","datePosted":"19 October 2021","text":"No words can Describe how garbage and baddd this season is 🤐🤐🤐 a total disappointment They have ruining it with unnecessary stuff as well as they ruined Joe Goldberg character\nAnd I don't know what the hell is wrong with Love. Quinn character\nIf you loved you season 2 is enough !!! Don't watch 3rd season ."},{"id":"rw4796005","title":"Addictive!","starRating":"8/10","datePosted":"22 April 2019","text":"I didn't read the novel of this show but now i wish i did! going into the pilot i was skeptical and wasn't sure that it will add up to all the hype, but it actually does! it's such an interesting story and it keeps the pace of tension and creepiness through out the whole season, you're never left bored once, it's the perfect psychological thriller.p.s. Binge watch worthy"},{"id":"rw7460800","title":"3 season is big disappointment","starRating":"5/10","datePosted":"19 October 2021","text":"First two seasons were great, but the third one totally disappointed us with this brain washing of viruses, measles and vaccines... they start killing without point. Like already lack of imagination in this season. It's like watching and being on the phone at the same time. That level."},{"id":"rw6315317","title":"Tiresome","starRating":"5/10","datePosted":"27 November 2020","text":"Some witty writing and neat plot ideas, but this all became too tiresome in the end. Perhaps the concept could have been ok for one series, but not more. I shall not be watching series 3 even if it is the last."},{"id":"rw7761822","title":"Please, stop insulting viewers","starRating":"1/10","datePosted":"15 January 2022","text":"I don't know where to start. Honestly.Bad acting (criminally bad), wannabe Dexter ripoff, convenient, unbelievable story? Take your pick.Basically, everyone is a psycho. C'mon, come up with bit better story and acting."},{"id":"rw8881340","title":"What happened to this great series?","starRating":"2/10","datePosted":"19 February 2023","text":"I really really enjoyed the first 3 series of \"You\", especially the first two but wow, after watching the first episode of the fourth series I regret to say that I realise it is not for me anymore.Ok, the mad killer used to narrate a lot but the first episode seemed like 80% of him yapping about basically nothing, going over and over the same ground again and again.However, my main objection were the other characters.What a totally obnoxious bunch they were, I could not stand any of them.The other series had some likeable people in them, girls and boys but not this one. Just self centered gits who do not live in the real world. Hate them all.Plus, how did Joe ever manage to live in Europe, then rent a huge flat in a posh part of London and become a Literature Professor in a London University'?In England he would need at least a Ph. D and a lot of years of teaching. He has neither.Ludicrous and horrible to watch."},{"id":"rw7599652","title":"Season 3 Trash","starRating":"1/10","datePosted":"29 November 2021","text":"Season 1 & 2 were great. 3 was terrible on so many levels. Obvious forced attempts to be fashionable in todays political climate. Acting was just bad all around. Even the main character Joe seemed disengaged."},{"id":"rw4465925","title":"What a shame!","starRating":"","datePosted":"18 November 2018","text":"I could go on and on about the absolute waste of a great plot line, bad writing for the entire cast with 1 exception etc. But the only thing stopping me even enjoying it as a guilty pleasure (which could've been avoided) is the awful acting by the ever self-involved 'Beck' !!....\nWho on earth? (even with the blatant problems of Joe) would even give this irritating, millennial, pretention the time of day, never mind killing, cheating, obsessing over her, yadayada!!!! ..... Terrible actress and a weak female lead, considering she's supposed to be a 'writer' I feel the irony in her scripts are beyond hilarity.\nThis show only holds up due to Penn Badgley.\nIf it wasn't for his part, this would be entirely unwatchable. I wish more thought could have gone into all of the other vacuous brat pack characters."}]
